StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
    struct {
      __IOM uint32_t DLC        : 4;            /*!< [3..0] Data Length Code                                                   */
      __IM  uint32_t            : 4;
      __IOM uint32_t RTR        : 1;            /*!< [8..8] Remote transmission Request                                        */
      __IOM uint32_t R1         : 1;            /*!< [9..9] Reserved bit R1                                                    */
      __IOM uint32_t R0         : 1;            /*!< [10..10] Reserved bit R0                                                  */
      __IOM uint32_t SRR        : 1;            /*!< [11..11] Substitute Remote Request                                        */
      __IOM uint32_t IDE        : 1;            /*!< [12..12] Frame format                                                     */
    } DLC_b;
  } ;
  
  union {
    __IOM uint32_t DATAL;                       /*!< (@ 0x00000008) Byte[4]..Byte[7]                                           */
    
    struct {
      __IOM uint32_t DB0        : 8;            /*!< [7..0] Byte 0                                                             */
      __IOM uint32_t DB1        : 8;            /*!< [15..8] Byte 1                                                            */
      __IOM uint32_t DB2        : 8;            /*!< [23..16] Byte 2                                                           */
      __IOM uint32_t DB3        : 8;            /*!< [31..24] Byte 3                                                           */
    } DATAL_b;
  } ;
  
  union {
    __IOM uint32_t DATAH;                       /*!< (@ 0x0000000C) [4]..Byte[7]                                               */
    
    struct {
      __IOM uint32_t DB4        : 8;            /*!< [7..0] Byte 0                                                             */
      __IOM uint32_t DB5        : 8;            /*!< [15..8] Byte 1                                                            */
      __IOM uint32_t DB6        : 8;            /*!< [23..16] Byte 2                                                           */
      __IOM uint32_t DB7        : 8;            /*!< [31..24] Byte 3                                                           */
    } DATAH_b;
  } ;
} MDR_CAN1_BUF_Type;                            /*!< Size = 16 (0x10)                                                          */


/**
  * @brief MDR_CAN1_FILTER [FILTER] (Buffer Receive Filters)
  */
typedef struct {
  __IOM uint32_t  MASK;                         /*!< (@ 0x00000000) MASK for receiver ID                                       */
  __IOM uint32_t  FILTER;                       /*!< (@ 0x00000004) FILTER for receiver ID                                     */
} MDR_CAN1_FILTER_Type;                         /*!< Size = 8 (0x8)                                                            */


/** @} */ /* End of group Device_Peripheral_clusters */


/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                        MDR_EEPROM                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief EEPROM Control (MDR_EEPROM)
  */

typedef struct {                                /*!< (@ 0x40018000) MDR_EEPROM Structure                                       */
  
  union {
    __IOM uint32_t CMD;                         /*!< (@ 0x00000000) EEPROM Control register                                    */
    
    struct {
      __IOM uint32_t CON        : 1;            /*!< [0..0] Enable memory access through EEPROM controller                     */
      __IOM uint32_t WR         : 1;            /*!< [1..1] Write operation (test bit)                                         */
      __IOM uint32_t RD         : 1;            /*!< [2..2] Read operation, (test bit)                                         */
      __IOM uint32_t DELAY      : 3;            /*!< [5..3] Memory access CPU delay tacts                                      */
      __IOM uint32_t XE         : 1;            /*!< [6..6] Enable ADDR[16..9]                                                 */
      __IOM uint32_t YE         : 1;            /*!< [7..7] Enable ADDR[8..2]                                                  */
      __IOM uint32_t SE         : 1;            /*!< [8..8] RD Amplifier enable                                                */
      __IOM uint32_t IFREN      : 1;            /*!< [9..9] Select main or info memory                                         */
      __IOM uint32_t ERASE      : 1;            /*!< [10..10] Erase string at ADDR[16:0]                                       */
      __IOM uint32_t MAS1       : 1;            /*!< [11..11] Erase whole block with ERASE                                     */
      __IOM uint32_t PROG       : 1;            /*!< [12..12] Programm EEPROM_DI to ADDR[16:0]                                 */
      __IOM uint32_t NVSTR      : 1;            /*!< [13..13] Memory access mode                                               */
    } CMD_b;
  } ;
  __IOM uint32_t  ADDR;                         /*!< (@ 0x00000004) Address register                                           */
  __IOM uint32_t  DI;                           /*!< (@ 0x00000008) Write data register                                        */
  __IOM uint32_t  DO;                           /*!< (@ 0x0000000C) Read data register                                         */
  __IOM uint32_t  KEY;                          /*!< (@ 0x00000010) Unlock block register                                      */
} MDR_EEPROM_Type;                              /*!< Size = 20 (0x14)                                                          */



/* =========================================================================================================================== */
/* ================                                       MDR_RST_CLOCK                                       ================ */
/* =========================================================================================================================== */


/**
  * @brief CLock Control (MDR_RST_CLOCK)
  */

typedef struct {                                /*!< (@ 0x40020000) MDR_RST_CLOCK Structure                                    */
  
  union {
    __IM  uint32_t CLOCK_STATUS;                /*!< (@ 0x00000000) Clock Status Register                                      */
    
