StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
    struct {
      __IM  uint32_t PLL_USB_RDY : 1;           /*!< [0..0] PLL USP ready                                                      */
      __IM  uint32_t PLL_CPU_RDY : 1;           /*!< [1..1] PLL CPU ready                                                      */
      __IM  uint32_t HSE_RDY    : 1;            /*!< [2..2] HSE generator ready                                                */
      __IM  uint32_t HSE2_RDY   : 1;            /*!< [3..3] HSE2 generator ready                                               */
    } CLOCK_STATUS_b;
  } ;
  
  union {
    __IOM uint32_t PLL_CONTROL;                 /*!< (@ 0x00000004) PLL Control Register                                       */
    
    struct {
      __IOM uint32_t PLL_USB_ON : 1;            /*!< [0..0] PLL USB Enable                                                     */
      __IOM uint32_t PLL_USB_PLD : 1;           /*!< [1..1] PLL USB Restart                                                    */
      __IOM uint32_t PLL_CPU_ON : 1;            /*!< [2..2] PLL CPU Enable                                                     */
      __IOM uint32_t PLL_CPU_PLD : 1;           /*!< [3..3] PLL CPU Restart                                                    */
      __IOM uint32_t PLL_USB_MUL : 4;           /*!< [7..4] PLL USB Mul, [x1 .. x16]                                           */
      __IOM uint32_t PLL_CPU_MUL : 4;           /*!< [11..8] PLL CPU Mul, [x1 .. x16]                                          */
    } PLL_CONTROL_b;
  } ;
  
  union {
    __IOM uint32_t HS_CONTROL;                  /*!< (@ 0x00000008) HSE Generator Control                                      */
    
    struct {
      __IOM uint32_t HSE_ON     : 1;            /*!< [0..0] HSE Enable                                                         */
      __IOM uint32_t HSE_BYP    : 1;            /*!< [1..1] HSE Bypass Mode                                                    */
      __IOM uint32_t HSE2_ON    : 1;            /*!< [2..2] HSE2 Enable                                                        */
      __IOM uint32_t HSE2_BYP   : 1;            /*!< [3..3] HSE2 Bypass Mode                                                   */
    } HS_CONTROL_b;
  } ;
  
  union {
    __IOM uint32_t CPU_CLOCK;                   /*!< (@ 0x0000000C) CPU Clock Control                                          */
    
    struct {
      __IOM uint32_t CPU_C1_SEL : 2;            /*!< [1..0] CPU_C1 mux freq select                                             */
      __IOM uint32_t CPU_C2_SEL : 1;            /*!< [2..2] CPU_C2 mux freq select                                             */
      __IM  uint32_t            : 1;
      __IOM uint32_t CPU_C3_SEL : 4;            /*!< [7..4] CPU_C2 mux output freq devider, [/1, /2, /4 .. /256]               */
      __IOM uint32_t HCLK_SEL   : 2;            /*!< [9..8] Select Clock for CPU                                               */
    } CPU_CLOCK_b;
  } ;
  
  union {
    __IOM uint32_t USB_CLOCK;                   /*!< (@ 0x00000010) USB Clock Control                                          */
    
    struct {
      __IOM uint32_t USB_C1_SEL : 2;            /*!< [1..0] USB_C1 mux freq select                                             */
      __IOM uint32_t USB_C2_SEL : 1;            /*!< [2..2] USB_C2 mux freq select                                             */
      __IM  uint32_t            : 1;
      __IOM uint32_t USB_C3_SEL : 1;            /*!< [4..4] USB_C3 Input Select                                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t USB_EN     : 1;            /*!< [8..8] USB Clock Enable                                                   */
    } USB_CLOCK_b;
  } ;
  
  union {
    __IOM uint32_t ADC_CLOCK;                   /*!< (@ 0x00000014) ADC Clock Control                                          */
    
    struct {
      __IOM uint32_t ADC_C1_SEL : 2;            /*!< [1..0] ADC_C1 mux freq select                                             */
      __IM  uint32_t            : 2;
      __IOM uint32_t ADC_C2_SEL : 2;            /*!< [5..4] ADC_C2 mux freq select                                             */
      __IM  uint32_t            : 2;
      __IOM uint32_t ADC_C3_SEL : 4;            /*!< [11..8] ADC_C2 mux output freq devider, [/1, /2, /4 .. /256]              */
      __IM  uint32_t            : 1;
      __IOM uint32_t ADC_CLK_EN : 1;            /*!< [13..13] ADC Clock Enable                                                 */
    } ADC_CLOCK_b;
  } ;
  
  union {
    __IOM uint32_t RTC_CLOCK;                   /*!< (@ 0x00000018) RTC Clock Control                                          */
    
    struct {
      __IOM uint32_t HSE_SEL    : 4;            /*!< [3..0] RTC HSE freq devider, [/1, /2, /4 .. /256]                         */
      __IOM uint32_t HSI_SEL    : 4;            /*!< [7..4] RTC HSI freq devider, [/1, /2, /4 .. /256]                         */
      __IOM uint32_t HSE_RTC_EN : 1;            /*!< [8..8] RTC HSE Clock enable                                               */
      __IOM uint32_t HSI_RTC_EN : 1;            /*!< [9..9] RTC HSI Clock enable                                               */
    } RTC_CLOCK_b;
  } ;
  
  union {
    __IOM uint32_t PER_CLOCK;                   /*!< (@ 0x0000001C) Peripherials Clock Control                                 */
    
    struct {
      __IOM uint32_t CAN1_CLK_EN : 1;           /*!< [0..0] CAN1 Clock Enable                                                  */
      __IOM uint32_t CAN2_CLK_EN : 1;           /*!< [1..1] CAN2 Clock Enable                                                  */
      __IOM uint32_t USB_CLK_EN : 1;            /*!< [2..2] USB Clock Enable                                                   */
      __IOM uint32_t EEPROM_CLK_EN : 1;         /*!< [3..3] EEPROM Controller Clock Enable                                     */
      __IOM uint32_t RST_CLK_EN : 1;            /*!< [4..4] RST Clock Enable                                                   */
      __IOM uint32_t DMA_CLK_EN : 1;            /*!< [5..5] DMA Clock Enable                                                   */
      __IOM uint32_t UART1_CLK_EN : 1;          /*!< [6..6] UART1 Clock Enable                                                 */
      __IOM uint32_t UART2_CLK_EN : 1;          /*!< [7..7] UART2 Clock Enable                                                 */
      __IOM uint32_t SPI1_CLK_EN : 1;           /*!< [8..8] SPI1 Clock Enable                                                  */
      __IOM uint32_t MIL1_CLK_EN : 1;           /*!< [9..9] MIL1 Clock Enable                                                  */
      __IOM uint32_t MIL2_CLK_EN : 1;           /*!< [10..10] MIL2 Clock Enable                                                */
      __IOM uint32_t PWR_CLK_EN : 1;            /*!< [11..11] Power Clock Enable                                               */
      __IOM uint32_t WWDT_CLK_EN : 1;           /*!< [12..12] WWDT Clock Enable                                                */
      __IOM uint32_t IWDT_CLK_EN : 1;           /*!< [13..13] IWDT Clock Enable                                                */
      __IOM uint32_t TIMER1_CLK_EN : 1;         /*!< [14..14] TIMER1 Clock Enable                                              */
      __IOM uint32_t TIMER2_CLK_EN : 1;         /*!< [15..15] TIMER2 Clock Enable                                              */
      __IOM uint32_t TIMER3_CLK_EN : 1;         /*!< [16..16] TIMER3 Clock Enable                                              */
      __IOM uint32_t ADC_CLK_EN : 1;            /*!< [17..17] ADC Clock Enable                                                 */
      __IOM uint32_t DAC_CLK_EN : 1;            /*!< [18..18] DAC Clock Enable                                                 */
      __IOM uint32_t TIMER4_CLK_EN : 1;         /*!< [19..19] TIMER4 Clock Enable                                              */
      __IOM uint32_t SPI2_CLK_EN : 1;           /*!< [20..20] SPI2 Clock Enable                                                */
      __IOM uint32_t PORTA_CLK_EN : 1;          /*!< [21..21] GPIO PORT_A Clock Enable                                         */
      __IOM uint32_t PORTB_CLK_EN : 1;          /*!< [22..22] GPIO PORT_B Clock Enable                                         */
      __IOM uint32_t PORTC_CLK_EN : 1;          /*!< [23..23] GPIO PORT_C Clock Enable                                         */
      __IOM uint32_t PORTD_CLK_EN : 1;          /*!< [24..24] GPIO PORT_D Clock Enable                                         */
      __IOM uint32_t PORTE_CLK_EN : 1;          /*!< [25..25] GPIO PORT_E Clock Enable                                         */
      __IOM uint32_t ARINC_RX_CLK_EN : 1;       /*!< [26..26] ARINC_RX Clock Enable                                            */
      __IOM uint32_t BKP_CLK_EN : 1;            /*!< [27..27] Backup Clock Enable                                              */
      __IOM uint32_t ARINC_TX_CLK_EN : 1;       /*!< [28..28] ARINC_TX Clock Enable                                            */
      __IOM uint32_t PORTF_CLK_EN : 1;          /*!< [29..29] GPIO PORT_F Clock Enable                                         */
      __IOM uint32_t EBC_CLK_EN : 1;            /*!< [30..30] External Bus Clock Enable                                        */
      __IOM uint32_t SPI3_CLK_EN : 1;           /*!< [31..31] SPI3 Clock Enable                                                */
    } PER_CLOCK_b;
  } ;
  
  union {
    __IOM uint32_t CAN_CLOCK;                   /*!< (@ 0x00000020) CAN's Clock Control                                        */
    
