StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
    struct {
      __IOM uint32_t CAN1_BRG   : 3;            /*!< [2..0] HCLK divider to get CAN1_CLOCK, [/1, /2, /4 .. /128]               */
      __IM  uint32_t            : 5;
      __IOM uint32_t CAN2_BRG   : 3;            /*!< [10..8] HCLK freq divider to get CAN2_CLOCK, [/1, /2, /4 ..
                                                     /128]                                                                     */
      __IM  uint32_t            : 13;
      __IOM uint32_t CAN1_CLK_EN : 1;           /*!< [24..24] CAN1_CLOCK enable                                                */
      __IOM uint32_t CAN2_CLK_EN : 1;           /*!< [25..25] CAN2_CLOCK enable                                                */
    } CAN_CLOCK_b;
  } ;
  
  union {
    __IOM uint32_t TIM_CLOCK;                   /*!< (@ 0x00000024) Timer's Clock Control                                      */
    
    struct {
      __IOM uint32_t TIM1_BRG   : 3;            /*!< [2..0] HCLK freq divider to get TIM1_CLOCK, [/1, /2, /4 .. /128]          */
      __IM  uint32_t            : 5;
      __IOM uint32_t TIM2_BRG   : 3;            /*!< [10..8] HCLK freq divider to get TIM2_CLOCK, [/1, /2, /4 ..
                                                     /128]                                                                     */
      __IM  uint32_t            : 5;
      __IOM uint32_t TIM3_BRG   : 3;            /*!< [18..16] HCLK freq divider to get TIM3_CLOCK, [/1, /2, /4 ..
                                                     /128]                                                                     */
      __IM  uint32_t            : 5;
      __IOM uint32_t TIM1_CLK_EN : 1;           /*!< [24..24] TIM1_CLOCK enable                                                */
      __IOM uint32_t TIM2_CLK_EN : 1;           /*!< [25..25] TIM2_CLOCK enable                                                */
      __IOM uint32_t TIM3_CLK_EN : 1;           /*!< [26..26] TIM3_CLOCK enable                                                */
    } TIM_CLOCK_b;
  } ;
  
  union {
    __IOM uint32_t UART_CLOCK;                  /*!< (@ 0x00000028) UART's Clock Control                                       */
    
    struct {
      __IOM uint32_t UART1_BRG  : 3;            /*!< [2..0] HCLK freq divider to get UART1_CLOCK, [/1, /2, /4 ..
                                                     /128]                                                                     */
      __IM  uint32_t            : 5;
      __IOM uint32_t UART2_BRG  : 3;            /*!< [10..8] HCLK freq divider to get UART2_CLOCK, [/1, /2, /4 ..
                                                     /128]                                                                     */
      __IM  uint32_t            : 5;
      __IOM uint32_t TIM4_BRG   : 3;            /*!< [18..16] HCLK freq divider to get TIM4_CLOCK, [/1, /2, /4 ..
                                                     /128]                                                                     */
      __IM  uint32_t            : 5;
      __IOM uint32_t UART1_CLK_EN : 1;          /*!< [24..24] UART1_CLOCK enable                                               */
      __IOM uint32_t UART2_CLK_EN : 1;          /*!< [25..25] UART2_CLOCK enable                                               */
      __IOM uint32_t TIM4_CLK_EN : 1;           /*!< [26..26] TIM4_CLOCK enable                                                */
    } UART_CLOCK_b;
  } ;
  
  union {
    __IOM uint32_t SSP_CLOCK;                   /*!< (@ 0x0000002C) SSP's Clock Control                                        */
    
    struct {
      __IOM uint32_t SSP1_BRG   : 3;            /*!< [2..0] HCLK freq divider to get SSP1_CLOCK, [/1, /2, /4 .. /128]          */
      __IM  uint32_t            : 5;
      __IOM uint32_t SSP2_BRG   : 3;            /*!< [10..8] HCLK freq divider to get SSP2_CLOCK, [/1, /2, /4 ..
                                                     /128]                                                                     */
      __IM  uint32_t            : 5;
      __IOM uint32_t SSP3_BRG   : 3;            /*!< [18..16] HCLK freq divider to get SSP3_CLOCK, [/1, /2, /4 ..
                                                     /128]                                                                     */
      __IM  uint32_t            : 5;
      __IOM uint32_t SSP1_CLK_EN : 1;           /*!< [24..24] SSP1_CLOCK Enable                                                */
      __IOM uint32_t SSP2_CLK_EN : 1;           /*!< [25..25] SSP2_CLOCK Enable                                                */
      __IOM uint32_t SSP3_CLK_EN : 1;           /*!< [26..26] SSP3_CLOCK Enable                                                */
    } SSP_CLOCK_b;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t ETH_CLOCK;                   /*!< (@ 0x00000034) Ethernet and MIL Clock Control                             */
    
    struct {
      __IOM uint32_t ETH_BRG    : 8;            /*!< [7..0] Always set to 0!                                                   */
      __IOM uint32_t MIL_BRG    : 3;            /*!< [10..8] HCLK freq divider to get MAN_CLOCK, [/1, /2, /4 .. /128]          */
      __IM  uint32_t            : 5;
      __IOM uint32_t PHY_BRG    : 3;            /*!< [18..16] HCLK freq divider to get PHY_CLOCK, [/1, /2, /4 ..
                                                     /128]                                                                     */
      __IM  uint32_t            : 5;
      __IOM uint32_t ETH_CLK_EN : 1;            /*!< [24..24] Ethernet MAC Clock Enable                                        */
      __IOM uint32_t MIL_CLK_EN : 1;            /*!< [25..25] MIL-STD CLOCK Enable                                             */
      __IOM uint32_t SLEEP      : 1;            /*!< [26..26] Switch to Sleep mode                                             */
      __IOM uint32_t PHY_CLK_EN : 1;            /*!< [27..27] Ethernet PHY CLOCK Enable                                        */
      __IOM uint32_t PHY_CLK_SEL : 2;           /*!< [29..28] Ethernet PHY CLOCK Select                                        */
    } ETH_CLOCK_b;
  } ;
} MDR_RST_CLOCK_Type;                           /*!< Size = 56 (0x38)                                                          */



/* =========================================================================================================================== */
/* ================                                          MDR_DMA                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief DMA Controler (MDR_DMA)
  */

typedef struct {                                /*!< (@ 0x40028000) MDR_DMA Structure                                          */
  
  union {
    __IM  uint32_t STATUS;                      /*!< (@ 0x00000000) Status register                                            */
    
