StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
    struct {
      __IOM uint32_t PVDEN      : 1;            /*!< [0..0] Enable Ucc detector                                                */
      __IOM uint32_t PBLS       : 2;            /*!< [2..1] BUcc compare level                                                 */
      __IOM uint32_t PLS        : 3;            /*!< [5..3] Ucc compare level                                                  */
      __IOM uint32_t PVBD       : 1;            /*!< [6..6] Event on BUcc gt PBLS                                              */
      __IOM uint32_t PVD        : 1;            /*!< [7..7] Event on Ucc gt PLS                                                */
      __IOM uint32_t IEPVBD     : 1;            /*!< [8..8] Enable IRQ by PVBD event                                           */
      __IOM uint32_t IEPVD      : 1;            /*!< [9..9] Enable IRQ by PVD event                                            */
      __IOM uint32_t INVB       : 1;            /*!< [10..10] PVBD event on BUcc lt PBLS                                       */
      __IOM uint32_t INV        : 1;            /*!< [11..11] PVD event on BUcc lt PBLS                                        */
      __IOM uint32_t PVDBEN     : 1;            /*!< [12..12] Enable BUcc detector                                             */
    } PVDCS_b;
  } ;
  
  union {
    __IM  uint32_t ResReg;                      /*!< (@ 0x00000004) Reserved register                                          */
    
    struct {
      __IM  uint32_t Value      : 32;           /*!< [31..0] blank                                                             */
    } ResReg_b;
  } ;
} MDR_Power_Type;                               /*!< Size = 8 (0x8)                                                            */



/* =========================================================================================================================== */
/* ================                                         MDR_WWDT                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Window Watchdog Timer (MDR_WWDT)
  */

typedef struct {                                /*!< (@ 0x40060000) MDR_WWDT Structure                                         */
  
  union {
    __IOM uint32_t CR;                          /*!< (@ 0x00000000) WWDT Control register                                      */
    
    struct {
      __IOM uint32_t T          : 7;            /*!< [6..0] Counter                                                            */
      __IOM uint32_t WDGA       : 1;            /*!< [7..7] Enable                                                             */
    } CR_b;
  } ;
  
  union {
    __IOM uint32_t CFR;                         /*!< (@ 0x00000004) WWDT Config register                                       */
    
    struct {
      __IOM uint32_t W          : 7;            /*!< [6..0] Window value                                                       */
      __IOM uint32_t WGTB       : 2;            /*!< [8..7] Clock Divider                                                      */
      __IOM uint32_t EWI        : 1;            /*!< [9..9] Early Window Interrupt                                             */
    } CFR_b;
  } ;
  
  union {
    __IOM uint32_t SR;                          /*!< (@ 0x00000008) WWDT Status register                                       */
    
    struct {
      __IOM uint32_t EWIF       : 1;            /*!< [0..0] Early Window Flag                                                  */
    } SR_b;
  } ;
} MDR_WWDT_Type;                                /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                         MDR_IWDT                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Independent Watchdog Timer (MDR_IWDT)
  */

typedef struct {                                /*!< (@ 0x40068000) MDR_IWDT Structure                                         */
  
  union {
    __OM  uint32_t KR;                          /*!< (@ 0x00000000) Key register                                               */
    
    struct {
      __OM  uint32_t KEY        : 16;           /*!< [15..0] Enable, start and reload control                                  */
    } KR_b;
  } ;
  
  union {
    __IOM uint32_t PR;                          /*!< (@ 0x00000004) Clock Prescaler register                                   */
    
    struct {
      __IOM uint32_t PR         : 3;            /*!< [2..0] Prescaler Register                                                 */
    } PR_b;
  } ;
  
  union {
    __IOM uint32_t RLR;                         /*!< (@ 0x00000008) Reload Period Register                                     */
    
    struct {
      __IOM uint32_t PRL        : 12;           /*!< [11..0] Timer Period Value                                                */
    } RLR_b;
  } ;
  
  union {
    __IM  uint32_t SR;                          /*!< (@ 0x0000000C) Status Regster                                             */
    
    struct {
      __IM  uint32_t PVU        : 1;            /*!< [0..0] PR busy                                                            */
      __IM  uint32_t RVU        : 1;            /*!< [1..1] PRL busy                                                           */
    } SR_b;
  } ;
} MDR_IWDT_Type;                                /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                          MDR_ADC                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Successive Approximation ADC (MDR_ADC)
  */

typedef struct {                                /*!< (@ 0x40088000) MDR_ADC Structure                                          */
  
  union {
    __IOM uint32_t ADC1_Cfg;                    /*!< (@ 0x00000000) ADC1 config register                                       */
    
