StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
    struct {
      __IOM uint32_t ADON       : 1;            /*!< [0..0] Enable ADC                                                         */
      __IOM uint32_t GO         : 1;            /*!< [1..1] Start single ADC mesurement                                        */
      __IOM uint32_t CLKS       : 1;            /*!< [2..2] Select Clock                                                       */
      __IOM uint32_t SAMPLE     : 1;            /*!< [3..3] Single or Continuous measurement                                   */
      __IOM uint32_t CHS        : 5;            /*!< [8..4] Active channel select                                              */
      __IOM uint32_t CHCH       : 1;            /*!< [9..9] Channel switching enable                                           */
      __IOM uint32_t RGNC       : 1;            /*!< [10..10] Signal limiters enable                                           */
      __IOM uint32_t M_REF      : 1;            /*!< [11..11] Signal amplitude reference                                       */
      __IOM uint32_t DIV_CLK    : 4;            /*!< [15..12] Divider for CPU_Clock usage                                      */
      __IM  uint32_t            : 1;
      __IOM uint32_t TS_EN      : 1;            /*!< [17..17] Thermosensor enable                                              */
      __IOM uint32_t TS_BUFF_EN : 1;            /*!< [18..18] Thermosensor buffer enable                                       */
      __IOM uint32_t SEL_TS     : 1;            /*!< [19..19] Output temperature from Thermosensor                             */
      __IOM uint32_t SEL_VREF   : 1;            /*!< [20..20] Output Vref=1.23 from Thermosensor                               */
      __IM  uint32_t            : 4;
      __IOM uint32_t Delay_GO   : 3;            /*!< [27..25] Delay after channels switching in CPU_CLK                        */
    } ADC1_Cfg_b;
  } ;
  
  union {
    __IOM uint32_t ADC2_Cfg;                    /*!< (@ 0x00000004) ADC2 config register                                       */
    
    struct {
      __IM  uint32_t            : 17;
      __IOM uint32_t ADC1_OP    : 1;            /*!< [17..17] ADC1 Setpoint Vref source                                        */
    } ADC2_Cfg_b;
  } ;
  
  union {
    __IOM uint32_t ADC1_H_Level;                /*!< (@ 0x00000008) ADC High limit                                             */
    
    struct {
      __IOM uint32_t Level      : 12;           /*!< [11..0] Signal limit level                                                */
    } ADC1_H_Level_b;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t ADC1_L_Level;                /*!< (@ 0x00000010) ADC Low limit                                              */
    
    struct {
      __IOM uint32_t Level      : 12;           /*!< [11..0] Signal limit level                                                */
    } ADC1_L_Level_b;
  } ;
  __IM  uint32_t  RESERVED1;
  
  union {
    __IM  uint32_t ADC1_RESULT;                 /*!< (@ 0x00000018) ADC result register                                        */
    
    struct {
      __IM  uint32_t Value      : 12;           /*!< [11..0] Channel signal value                                              */
      __IM  uint32_t            : 4;
      __IM  uint32_t Channel    : 5;            /*!< [20..16] Channel index                                                    */
    } ADC1_RESULT_b;
  } ;
  __IM  uint32_t  RESERVED2;
  
  union {
    __IOM uint32_t ADC1_STATUS;                 /*!< (@ 0x00000020) ADC status register                                        */
    
    struct {
      __IOM uint32_t Overwrite  : 1;            /*!< [0..0] Result overwritten flag                                            */
      __IOM uint32_t AWOIFEN    : 1;            /*!< [1..1] Signal is out of limiters range                                    */
      __IOM uint32_t EOCIF      : 1;            /*!< [2..2] Result ready to read                                               */
      __IOM uint32_t AWOIF_IE   : 1;            /*!< [3..3] Enable IRQ by AWOIFEN flag                                         */
      __IOM uint32_t EOCIF_EN   : 1;            /*!< [4..4] Enable IRQ by EOCIF flag                                           */
    } ADC1_STATUS_b;
  } ;
  __IM  uint32_t  RESERVED3;
  
  union {
    __IOM uint32_t ADC1_CHSEL;                  /*!< (@ 0x00000028) ADC channels select register                               */
    
    struct {
      __IOM uint32_t Channel_0  : 1;            /*!< [0..0] Signal on PD7, Ref+                                                */
      __IOM uint32_t Channel_1  : 1;            /*!< [1..1] Signal on PD8, Ref-                                                */
      __IOM uint32_t Channel_2  : 1;            /*!< [2..2] Signal on PD9                                                      */
      __IOM uint32_t Channel_3  : 1;            /*!< [3..3] Signal on PD10                                                     */
      __IOM uint32_t Channel_4  : 1;            /*!< [4..4] Signal on PD11                                                     */
      __IOM uint32_t Channel_5  : 1;            /*!< [5..5] Signal on PD12                                                     */
      __IOM uint32_t Channel_6  : 1;            /*!< [6..6] Signal on PD13                                                     */
      __IOM uint32_t Channel_7  : 1;            /*!< [7..7] Signal on PD14                                                     */
      __IM  uint32_t            : 22;
      __IOM uint32_t Channel_30 : 1;            /*!< [30..30] VRef from Thermosensor                                           */
      __IOM uint32_t Channel_31 : 1;            /*!< [31..31] Temperature from Thermosensor                                    */
    } ADC1_CHSEL_b;
  } ;
  __IM  uint32_t  RESERVED4;
  
  union {
    __IOM uint32_t ADC1_TRIM;                   /*!< (@ 0x00000030) ADC TS_Vref trim register                                  */
    
