StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
    struct {
      __IOM uint32_t Value      : 20;           /*!< [19..0] RTC DIV value                                                     */
    } RTC_DIV_b;
  } ;
  
  union {
    __IOM uint32_t RTC_PRL;                     /*!< (@ 0x00000048) Period value for DIV counter                               */
    
    struct {
      __IOM uint32_t Value      : 20;           /*!< [19..0] RTC PRL value                                                     */
    } RTC_PRL_b;
  } ;
  
  union {
    __IOM uint32_t RTC_ALRM;                    /*!< (@ 0x0000004C) Event value for CNT counter                                */
    
    struct {
      __IOM uint32_t Value      : 32;           /*!< [31..0] Alarm value of CNT                                                */
    } RTC_ALRM_b;
  } ;
  
  union {
    __IOM uint32_t RTC_CS;                      /*!< (@ 0x00000050) RTC Control and Status                                     */
    
    struct {
      __IOM uint32_t OWF        : 1;            /*!< [0..0] CNT Overflow flag, clear by set 1                                  */
      __IOM uint32_t SECF       : 1;            /*!< [1..1] DIV == PRL Event, clear by set 1                                   */
      __IOM uint32_t ALRF       : 1;            /*!< [2..2] CNT == ALRM Event, clear by set 1                                  */
      __IOM uint32_t OWF_IE     : 1;            /*!< [3..3] Enable IRQ by OWF                                                  */
      __IOM uint32_t SECF_IE    : 1;            /*!< [4..4] Enable IRQ by SECF                                                 */
      __IOM uint32_t ALRF_IE    : 1;            /*!< [5..5] Enable IRQ by ALRF                                                 */
      __IOM uint32_t WEC        : 1;            /*!< [6..6] RTC Busy flag                                                      */
    } RTC_CS_b;
  } ;
} MDR_BKP_Type;                                 /*!< Size = 84 (0x54)                                                          */



/* =========================================================================================================================== */
/* ================                                         MDR_CAN1                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief CAN Control (MDR_CAN1)
  */

typedef struct {                                /*!< (@ 0x40000000) MDR_CAN1 Structure                                         */
  
  union {
    __IOM uint32_t CONTROL;                     /*!< (@ 0x00000000) Control register                                           */
    
    struct {
      __IOM uint32_t CAN_EN     : 1;            /*!< [0..0] Enable CAN                                                         */
      __IOM uint32_t ROM        : 1;            /*!< [1..1] Read Only Mode                                                     */
      __IOM uint32_t STM        : 1;            /*!< [2..2] Self Test Mode                                                     */
      __IOM uint32_t SAP        : 1;            /*!< [3..3] Send Ack for Own Packets                                           */
      __IOM uint32_t ROP        : 1;            /*!< [4..4] Receive Own Packets                                                */
    } CONTROL_b;
  } ;
  
  union {
    __IOM uint32_t STATUS;                      /*!< (@ 0x00000004) STATUS register                                            */
    
    struct {
      __IOM uint32_t RX_Ready   : 1;            /*!< [0..0] Some Buff Data received                                            */
      __IOM uint32_t TX_Ready   : 1;            /*!< [1..1] Some buff has data to send                                         */
      __IOM uint32_t ERR_Over   : 1;            /*!< [2..2] TEC o REC exceeds ERROR_MAX                                        */
      __IOM uint32_t ERR_Bit    : 1;            /*!< [3..3] Error while TX some bit                                            */
      __IOM uint32_t ERR_StuffBit : 1;          /*!< [4..4] Error in Staff Bit                                                 */
      __IOM uint32_t ERR_CRC    : 1;            /*!< [5..5] CRC Error                                                          */
      __IOM uint32_t ERR_FRAME  : 1;            /*!< [6..6] Wrong Frame structure                                              */
      __IOM uint32_t ERR_ACK    : 1;            /*!< [7..7] Acknowledge error                                                  */
      __IOM uint32_t ID_Lover   : 1;            /*!< [8..8] Arbitrage failure                                                  */
      __IOM uint32_t ERR_Status : 2;            /*!< [10..9] Eror status                                                       */
      __IOM uint32_t RX_ERR_CNT8 : 1;           /*!< [11..11] REC > 255, BusOff                                                */
      __IOM uint32_t TX_ERR_CNT8 : 1;           /*!< [12..12] TEC > 255, BusOff                                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t RX_ERR_CNT : 8;            /*!< [23..16] Rx Error Counter                                                 */
      __IOM uint32_t TX_ERR_CNT : 8;            /*!< [31..24] Tx Error Counter                                                 */
    } STATUS_b;
  } ;
  
  union {
    __IOM uint32_t BITTMNG;                     /*!< (@ 0x00000008) Bit Timing register                                        */
    
    struct {
      __IOM uint32_t BRP        : 16;           /*!< [15..0] Boud Rate Prescaler to TQ                                         */
      __IOM uint32_t PSEG       : 3;            /*!< [18..16] Propagation time in TQ                                           */
      __IOM uint32_t SEG1       : 3;            /*!< [21..19] Delay before line sampling                                       */
      __IOM uint32_t SEG2       : 3;            /*!< [24..22] Delay after line sampling                                        */
      __IOM uint32_t SJW        : 2;            /*!< [26..25] Sync phase deviation                                             */
      __IOM uint32_t SB         : 1;            /*!< [27..27] Line Sampling Count                                              */
    } BITTMNG_b;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t INT_EN;                      /*!< (@ 0x00000010) IRQ Enable                                                 */
    
