StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
    struct {
      __IOM uint32_t GLB_IntEn  : 1;            /*!< [0..0] IRQ Enable Global                                                  */
      __IOM uint32_t RX_IntEn   : 1;            /*!< [1..1] Enable IRQ on RX                                                   */
      __IOM uint32_t TX_IntEn   : 1;            /*!< [2..2] Enable IRQ on TX                                                   */
      __IOM uint32_t ERR_IntEn  : 1;            /*!< [3..3] Enable IRQ on Error                                                */
      __IOM uint32_t ErrOV_IntEn : 1;           /*!< [4..4] Enable IRQ of Error Over                                           */
    } INT_EN_b;
  } ;
  __IM  uint32_t  RESERVED1[2];
  
  union {
    __IOM uint32_t OVER;                        /*!< (@ 0x0000001C) ERROR_MAX level                                            */
    
    struct {
      __IOM uint32_t ERROR_MAX  : 8;            /*!< [7..0] Level of TEC or REC errors to OverIRQ                              */
    } OVER_b;
  } ;
  
  union {
    __IOM uint32_t RX_ID;                       /*!< (@ 0x00000020) Last Received ID                                           */
    
    struct {
      __IOM uint32_t EID        : 18;           /*!< [17..0] Extended frame ID                                                 */
      __IOM uint32_t SID        : 11;           /*!< [28..18] Standard frame ID                                                */
    } RX_ID_b;
  } ;
  
  union {
    __IOM uint32_t RX_DLC;                      /*!< (@ 0x00000024) Last Received ControlField                                 */
    
    struct {
      __IOM uint32_t DLC        : 4;            /*!< [3..0] Data Length Code                                                   */
      __IM  uint32_t            : 4;
      __IOM uint32_t RTR        : 1;            /*!< [8..8] Remote transmission Request                                        */
      __IOM uint32_t R1         : 1;            /*!< [9..9] Reserved bit R1                                                    */
      __IOM uint32_t R0         : 1;            /*!< [10..10] Reserved bit R0                                                  */
      __IOM uint32_t SRR        : 1;            /*!< [11..11] Substitute Remote Request                                        */
      __IOM uint32_t IDE        : 1;            /*!< [12..12] Frame format                                                     */
    } RX_DLC_b;
  } ;
  
  union {
    __IOM uint32_t RX_DATAL;                    /*!< (@ 0x00000028) Received Byte[0]..Byte[3]                                  */
    
    struct {
      __IOM uint32_t DB0        : 8;            /*!< [7..0] Byte 0                                                             */
      __IOM uint32_t DB1        : 8;            /*!< [15..8] Byte 1                                                            */
      __IOM uint32_t DB2        : 8;            /*!< [23..16] Byte 2                                                           */
      __IOM uint32_t DB3        : 8;            /*!< [31..24] Byte 3                                                           */
    } RX_DATAL_b;
  } ;
  
  union {
    __IOM uint32_t RX_DATAH;                    /*!< (@ 0x0000002C) Received Byte[4]..Byte[7]                                  */
    
    struct {
      __IOM uint32_t DB4        : 8;            /*!< [7..0] Byte 0                                                             */
      __IOM uint32_t DB5        : 8;            /*!< [15..8] Byte 1                                                            */
      __IOM uint32_t DB6        : 8;            /*!< [23..16] Byte 2                                                           */
      __IOM uint32_t DB7        : 8;            /*!< [31..24] Byte 3                                                           */
    } RX_DATAH_b;
  } ;
  
  union {
    __IOM uint32_t TX_ID;                       /*!< (@ 0x00000030) Last Sent ID                                               */
    
    struct {
      __IOM uint32_t EID        : 18;           /*!< [17..0] Extended frame ID                                                 */
      __IOM uint32_t SID        : 11;           /*!< [28..18] Standard frame ID                                                */
    } TX_ID_b;
  } ;
  
  union {
    __IOM uint32_t TX_DLC;                      /*!< (@ 0x00000034) Last Sent ControlField                                     */
    
    struct {
      __IOM uint32_t DLC        : 4;            /*!< [3..0] Data Length Code                                                   */
      __IM  uint32_t            : 4;
      __IOM uint32_t RTR        : 1;            /*!< [8..8] Remote transmission Request                                        */
      __IOM uint32_t R1         : 1;            /*!< [9..9] Reserved bit R1                                                    */
      __IOM uint32_t R0         : 1;            /*!< [10..10] Reserved bit R0                                                  */
      __IOM uint32_t SRR        : 1;            /*!< [11..11] Substitute Remote Request                                        */
      __IOM uint32_t IDE        : 1;            /*!< [12..12] Frame format                                                     */
    } TX_DLC_b;
  } ;
  
  union {
    __IOM uint32_t TX_DATAL;                    /*!< (@ 0x00000038) Last Sent Byte[4]..Byte[7]                                 */
    
    struct {
      __IOM uint32_t DB0        : 8;            /*!< [7..0] Byte 0                                                             */
      __IOM uint32_t DB1        : 8;            /*!< [15..8] Byte 1                                                            */
      __IOM uint32_t DB2        : 8;            /*!< [23..16] Byte 2                                                           */
      __IOM uint32_t DB3        : 8;            /*!< [31..24] Byte 3                                                           */
    } TX_DATAL_b;
  } ;
  
  union {
    __IOM uint32_t TX_DATAH;                    /*!< (@ 0x0000003C) Last Sent Byte[4]..Byte[7]                                 */
    
