StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
    struct {
      __IOM uint32_t DB4        : 8;            /*!< [7..0] Byte 0                                                             */
      __IOM uint32_t DB5        : 8;            /*!< [15..8] Byte 1                                                            */
      __IOM uint32_t DB6        : 8;            /*!< [23..16] Byte 2                                                           */
      __IOM uint32_t DB7        : 8;            /*!< [31..24] Byte 3                                                           */
    } TX_DATAH_b;
  } ;
  
  union {
    __IOM uint32_t BUF_CON0;                    /*!< (@ 0x00000040) Buffer control                                             */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] Buffer enable                                                      */
      __IOM uint32_t RX_TX      : 1;            /*!< [1..1] Buffer Direction                                                   */
      __IOM uint32_t OVER_EN    : 1;            /*!< [2..2] Overwrite enable                                                   */
      __IOM uint32_t RTR_EN     : 1;            /*!< [3..3] RTR ACK enable                                                     */
      __IOM uint32_t PRIOR_OFF  : 1;            /*!< [4..4] Send priority Off                                                  */
      __IOM uint32_t TX_REQ     : 1;            /*!< [5..5] Request to send                                                    */
      __IOM uint32_t RX_FULL    : 1;            /*!< [6..6] Has new data                                                       */
      __IOM uint32_t OVER_WR    : 1;            /*!< [7..7] Data overwritten                                                   */
    } BUF_CON0_b;
  } ;
  
  union {
    __IOM uint32_t BUF_CON1;                    /*!< (@ 0x00000044) Buffer control                                             */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] Buffer enable                                                      */
      __IOM uint32_t RX_TX      : 1;            /*!< [1..1] Buffer Direction                                                   */
      __IOM uint32_t OVER_EN    : 1;            /*!< [2..2] Overwrite enable                                                   */
      __IOM uint32_t RTR_EN     : 1;            /*!< [3..3] RTR ACK enable                                                     */
      __IOM uint32_t PRIOR_OFF  : 1;            /*!< [4..4] Send priority Off                                                  */
      __IOM uint32_t TX_REQ     : 1;            /*!< [5..5] Request to send                                                    */
      __IOM uint32_t RX_FULL    : 1;            /*!< [6..6] Has new data                                                       */
      __IOM uint32_t OVER_WR    : 1;            /*!< [7..7] Data overwritten                                                   */
    } BUF_CON1_b;
  } ;
  
  union {
    __IOM uint32_t BUF_CON2;                    /*!< (@ 0x00000048) Buffer control                                             */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] Buffer enable                                                      */
      __IOM uint32_t RX_TX      : 1;            /*!< [1..1] Buffer Direction                                                   */
      __IOM uint32_t OVER_EN    : 1;            /*!< [2..2] Overwrite enable                                                   */
      __IOM uint32_t RTR_EN     : 1;            /*!< [3..3] RTR ACK enable                                                     */
      __IOM uint32_t PRIOR_OFF  : 1;            /*!< [4..4] Send priority Off                                                  */
      __IOM uint32_t TX_REQ     : 1;            /*!< [5..5] Request to send                                                    */
      __IOM uint32_t RX_FULL    : 1;            /*!< [6..6] Has new data                                                       */
      __IOM uint32_t OVER_WR    : 1;            /*!< [7..7] Data overwritten                                                   */
    } BUF_CON2_b;
  } ;
  
  union {
    __IOM uint32_t BUF_CON3;                    /*!< (@ 0x0000004C) Buffer control                                             */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] Buffer enable                                                      */
      __IOM uint32_t RX_TX      : 1;            /*!< [1..1] Buffer Direction                                                   */
      __IOM uint32_t OVER_EN    : 1;            /*!< [2..2] Overwrite enable                                                   */
      __IOM uint32_t RTR_EN     : 1;            /*!< [3..3] RTR ACK enable                                                     */
      __IOM uint32_t PRIOR_OFF  : 1;            /*!< [4..4] Send priority Off                                                  */
      __IOM uint32_t TX_REQ     : 1;            /*!< [5..5] Request to send                                                    */
      __IOM uint32_t RX_FULL    : 1;            /*!< [6..6] Has new data                                                       */
      __IOM uint32_t OVER_WR    : 1;            /*!< [7..7] Data overwritten                                                   */
    } BUF_CON3_b;
  } ;
  
  union {
    __IOM uint32_t BUF_CON4;                    /*!< (@ 0x00000050) Buffer control                                             */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] Buffer enable                                                      */
      __IOM uint32_t RX_TX      : 1;            /*!< [1..1] Buffer Direction                                                   */
      __IOM uint32_t OVER_EN    : 1;            /*!< [2..2] Overwrite enable                                                   */
      __IOM uint32_t RTR_EN     : 1;            /*!< [3..3] RTR ACK enable                                                     */
      __IOM uint32_t PRIOR_OFF  : 1;            /*!< [4..4] Send priority Off                                                  */
      __IOM uint32_t TX_REQ     : 1;            /*!< [5..5] Request to send                                                    */
      __IOM uint32_t RX_FULL    : 1;            /*!< [6..6] Has new data                                                       */
      __IOM uint32_t OVER_WR    : 1;            /*!< [7..7] Data overwritten                                                   */
    } BUF_CON4_b;
  } ;
  
  union {
    __IOM uint32_t BUF_CON5;                    /*!< (@ 0x00000054) Buffer control                                             */
    
