StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] Buffer enable                                                      */
      __IOM uint32_t RX_TX      : 1;            /*!< [1..1] Buffer Direction                                                   */
      __IOM uint32_t OVER_EN    : 1;            /*!< [2..2] Overwrite enable                                                   */
      __IOM uint32_t RTR_EN     : 1;            /*!< [3..3] RTR ACK enable                                                     */
      __IOM uint32_t PRIOR_OFF  : 1;            /*!< [4..4] Send priority Off                                                  */
      __IOM uint32_t TX_REQ     : 1;            /*!< [5..5] Request to send                                                    */
      __IOM uint32_t RX_FULL    : 1;            /*!< [6..6] Has new data                                                       */
      __IOM uint32_t OVER_WR    : 1;            /*!< [7..7] Data overwritten                                                   */
    } BUF_CON5_b;
  } ;
  
  union {
    __IOM uint32_t BUF_CON6;                    /*!< (@ 0x00000058) Buffer control                                             */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] Buffer enable                                                      */
      __IOM uint32_t RX_TX      : 1;            /*!< [1..1] Buffer Direction                                                   */
      __IOM uint32_t OVER_EN    : 1;            /*!< [2..2] Overwrite enable                                                   */
      __IOM uint32_t RTR_EN     : 1;            /*!< [3..3] RTR ACK enable                                                     */
      __IOM uint32_t PRIOR_OFF  : 1;            /*!< [4..4] Send priority Off                                                  */
      __IOM uint32_t TX_REQ     : 1;            /*!< [5..5] Request to send                                                    */
      __IOM uint32_t RX_FULL    : 1;            /*!< [6..6] Has new data                                                       */
      __IOM uint32_t OVER_WR    : 1;            /*!< [7..7] Data overwritten                                                   */
    } BUF_CON6_b;
  } ;
  
  union {
    __IOM uint32_t BUF_CON7;                    /*!< (@ 0x0000005C) Buffer control                                             */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] Buffer enable                                                      */
      __IOM uint32_t RX_TX      : 1;            /*!< [1..1] Buffer Direction                                                   */
      __IOM uint32_t OVER_EN    : 1;            /*!< [2..2] Overwrite enable                                                   */
      __IOM uint32_t RTR_EN     : 1;            /*!< [3..3] RTR ACK enable                                                     */
      __IOM uint32_t PRIOR_OFF  : 1;            /*!< [4..4] Send priority Off                                                  */
      __IOM uint32_t TX_REQ     : 1;            /*!< [5..5] Request to send                                                    */
      __IOM uint32_t RX_FULL    : 1;            /*!< [6..6] Has new data                                                       */
      __IOM uint32_t OVER_WR    : 1;            /*!< [7..7] Data overwritten                                                   */
    } BUF_CON7_b;
  } ;
  
  union {
    __IOM uint32_t BUF_CON8;                    /*!< (@ 0x00000060) Buffer control                                             */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] Buffer enable                                                      */
      __IOM uint32_t RX_TX      : 1;            /*!< [1..1] Buffer Direction                                                   */
      __IOM uint32_t OVER_EN    : 1;            /*!< [2..2] Overwrite enable                                                   */
      __IOM uint32_t RTR_EN     : 1;            /*!< [3..3] RTR ACK enable                                                     */
      __IOM uint32_t PRIOR_OFF  : 1;            /*!< [4..4] Send priority Off                                                  */
      __IOM uint32_t TX_REQ     : 1;            /*!< [5..5] Request to send                                                    */
      __IOM uint32_t RX_FULL    : 1;            /*!< [6..6] Has new data                                                       */
      __IOM uint32_t OVER_WR    : 1;            /*!< [7..7] Data overwritten                                                   */
    } BUF_CON8_b;
  } ;
  
  union {
    __IOM uint32_t BUF_CON9;                    /*!< (@ 0x00000064) Buffer control                                             */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] Buffer enable                                                      */
      __IOM uint32_t RX_TX      : 1;            /*!< [1..1] Buffer Direction                                                   */
      __IOM uint32_t OVER_EN    : 1;            /*!< [2..2] Overwrite enable                                                   */
      __IOM uint32_t RTR_EN     : 1;            /*!< [3..3] RTR ACK enable                                                     */
      __IOM uint32_t PRIOR_OFF  : 1;            /*!< [4..4] Send priority Off                                                  */
      __IOM uint32_t TX_REQ     : 1;            /*!< [5..5] Request to send                                                    */
      __IOM uint32_t RX_FULL    : 1;            /*!< [6..6] Has new data                                                       */
      __IOM uint32_t OVER_WR    : 1;            /*!< [7..7] Data overwritten                                                   */
    } BUF_CON9_b;
  } ;
  
  union {
    __IOM uint32_t BUF_CON10;                   /*!< (@ 0x00000068) Buffer control                                             */
    
