StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] Buffer enable                                                      */
      __IOM uint32_t RX_TX      : 1;            /*!< [1..1] Buffer Direction                                                   */
      __IOM uint32_t OVER_EN    : 1;            /*!< [2..2] Overwrite enable                                                   */
      __IOM uint32_t RTR_EN     : 1;            /*!< [3..3] RTR ACK enable                                                     */
      __IOM uint32_t PRIOR_OFF  : 1;            /*!< [4..4] Send priority Off                                                  */
      __IOM uint32_t TX_REQ     : 1;            /*!< [5..5] Request to send                                                    */
      __IOM uint32_t RX_FULL    : 1;            /*!< [6..6] Has new data                                                       */
      __IOM uint32_t OVER_WR    : 1;            /*!< [7..7] Data overwritten                                                   */
    } BUF_CON25_b;
  } ;
  
  union {
    __IOM uint32_t BUF_CON26;                   /*!< (@ 0x000000A8) Buffer control                                             */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] Buffer enable                                                      */
      __IOM uint32_t RX_TX      : 1;            /*!< [1..1] Buffer Direction                                                   */
      __IOM uint32_t OVER_EN    : 1;            /*!< [2..2] Overwrite enable                                                   */
      __IOM uint32_t RTR_EN     : 1;            /*!< [3..3] RTR ACK enable                                                     */
      __IOM uint32_t PRIOR_OFF  : 1;            /*!< [4..4] Send priority Off                                                  */
      __IOM uint32_t TX_REQ     : 1;            /*!< [5..5] Request to send                                                    */
      __IOM uint32_t RX_FULL    : 1;            /*!< [6..6] Has new data                                                       */
      __IOM uint32_t OVER_WR    : 1;            /*!< [7..7] Data overwritten                                                   */
    } BUF_CON26_b;
  } ;
  
  union {
    __IOM uint32_t BUF_CON27;                   /*!< (@ 0x000000AC) Buffer control                                             */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] Buffer enable                                                      */
      __IOM uint32_t RX_TX      : 1;            /*!< [1..1] Buffer Direction                                                   */
      __IOM uint32_t OVER_EN    : 1;            /*!< [2..2] Overwrite enable                                                   */
      __IOM uint32_t RTR_EN     : 1;            /*!< [3..3] RTR ACK enable                                                     */
      __IOM uint32_t PRIOR_OFF  : 1;            /*!< [4..4] Send priority Off                                                  */
      __IOM uint32_t TX_REQ     : 1;            /*!< [5..5] Request to send                                                    */
      __IOM uint32_t RX_FULL    : 1;            /*!< [6..6] Has new data                                                       */
      __IOM uint32_t OVER_WR    : 1;            /*!< [7..7] Data overwritten                                                   */
    } BUF_CON27_b;
  } ;
  
  union {
    __IOM uint32_t BUF_CON28;                   /*!< (@ 0x000000B0) Buffer control                                             */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] Buffer enable                                                      */
      __IOM uint32_t RX_TX      : 1;            /*!< [1..1] Buffer Direction                                                   */
      __IOM uint32_t OVER_EN    : 1;            /*!< [2..2] Overwrite enable                                                   */
      __IOM uint32_t RTR_EN     : 1;            /*!< [3..3] RTR ACK enable                                                     */
      __IOM uint32_t PRIOR_OFF  : 1;            /*!< [4..4] Send priority Off                                                  */
      __IOM uint32_t TX_REQ     : 1;            /*!< [5..5] Request to send                                                    */
      __IOM uint32_t RX_FULL    : 1;            /*!< [6..6] Has new data                                                       */
      __IOM uint32_t OVER_WR    : 1;            /*!< [7..7] Data overwritten                                                   */
    } BUF_CON28_b;
  } ;
  
  union {
    __IOM uint32_t BUF_CON29;                   /*!< (@ 0x000000B4) Buffer control                                             */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] Buffer enable                                                      */
      __IOM uint32_t RX_TX      : 1;            /*!< [1..1] Buffer Direction                                                   */
      __IOM uint32_t OVER_EN    : 1;            /*!< [2..2] Overwrite enable                                                   */
      __IOM uint32_t RTR_EN     : 1;            /*!< [3..3] RTR ACK enable                                                     */
      __IOM uint32_t PRIOR_OFF  : 1;            /*!< [4..4] Send priority Off                                                  */
      __IOM uint32_t TX_REQ     : 1;            /*!< [5..5] Request to send                                                    */
      __IOM uint32_t RX_FULL    : 1;            /*!< [6..6] Has new data                                                       */
      __IOM uint32_t OVER_WR    : 1;            /*!< [7..7] Data overwritten                                                   */
    } BUF_CON29_b;
  } ;
  
  union {
    __IOM uint32_t BUF_CON30;                   /*!< (@ 0x000000B8) Buffer control                                             */
    
