StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] Buffer enable                                                      */
      __IOM uint32_t RX_TX      : 1;            /*!< [1..1] Buffer Direction                                                   */
      __IOM uint32_t OVER_EN    : 1;            /*!< [2..2] Overwrite enable                                                   */
      __IOM uint32_t RTR_EN     : 1;            /*!< [3..3] RTR ACK enable                                                     */
      __IOM uint32_t PRIOR_OFF  : 1;            /*!< [4..4] Send priority Off                                                  */
      __IOM uint32_t TX_REQ     : 1;            /*!< [5..5] Request to send                                                    */
      __IOM uint32_t RX_FULL    : 1;            /*!< [6..6] Has new data                                                       */
      __IOM uint32_t OVER_WR    : 1;            /*!< [7..7] Data overwritten                                                   */
    } BUF_CON30_b;
  } ;
  
  union {
    __IOM uint32_t BUF_CON31;                   /*!< (@ 0x000000BC) Buffer control                                             */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] Buffer enable                                                      */
      __IOM uint32_t RX_TX      : 1;            /*!< [1..1] Buffer Direction                                                   */
      __IOM uint32_t OVER_EN    : 1;            /*!< [2..2] Overwrite enable                                                   */
      __IOM uint32_t RTR_EN     : 1;            /*!< [3..3] RTR ACK enable                                                     */
      __IOM uint32_t PRIOR_OFF  : 1;            /*!< [4..4] Send priority Off                                                  */
      __IOM uint32_t TX_REQ     : 1;            /*!< [5..5] Request to send                                                    */
      __IOM uint32_t RX_FULL    : 1;            /*!< [6..6] Has new data                                                       */
      __IOM uint32_t OVER_WR    : 1;            /*!< [7..7] Data overwritten                                                   */
    } BUF_CON31_b;
  } ;
  
  union {
    __IOM uint32_t INT_RX;                      /*!< (@ 0x000000C0) Enable Buffs' RX IRQ                                       */
    
    struct {
      __IOM uint32_t RX_IRQ_En0 : 1;            /*!< [0..0] Enable Buffs' RX IRQ                                               */
      __IOM uint32_t RX_IRQ_En1 : 1;            /*!< [1..1] Enable Buffs' RX IRQ                                               */
      __IOM uint32_t RX_IRQ_En2 : 1;            /*!< [2..2] Enable Buffs' RX IRQ                                               */
      __IOM uint32_t RX_IRQ_En3 : 1;            /*!< [3..3] Enable Buffs' RX IRQ                                               */
      __IOM uint32_t RX_IRQ_En4 : 1;            /*!< [4..4] Enable Buffs' RX IRQ                                               */
      __IOM uint32_t RX_IRQ_En5 : 1;            /*!< [5..5] Enable Buffs' RX IRQ                                               */
      __IOM uint32_t RX_IRQ_En6 : 1;            /*!< [6..6] Enable Buffs' RX IRQ                                               */
      __IOM uint32_t RX_IRQ_En7 : 1;            /*!< [7..7] Enable Buffs' RX IRQ                                               */
      __IOM uint32_t RX_IRQ_En8 : 1;            /*!< [8..8] Enable Buffs' RX IRQ                                               */
      __IOM uint32_t RX_IRQ_En9 : 1;            /*!< [9..9] Enable Buffs' RX IRQ                                               */
      __IOM uint32_t RX_IRQ_En10 : 1;           /*!< [10..10] Enable Buffs' RX IRQ                                             */
      __IOM uint32_t RX_IRQ_En11 : 1;           /*!< [11..11] Enable Buffs' RX IRQ                                             */
      __IOM uint32_t RX_IRQ_En12 : 1;           /*!< [12..12] Enable Buffs' RX IRQ                                             */
      __IOM uint32_t RX_IRQ_En13 : 1;           /*!< [13..13] Enable Buffs' RX IRQ                                             */
      __IOM uint32_t RX_IRQ_En14 : 1;           /*!< [14..14] Enable Buffs' RX IRQ                                             */
      __IOM uint32_t RX_IRQ_En15 : 1;           /*!< [15..15] Enable Buffs' RX IRQ                                             */
      __IOM uint32_t RX_IRQ_En16 : 1;           /*!< [16..16] Enable Buffs' RX IRQ                                             */
      __IOM uint32_t RX_IRQ_En17 : 1;           /*!< [17..17] Enable Buffs' RX IRQ                                             */
      __IOM uint32_t RX_IRQ_En18 : 1;           /*!< [18..18] Enable Buffs' RX IRQ                                             */
      __IOM uint32_t RX_IRQ_En19 : 1;           /*!< [19..19] Enable Buffs' RX IRQ                                             */
      __IOM uint32_t RX_IRQ_En20 : 1;           /*!< [20..20] Enable Buffs' RX IRQ                                             */
      __IOM uint32_t RX_IRQ_En21 : 1;           /*!< [21..21] Enable Buffs' RX IRQ                                             */
      __IOM uint32_t RX_IRQ_En22 : 1;           /*!< [22..22] Enable Buffs' RX IRQ                                             */
      __IOM uint32_t RX_IRQ_En23 : 1;           /*!< [23..23] Enable Buffs' RX IRQ                                             */
      __IOM uint32_t RX_IRQ_En24 : 1;           /*!< [24..24] Enable Buffs' RX IRQ                                             */
      __IOM uint32_t RX_IRQ_En25 : 1;           /*!< [25..25] Enable Buffs' RX IRQ                                             */
      __IOM uint32_t RX_IRQ_En26 : 1;           /*!< [26..26] Enable Buffs' RX IRQ                                             */
      __IOM uint32_t RX_IRQ_En27 : 1;           /*!< [27..27] Enable Buffs' RX IRQ                                             */
      __IOM uint32_t RX_IRQ_En28 : 1;           /*!< [28..28] Enable Buffs' RX IRQ                                             */
      __IOM uint32_t RX_IRQ_En29 : 1;           /*!< [29..29] Enable Buffs' RX IRQ                                             */
      __IOM uint32_t RX_IRQ_En30 : 1;           /*!< [30..30] Enable Buffs' RX IRQ                                             */
      __IOM uint32_t RX_IRQ_En31 : 1;           /*!< [31..31] Enable Buffs' RX IRQ                                             */
    } INT_RX_b;
  } ;
  
  union {
    __IOM uint32_t RX;                          /*!< (@ 0x000000C4) Buffs' RX_FIFO Full                                        */
    
