StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
    struct {
      __IOM uint32_t RX_FULL0   : 1;            /*!< [0..0] Buffs' RX_FIFO Full                                                */
      __IOM uint32_t RX_FULL1   : 1;            /*!< [1..1] Buffs' RX_FIFO Full                                                */
      __IOM uint32_t RX_FULL2   : 1;            /*!< [2..2] Buffs' RX_FIFO Full                                                */
      __IOM uint32_t RX_FULL3   : 1;            /*!< [3..3] Buffs' RX_FIFO Full                                                */
      __IOM uint32_t RX_FULL4   : 1;            /*!< [4..4] Buffs' RX_FIFO Full                                                */
      __IOM uint32_t RX_FULL5   : 1;            /*!< [5..5] Buffs' RX_FIFO Full                                                */
      __IOM uint32_t RX_FULL6   : 1;            /*!< [6..6] Buffs' RX_FIFO Full                                                */
      __IOM uint32_t RX_FULL7   : 1;            /*!< [7..7] Buffs' RX_FIFO Full                                                */
      __IOM uint32_t RX_FULL8   : 1;            /*!< [8..8] Buffs' RX_FIFO Full                                                */
      __IOM uint32_t RX_FULL9   : 1;            /*!< [9..9] Buffs' RX_FIFO Full                                                */
      __IOM uint32_t RX_FULL10  : 1;            /*!< [10..10] Buffs' RX_FIFO Full                                              */
      __IOM uint32_t RX_FULL11  : 1;            /*!< [11..11] Buffs' RX_FIFO Full                                              */
      __IOM uint32_t RX_FULL12  : 1;            /*!< [12..12] Buffs' RX_FIFO Full                                              */
      __IOM uint32_t RX_FULL13  : 1;            /*!< [13..13] Buffs' RX_FIFO Full                                              */
      __IOM uint32_t RX_FULL14  : 1;            /*!< [14..14] Buffs' RX_FIFO Full                                              */
      __IOM uint32_t RX_FULL15  : 1;            /*!< [15..15] Buffs' RX_FIFO Full                                              */
      __IOM uint32_t RX_FULL16  : 1;            /*!< [16..16] Buffs' RX_FIFO Full                                              */
      __IOM uint32_t RX_FULL17  : 1;            /*!< [17..17] Buffs' RX_FIFO Full                                              */
      __IOM uint32_t RX_FULL18  : 1;            /*!< [18..18] Buffs' RX_FIFO Full                                              */
      __IOM uint32_t RX_FULL19  : 1;            /*!< [19..19] Buffs' RX_FIFO Full                                              */
      __IOM uint32_t RX_FULL20  : 1;            /*!< [20..20] Buffs' RX_FIFO Full                                              */
      __IOM uint32_t RX_FULL21  : 1;            /*!< [21..21] Buffs' RX_FIFO Full                                              */
      __IOM uint32_t RX_FULL22  : 1;            /*!< [22..22] Buffs' RX_FIFO Full                                              */
      __IOM uint32_t RX_FULL23  : 1;            /*!< [23..23] Buffs' RX_FIFO Full                                              */
      __IOM uint32_t RX_FULL24  : 1;            /*!< [24..24] Buffs' RX_FIFO Full                                              */
      __IOM uint32_t RX_FULL25  : 1;            /*!< [25..25] Buffs' RX_FIFO Full                                              */
      __IOM uint32_t RX_FULL26  : 1;            /*!< [26..26] Buffs' RX_FIFO Full                                              */
      __IOM uint32_t RX_FULL27  : 1;            /*!< [27..27] Buffs' RX_FIFO Full                                              */
      __IOM uint32_t RX_FULL28  : 1;            /*!< [28..28] Buffs' RX_FIFO Full                                              */
      __IOM uint32_t RX_FULL29  : 1;            /*!< [29..29] Buffs' RX_FIFO Full                                              */
      __IOM uint32_t RX_FULL30  : 1;            /*!< [30..30] Buffs' RX_FIFO Full                                              */
      __IOM uint32_t RX_FULL31  : 1;            /*!< [31..31] Buffs' RX_FIFO Full                                              */
    } RX_b;
  } ;
  
  union {
    __IOM uint32_t INT_TX;                      /*!< (@ 0x000000C8) Enable Buffs' TX IRQ                                       */
    
    struct {
      __IOM uint32_t TX_IRQ_En0 : 1;            /*!< [0..0] Enable Buffs' TX IRQ                                               */
      __IOM uint32_t TX_IRQ_En1 : 1;            /*!< [1..1] Enable Buffs' TX IRQ                                               */
      __IOM uint32_t TX_IRQ_En2 : 1;            /*!< [2..2] Enable Buffs' TX IRQ                                               */
      __IOM uint32_t TX_IRQ_En3 : 1;            /*!< [3..3] Enable Buffs' TX IRQ                                               */
      __IOM uint32_t TX_IRQ_En4 : 1;            /*!< [4..4] Enable Buffs' TX IRQ                                               */
      __IOM uint32_t TX_IRQ_En5 : 1;            /*!< [5..5] Enable Buffs' TX IRQ                                               */
      __IOM uint32_t TX_IRQ_En6 : 1;            /*!< [6..6] Enable Buffs' TX IRQ                                               */
      __IOM uint32_t TX_IRQ_En7 : 1;            /*!< [7..7] Enable Buffs' TX IRQ                                               */
      __IOM uint32_t TX_IRQ_En8 : 1;            /*!< [8..8] Enable Buffs' TX IRQ                                               */
      __IOM uint32_t TX_IRQ_En9 : 1;            /*!< [9..9] Enable Buffs' TX IRQ                                               */
      __IOM uint32_t TX_IRQ_En10 : 1;           /*!< [10..10] Enable Buffs' TX IRQ                                             */
      __IOM uint32_t TX_IRQ_En11 : 1;           /*!< [11..11] Enable Buffs' TX IRQ                                             */
      __IOM uint32_t TX_IRQ_En12 : 1;           /*!< [12..12] Enable Buffs' TX IRQ                                             */
      __IOM uint32_t TX_IRQ_En13 : 1;           /*!< [13..13] Enable Buffs' TX IRQ                                             */
      __IOM uint32_t TX_IRQ_En14 : 1;           /*!< [14..14] Enable Buffs' TX IRQ                                             */
      __IOM uint32_t TX_IRQ_En15 : 1;           /*!< [15..15] Enable Buffs' TX IRQ                                             */
      __IOM uint32_t TX_IRQ_En16 : 1;           /*!< [16..16] Enable Buffs' TX IRQ                                             */
      __IOM uint32_t TX_IRQ_En17 : 1;           /*!< [17..17] Enable Buffs' TX IRQ                                             */
      __IOM uint32_t TX_IRQ_En18 : 1;           /*!< [18..18] Enable Buffs' TX IRQ                                             */
      __IOM uint32_t TX_IRQ_En19 : 1;           /*!< [19..19] Enable Buffs' TX IRQ                                             */
      __IOM uint32_t TX_IRQ_En20 : 1;           /*!< [20..20] Enable Buffs' TX IRQ                                             */
      __IOM uint32_t TX_IRQ_En21 : 1;           /*!< [21..21] Enable Buffs' TX IRQ                                             */
      __IOM uint32_t TX_IRQ_En22 : 1;           /*!< [22..22] Enable Buffs' TX IRQ                                             */
      __IOM uint32_t TX_IRQ_En23 : 1;           /*!< [23..23] Enable Buffs' TX IRQ                                             */
      __IOM uint32_t TX_IRQ_En24 : 1;           /*!< [24..24] Enable Buffs' TX IRQ                                             */
      __IOM uint32_t TX_IRQ_En25 : 1;           /*!< [25..25] Enable Buffs' TX IRQ                                             */
      __IOM uint32_t TX_IRQ_En26 : 1;           /*!< [26..26] Enable Buffs' TX IRQ                                             */
      __IOM uint32_t TX_IRQ_En27 : 1;           /*!< [27..27] Enable Buffs' TX IRQ                                             */
      __IOM uint32_t TX_IRQ_En28 : 1;           /*!< [28..28] Enable Buffs' TX IRQ                                             */
      __IOM uint32_t TX_IRQ_En29 : 1;           /*!< [29..29] Enable Buffs' TX IRQ                                             */
      __IOM uint32_t TX_IRQ_En30 : 1;           /*!< [30..30] Enable Buffs' TX IRQ                                             */
      __IOM uint32_t TX_IRQ_En31 : 1;           /*!< [31..31] Enable Buffs' TX IRQ                                             */
    } INT_TX_b;
  } ;
  
  union {
    __IOM uint32_t TX;                          /*!< (@ 0x000000CC) TX_nReq buffs' state                                       */
    
