StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
    struct {
      __IOM uint32_t TX_nReq0   : 1;            /*!< [0..0] TX_nReq buffs' state                                               */
      __IOM uint32_t TX_nReq1   : 1;            /*!< [1..1] TX_nReq buffs' state                                               */
      __IOM uint32_t TX_nReq2   : 1;            /*!< [2..2] TX_nReq buffs' state                                               */
      __IOM uint32_t TX_nReq3   : 1;            /*!< [3..3] TX_nReq buffs' state                                               */
      __IOM uint32_t TX_nReq4   : 1;            /*!< [4..4] TX_nReq buffs' state                                               */
      __IOM uint32_t TX_nReq5   : 1;            /*!< [5..5] TX_nReq buffs' state                                               */
      __IOM uint32_t TX_nReq6   : 1;            /*!< [6..6] TX_nReq buffs' state                                               */
      __IOM uint32_t TX_nReq7   : 1;            /*!< [7..7] TX_nReq buffs' state                                               */
      __IOM uint32_t TX_nReq8   : 1;            /*!< [8..8] TX_nReq buffs' state                                               */
      __IOM uint32_t TX_nReq9   : 1;            /*!< [9..9] TX_nReq buffs' state                                               */
      __IOM uint32_t TX_nReq10  : 1;            /*!< [10..10] TX_nReq buffs' state                                             */
      __IOM uint32_t TX_nReq11  : 1;            /*!< [11..11] TX_nReq buffs' state                                             */
      __IOM uint32_t TX_nReq12  : 1;            /*!< [12..12] TX_nReq buffs' state                                             */
      __IOM uint32_t TX_nReq13  : 1;            /*!< [13..13] TX_nReq buffs' state                                             */
      __IOM uint32_t TX_nReq14  : 1;            /*!< [14..14] TX_nReq buffs' state                                             */
      __IOM uint32_t TX_nReq15  : 1;            /*!< [15..15] TX_nReq buffs' state                                             */
      __IOM uint32_t TX_nReq16  : 1;            /*!< [16..16] TX_nReq buffs' state                                             */
      __IOM uint32_t TX_nReq17  : 1;            /*!< [17..17] TX_nReq buffs' state                                             */
      __IOM uint32_t TX_nReq18  : 1;            /*!< [18..18] TX_nReq buffs' state                                             */
      __IOM uint32_t TX_nReq19  : 1;            /*!< [19..19] TX_nReq buffs' state                                             */
      __IOM uint32_t TX_nReq20  : 1;            /*!< [20..20] TX_nReq buffs' state                                             */
      __IOM uint32_t TX_nReq21  : 1;            /*!< [21..21] TX_nReq buffs' state                                             */
      __IOM uint32_t TX_nReq22  : 1;            /*!< [22..22] TX_nReq buffs' state                                             */
      __IOM uint32_t TX_nReq23  : 1;            /*!< [23..23] TX_nReq buffs' state                                             */
      __IOM uint32_t TX_nReq24  : 1;            /*!< [24..24] TX_nReq buffs' state                                             */
      __IOM uint32_t TX_nReq25  : 1;            /*!< [25..25] TX_nReq buffs' state                                             */
      __IOM uint32_t TX_nReq26  : 1;            /*!< [26..26] TX_nReq buffs' state                                             */
      __IOM uint32_t TX_nReq27  : 1;            /*!< [27..27] TX_nReq buffs' state                                             */
      __IOM uint32_t TX_nReq28  : 1;            /*!< [28..28] TX_nReq buffs' state                                             */
      __IOM uint32_t TX_nReq29  : 1;            /*!< [29..29] TX_nReq buffs' state                                             */
      __IOM uint32_t TX_nReq30  : 1;            /*!< [30..30] TX_nReq buffs' state                                             */
      __IOM uint32_t TX_nReq31  : 1;            /*!< [31..31] TX_nReq buffs' state                                             */
    } TX_b;
  } ;
  __IM  uint32_t  RESERVED2[76];
  __IOM MDR_CAN1_BUF_Type BUF0;                 /*!< (@ 0x00000200) TX or RX buffer control                                    */
  __IOM MDR_CAN1_BUF_Type BUF1;                 /*!< (@ 0x00000210) TX or RX buffer control                                    */
  __IOM MDR_CAN1_BUF_Type BUF2;                 /*!< (@ 0x00000220) TX or RX buffer control                                    */
  __IOM MDR_CAN1_BUF_Type BUF3;                 /*!< (@ 0x00000230) TX or RX buffer control                                    */
  __IOM MDR_CAN1_BUF_Type BUF4;                 /*!< (@ 0x00000240) TX or RX buffer control                                    */
  __IOM MDR_CAN1_BUF_Type BUF5;                 /*!< (@ 0x00000250) TX or RX buffer control                                    */
  __IOM MDR_CAN1_BUF_Type BUF6;                 /*!< (@ 0x00000260) TX or RX buffer control                                    */
  __IOM MDR_CAN1_BUF_Type BUF7;                 /*!< (@ 0x00000270) TX or RX buffer control                                    */
  __IOM MDR_CAN1_BUF_Type BUF8;                 /*!< (@ 0x00000280) TX or RX buffer control                                    */
  __IOM MDR_CAN1_BUF_Type BUF9;                 /*!< (@ 0x00000290) TX or RX buffer control                                    */
  __IOM MDR_CAN1_BUF_Type BUF10;                /*!< (@ 0x000002A0) TX or RX buffer control                                    */
  __IOM MDR_CAN1_BUF_Type BUF11;                /*!< (@ 0x000002B0) TX or RX buffer control                                    */
  __IOM MDR_CAN1_BUF_Type BUF12;                /*!< (@ 0x000002C0) TX or RX buffer control                                    */
  __IOM MDR_CAN1_BUF_Type BUF13;                /*!< (@ 0x000002D0) TX or RX buffer control                                    */
  __IOM MDR_CAN1_BUF_Type BUF14;                /*!< (@ 0x000002E0) TX or RX buffer control                                    */
  __IOM MDR_CAN1_BUF_Type BUF15;                /*!< (@ 0x000002F0) TX or RX buffer control                                    */
  __IOM MDR_CAN1_BUF_Type BUF16;                /*!< (@ 0x00000300) TX or RX buffer control                                    */
  __IOM MDR_CAN1_BUF_Type BUF17;                /*!< (@ 0x00000310) TX or RX buffer control                                    */
  __IOM MDR_CAN1_BUF_Type BUF18;                /*!< (@ 0x00000320) TX or RX buffer control                                    */
  __IOM MDR_CAN1_BUF_Type BUF19;                /*!< (@ 0x00000330) TX or RX buffer control                                    */
  __IOM MDR_CAN1_BUF_Type BUF20;                /*!< (@ 0x00000340) TX or RX buffer control                                    */
  __IOM MDR_CAN1_BUF_Type BUF21;                /*!< (@ 0x00000350) TX or RX buffer control                                    */
  __IOM MDR_CAN1_BUF_Type BUF22;                /*!< (@ 0x00000360) TX or RX buffer control                                    */
  __IOM MDR_CAN1_BUF_Type BUF23;                /*!< (@ 0x00000370) TX or RX buffer control                                    */
  __IOM MDR_CAN1_BUF_Type BUF24;                /*!< (@ 0x00000380) TX or RX buffer control                                    */
  __IOM MDR_CAN1_BUF_Type BUF25;                /*!< (@ 0x00000390) TX or RX buffer control                                    */
  __IOM MDR_CAN1_BUF_Type BUF26;                /*!< (@ 0x000003A0) TX or RX buffer control                                    */
  __IOM MDR_CAN1_BUF_Type BUF27;                /*!< (@ 0x000003B0) TX or RX buffer control                                    */
  __IOM MDR_CAN1_BUF_Type BUF28;                /*!< (@ 0x000003C0) TX or RX buffer control                                    */
  __IOM MDR_CAN1_BUF_Type BUF29;                /*!< (@ 0x000003D0) TX or RX buffer control                                    */
  __IOM MDR_CAN1_BUF_Type BUF30;                /*!< (@ 0x000003E0) TX or RX buffer control                                    */
  __IOM MDR_CAN1_BUF_Type BUF31;                /*!< (@ 0x000003F0) TX or RX buffer control                                    */
  __IM  uint32_t  RESERVED3[64];
  __IOM MDR_CAN1_FILTER_Type FILTER0;           /*!< (@ 0x00000500) Buffer Receive Filters                                     */
  __IOM MDR_CAN1_FILTER_Type FILTER1;           /*!< (@ 0x00000508) Buffer Receive Filters                                     */
  __IOM MDR_CAN1_FILTER_Type FILTER2;           /*!< (@ 0x00000510) Buffer Receive Filters                                     */
  __IOM MDR_CAN1_FILTER_Type FILTER3;           /*!< (@ 0x00000518) Buffer Receive Filters                                     */
  __IOM MDR_CAN1_FILTER_Type FILTER4;           /*!< (@ 0x00000520) Buffer Receive Filters                                     */
  __IOM MDR_CAN1_FILTER_Type FILTER5;           /*!< (@ 0x00000528) Buffer Receive Filters                                     */
  __IOM MDR_CAN1_FILTER_Type FILTER6;           /*!< (@ 0x00000530) Buffer Receive Filters                                     */
  __IOM MDR_CAN1_FILTER_Type FILTER7;           /*!< (@ 0x00000538) Buffer Receive Filters                                     */
  __IOM MDR_CAN1_FILTER_Type FILTER8;           /*!< (@ 0x00000540) Buffer Receive Filters                                     */
  __IOM MDR_CAN1_FILTER_Type FILTER9;           /*!< (@ 0x00000548) Buffer Receive Filters                                     */
  __IOM MDR_CAN1_FILTER_Type FILTER10;          /*!< (@ 0x00000550) Buffer Receive Filters                                     */
  __IOM MDR_CAN1_FILTER_Type FILTER11;          /*!< (@ 0x00000558) Buffer Receive Filters                                     */
  __IOM MDR_CAN1_FILTER_Type FILTER12;          /*!< (@ 0x00000560) Buffer Receive Filters                                     */
  __IOM MDR_CAN1_FILTER_Type FILTER13;          /*!< (@ 0x00000568) Buffer Receive Filters                                     */
  __IOM MDR_CAN1_FILTER_Type FILTER14;          /*!< (@ 0x00000570) Buffer Receive Filters                                     */
  __IOM MDR_CAN1_FILTER_Type FILTER15;          /*!< (@ 0x00000578) Buffer Receive Filters                                     */
  __IOM MDR_CAN1_FILTER_Type FILTER16;          /*!< (@ 0x00000580) Buffer Receive Filters                                     */
  __IOM MDR_CAN1_FILTER_Type FILTER17;          /*!< (@ 0x00000588) Buffer Receive Filters                                     */
  __IOM MDR_CAN1_FILTER_Type FILTER18;          /*!< (@ 0x00000590) Buffer Receive Filters                                     */
  __IOM MDR_CAN1_FILTER_Type FILTER19;          /*!< (@ 0x00000598) Buffer Receive Filters                                     */
  __IOM MDR_CAN1_FILTER_Type FILTER20;          /*!< (@ 0x000005A0) Buffer Receive Filters                                     */
  __IOM MDR_CAN1_FILTER_Type FILTER21;          /*!< (@ 0x000005A8) Buffer Receive Filters                                     */
  __IOM MDR_CAN1_FILTER_Type FILTER22;          /*!< (@ 0x000005B0) Buffer Receive Filters                                     */
  __IOM MDR_CAN1_FILTER_Type FILTER23;          /*!< (@ 0x000005B8) Buffer Receive Filters                                     */
  __IOM MDR_CAN1_FILTER_Type FILTER24;          /*!< (@ 0x000005C0) Buffer Receive Filters                                     */
  __IOM MDR_CAN1_FILTER_Type FILTER25;          /*!< (@ 0x000005C8) Buffer Receive Filters                                     */
  __IOM MDR_CAN1_FILTER_Type FILTER26;          /*!< (@ 0x000005D0) Buffer Receive Filters                                     */
  __IOM MDR_CAN1_FILTER_Type FILTER27;          /*!< (@ 0x000005D8) Buffer Receive Filters                                     */
  __IOM MDR_CAN1_FILTER_Type FILTER28;          /*!< (@ 0x000005E0) Buffer Receive Filters                                     */
  __IOM MDR_CAN1_FILTER_Type FILTER29;          /*!< (@ 0x000005E8) Buffer Receive Filters                                     */
  __IOM MDR_CAN1_FILTER_Type FILTER30;          /*!< (@ 0x000005F0) Buffer Receive Filters                                     */
  __IOM MDR_CAN1_FILTER_Type FILTER31;          /*!< (@ 0x000005F8) Buffer Receive Filters                                     */
} MDR_CAN1_Type;                                /*!< Size = 1536 (0x600)                                                       */



/* =========================================================================================================================== */
/* ================                                         MDR_UART1                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief UART Control (MDR_UART1)
  */

typedef struct {                                /*!< (@ 0x40030000) MDR_UART1 Structure                                        */
  
  union {
    __IOM uint32_t DR;                          /*!< (@ 0x00000000) Data Register                                              */
    
