StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
    struct {
      __IOM uint32_t RXDMAE     : 1;            /*!< [0..0] RX DMA Enable                                                      */
      __IOM uint32_t TXDMAE     : 1;            /*!< [1..1] TX DMA Enable                                                      */
      __IOM uint32_t DMAonErr   : 1;            /*!< [2..2] Disable DMA req on Error                                           */
    } DMACR_b;
  } ;
  __IM  uint32_t  RESERVED2[13];
  
  union {
    __IOM uint32_t TCR;                         /*!< (@ 0x00000080) Test Control Register                                      */
    
    struct {
      __IOM uint32_t ITEN       : 1;            /*!< [0..0] Test Mode Enable                                                   */
      __IOM uint32_t TestFIFO   : 1;            /*!< [1..1] FIFO test mode                                                     */
      __IOM uint32_t SIRTest    : 1;            /*!< [2..2] IrDA test mode                                                     */
    } TCR_b;
  } ;
} MDR_UART1_Type;                               /*!< Size = 132 (0x84)                                                         */



/* =========================================================================================================================== */
/* ================                                        MDR_TIMER1                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief TIMER Control (MDR_TIMER1)
  */

typedef struct {                                /*!< (@ 0x40070000) MDR_TIMER1 Structure                                       */
  
  union {
    __IOM uint32_t CNT;                         /*!< (@ 0x00000000) Counter register                                           */
    
    struct {
      __IOM uint32_t Value      : 32;           /*!< [31..0] Counter Value                                                     */
    } CNT_b;
  } ;
  
  union {
    __IOM uint32_t PSG;                         /*!< (@ 0x00000004) Presample Gain                                             */
    
    struct {
      __IOM uint32_t Value      : 16;           /*!< [15..0] Inc CNT by PSG clocks of TIM_CLOCK                                */
    } PSG_b;
  } ;
  
  union {
    __IOM uint32_t ARR;                         /*!< (@ 0x00000008) Counter Period                                             */
    
    struct {
      __IOM uint32_t Value      : 32;           /*!< [31..0] Counter Value                                                     */
    } ARR_b;
  } ;
  
  union {
    __IOM uint32_t CNTRL;                       /*!< (@ 0x0000000C) Timer Control                                              */
    
    struct {
      __IOM uint32_t CNT_EN     : 1;            /*!< [0..0] Timer Enable                                                       */
      __IOM uint32_t ARRB_EN    : 1;            /*!< [1..1] ARR update mode                                                    */
      __IOM uint32_t WR_CMPL    : 1;            /*!< [2..2] Can write to CNT, ARR, PSG                                         */
      __IOM uint32_t DIR        : 1;            /*!< [3..3] Count Direction                                                    */
      __IOM uint32_t FDTS       : 2;            /*!< [5..4] Select Data Sampling frequency                                     */
      __IOM uint32_t CNT_MODE   : 2;            /*!< [7..6] Counting mode                                                      */
      __IOM uint32_t EVENT_SEL  : 4;            /*!< [11..8] Events for counting                                               */
    } CNTRL_b;
  } ;
  
  union {
    __IOM uint32_t CCR1;                        /*!< (@ 0x00000010) CNT Compare Register                                       */
    
    struct {
      __IOM uint32_t Value      : 32;           /*!< [31..0] Captured or PWM Value                                             */
    } CCR1_b;
  } ;
  
  union {
    __IOM uint32_t CCR2;                        /*!< (@ 0x00000014) CNT Compare Register                                       */
    
    struct {
      __IOM uint32_t Value      : 32;           /*!< [31..0] Captured or PWM Value                                             */
    } CCR2_b;
  } ;
  
  union {
    __IOM uint32_t CCR3;                        /*!< (@ 0x00000018) CNT Compare Register                                       */
    
    struct {
      __IOM uint32_t Value      : 32;           /*!< [31..0] Captured or PWM Value                                             */
    } CCR3_b;
  } ;
  
  union {
    __IOM uint32_t CCR4;                        /*!< (@ 0x0000001C) CNT Compare Register                                       */
    
    struct {
      __IOM uint32_t Value      : 32;           /*!< [31..0] Captured or PWM Value                                             */
    } CCR4_b;
  } ;
  
  union {
    __IOM uint32_t CH1_CNTRL;                   /*!< (@ 0x00000020) Capture and PWM Channel Control                            */
    
    struct {
      __IOM uint32_t CHFLTR     : 4;            /*!< [3..0] Front hold to set Event                                            */
      __IOM uint32_t CHSEL      : 2;            /*!< [5..4] Event to capture in CCR                                            */
      __IOM uint32_t CHPSC      : 2;            /*!< [7..6] Capture event decimation                                           */
      __IOM uint32_t OCCE       : 1;            /*!< [8..8] ETR pin Enable                                                     */
      __IOM uint32_t OCCM       : 3;            /*!< [11..9] PWM Generate modes                                                */
      __IOM uint32_t BRKEN      : 1;            /*!< [12..12] Clear Ref by BRK                                                 */
      __IOM uint32_t ETREN      : 1;            /*!< [13..13] Clear Ref by BRK                                                 */
      __IOM uint32_t WR_CMPL    : 1;            /*!< [14..14] Can write to CCRx                                                */
      __IOM uint32_t CAP_nPWM   : 1;            /*!< [15..15] CAP or PWM Mode                                                  */
    } CH1_CNTRL_b;
  } ;
  
  union {
    __IOM uint32_t CH2_CNTRL;                   /*!< (@ 0x00000024) Capture and PWM Channel Control                            */
    
