StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
    struct {
      __IOM uint32_t CHFLTR     : 4;            /*!< [3..0] Front hold to set Event                                            */
      __IOM uint32_t CHSEL      : 2;            /*!< [5..4] Event to capture in CCR                                            */
      __IOM uint32_t CHPSC      : 2;            /*!< [7..6] Capture event decimation                                           */
      __IOM uint32_t OCCE       : 1;            /*!< [8..8] ETR pin Enable                                                     */
      __IOM uint32_t OCCM       : 3;            /*!< [11..9] PWM Generate modes                                                */
      __IOM uint32_t BRKEN      : 1;            /*!< [12..12] Clear Ref by BRK                                                 */
      __IOM uint32_t ETREN      : 1;            /*!< [13..13] Clear Ref by BRK                                                 */
      __IOM uint32_t WR_CMPL    : 1;            /*!< [14..14] Can write to CCRx                                                */
      __IOM uint32_t CAP_nPWM   : 1;            /*!< [15..15] CAP or PWM Mode                                                  */
    } CH2_CNTRL_b;
  } ;
  
  union {
    __IOM uint32_t CH3_CNTRL;                   /*!< (@ 0x00000028) Capture and PWM Channel Control                            */
    
    struct {
      __IOM uint32_t CHFLTR     : 4;            /*!< [3..0] Front hold to set Event                                            */
      __IOM uint32_t CHSEL      : 2;            /*!< [5..4] Event to capture in CCR                                            */
      __IOM uint32_t CHPSC      : 2;            /*!< [7..6] Capture event decimation                                           */
      __IOM uint32_t OCCE       : 1;            /*!< [8..8] ETR pin Enable                                                     */
      __IOM uint32_t OCCM       : 3;            /*!< [11..9] PWM Generate modes                                                */
      __IOM uint32_t BRKEN      : 1;            /*!< [12..12] Clear Ref by BRK                                                 */
      __IOM uint32_t ETREN      : 1;            /*!< [13..13] Clear Ref by BRK                                                 */
      __IOM uint32_t WR_CMPL    : 1;            /*!< [14..14] Can write to CCRx                                                */
      __IOM uint32_t CAP_nPWM   : 1;            /*!< [15..15] CAP or PWM Mode                                                  */
    } CH3_CNTRL_b;
  } ;
  
  union {
    __IOM uint32_t CH4_CNTRL;                   /*!< (@ 0x0000002C) Capture and PWM Channel Control                            */
    
    struct {
      __IOM uint32_t CHFLTR     : 4;            /*!< [3..0] Front hold to set Event                                            */
      __IOM uint32_t CHSEL      : 2;            /*!< [5..4] Event to capture in CCR                                            */
      __IOM uint32_t CHPSC      : 2;            /*!< [7..6] Capture event decimation                                           */
      __IOM uint32_t OCCE       : 1;            /*!< [8..8] ETR pin Enable                                                     */
      __IOM uint32_t OCCM       : 3;            /*!< [11..9] PWM Generate modes                                                */
      __IOM uint32_t BRKEN      : 1;            /*!< [12..12] Clear Ref by BRK                                                 */
      __IOM uint32_t ETREN      : 1;            /*!< [13..13] Clear Ref by BRK                                                 */
      __IOM uint32_t WR_CMPL    : 1;            /*!< [14..14] Can write to CCRx                                                */
      __IOM uint32_t CAP_nPWM   : 1;            /*!< [15..15] CAP or PWM Mode                                                  */
    } CH4_CNTRL_b;
  } ;
  
  union {
    __IOM uint32_t CH1_CNTRL1;                  /*!< (@ 0x00000030) PWM Driver Control                                         */
    
    struct {
      __IOM uint32_t SelOE      : 2;            /*!< [1..0] Select Pin Output Enable                                           */
      __IOM uint32_t SelO       : 2;            /*!< [3..2] Select Output Signal                                               */
      __IOM uint32_t Inv        : 1;            /*!< [4..4] Invert Output Signal                                               */
      __IM  uint32_t            : 3;
      __IOM uint32_t NSelOE     : 2;            /*!< [9..8] Select Pin Output Enable                                           */
      __IOM uint32_t NSelO      : 2;            /*!< [11..10] Select Output Signal                                             */
      __IOM uint32_t NInv       : 1;            /*!< [12..12] Invert Output Signal                                             */
    } CH1_CNTRL1_b;
  } ;
  
  union {
    __IOM uint32_t CH2_CNTRL1;                  /*!< (@ 0x00000034) PWM Driver Control                                         */
    
    struct {
      __IOM uint32_t SelOE      : 2;            /*!< [1..0] Select Pin Output Enable                                           */
      __IOM uint32_t SelO       : 2;            /*!< [3..2] Select Output Signal                                               */
      __IOM uint32_t Inv        : 1;            /*!< [4..4] Invert Output Signal                                               */
      __IM  uint32_t            : 3;
      __IOM uint32_t NSelOE     : 2;            /*!< [9..8] Select Pin Output Enable                                           */
      __IOM uint32_t NSelO      : 2;            /*!< [11..10] Select Output Signal                                             */
      __IOM uint32_t NInv       : 1;            /*!< [12..12] Invert Output Signal                                             */
    } CH2_CNTRL1_b;
  } ;
  
  union {
    __IOM uint32_t CH3_CNTRL1;                  /*!< (@ 0x00000038) PWM Driver Control                                         */
    
