StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
    struct {
      __IOM uint32_t CNT_ZERO_IE : 1;           /*!< [0..0] CNT Zero                                                           */
      __IOM uint32_t CNT_ARR_IE : 1;            /*!< [1..1] CNT eq ARR                                                         */
      __IOM uint32_t ETR_RE_IE  : 1;            /*!< [2..2] ETR Rise Front                                                     */
      __IOM uint32_t ETR_FE_IE  : 1;            /*!< [3..3] ETR Fall Front                                                     */
      __IOM uint32_t BRK_IE     : 1;            /*!< [4..4] BRK High Level                                                     */
      __IOM uint32_t CCR_CAP_CH1_IE : 1;        /*!< [5..5] Captured to CCR                                                    */
      __IOM uint32_t CCR_CAP_CH2_IE : 1;        /*!< [6..6] Captured to CCR                                                    */
      __IOM uint32_t CCR_CAP_CH3_IE : 1;        /*!< [7..7] Captured to CCR                                                    */
      __IOM uint32_t CCR_CAP_CH4_IE : 1;        /*!< [8..8] Captured to CCR                                                    */
      __IOM uint32_t CCR_REF_CH1_IE : 1;        /*!< [9..9] PWM Rise Front                                                     */
      __IOM uint32_t CCR_REF_CH2_IE : 1;        /*!< [10..10] PWM Rise Front                                                   */
      __IOM uint32_t CCR_REF_CH3_IE : 1;        /*!< [11..11] PWM Rise Front                                                   */
      __IOM uint32_t CCR_REF_CH4_IE : 1;        /*!< [12..12] PWM Rise Front                                                   */
      __IOM uint32_t CCR1_CAP_CH1_IE : 1;       /*!< [13..13] Captured to CCR1                                                 */
      __IOM uint32_t CCR1_CAP_CH2_IE : 1;       /*!< [14..14] Captured to CCR1                                                 */
      __IOM uint32_t CCR1_CAP_CH3_IE : 1;       /*!< [15..15] Captured to CCR1                                                 */
      __IOM uint32_t CCR1_CAP_CH4_IE : 1;       /*!< [16..16] Captured to CCR1                                                 */
    } IE_b;
  } ;
  
  union {
    __IOM uint32_t DMA_RE;                      /*!< (@ 0x0000005C) DMA Request Enable for TIMx_DMA_REQ                        */
    
    struct {
      __IOM uint32_t CNT_ZERO_DMAE : 1;         /*!< [0..0] CNT Zero                                                           */
      __IOM uint32_t CNT_ARR_DMAE : 1;          /*!< [1..1] CNT eq ARR                                                         */
      __IOM uint32_t ETR_RE_DMAE : 1;           /*!< [2..2] ETR Rise Front                                                     */
      __IOM uint32_t ETR_FE_DMAE : 1;           /*!< [3..3] ETR Fall Front                                                     */
      __IOM uint32_t BRK_DMAE   : 1;            /*!< [4..4] BRK High Level                                                     */
      __IOM uint32_t CCR_CAP_CH1_DMAE : 1;      /*!< [5..5] Captured to CCR                                                    */
      __IOM uint32_t CCR_CAP_CH2_DMAE : 1;      /*!< [6..6] Captured to CCR                                                    */
      __IOM uint32_t CCR_CAP_CH3_DMAE : 1;      /*!< [7..7] Captured to CCR                                                    */
      __IOM uint32_t CCR_CAP_CH4_DMAE : 1;      /*!< [8..8] Captured to CCR                                                    */
      __IOM uint32_t CCR_REF_CH1_DMAE : 1;      /*!< [9..9] PWM Rise Front                                                     */
      __IOM uint32_t CCR_REF_CH2_DMAE : 1;      /*!< [10..10] PWM Rise Front                                                   */
      __IOM uint32_t CCR_REF_CH3_DMAE : 1;      /*!< [11..11] PWM Rise Front                                                   */
      __IOM uint32_t CCR_REF_CH4_DMAE : 1;      /*!< [12..12] PWM Rise Front                                                   */
      __IOM uint32_t CCR1_CAP_CH1_DMAE : 1;     /*!< [13..13] Captured to CCR1                                                 */
      __IOM uint32_t CCR1_CAP_CH2_DMAE : 1;     /*!< [14..14] Captured to CCR1                                                 */
      __IOM uint32_t CCR1_CAP_CH3_DMAE : 1;     /*!< [15..15] Captured to CCR1                                                 */
      __IOM uint32_t CCR1_CAP_CH4_DMAE : 1;     /*!< [16..16] Captured to CCR1                                                 */
    } DMA_RE_b;
  } ;
  
  union {
    __IOM uint32_t CH1_CNTRL2;                  /*!< (@ 0x00000060) CCR1 Control                                               */
    
    struct {
      __IOM uint32_t CHSel1     : 2;            /*!< [1..0] Event to capture in CCR1                                           */
      __IOM uint32_t CCR1_En    : 1;            /*!< [2..2] Enable CCR1                                                        */
      __IOM uint32_t CCRRLD     : 1;            /*!< [3..3] CCR Reload Mode                                                    */
      __IOM uint32_t CAP_CCR_Fix : 1;           /*!< [4..4] CAP update CCRs fix                                                */
    } CH1_CNTRL2_b;
  } ;
  
  union {
    __IOM uint32_t CH2_CNTRL2;                  /*!< (@ 0x00000064) CCR1 Control                                               */
    
    struct {
      __IOM uint32_t CHSel1     : 2;            /*!< [1..0] Event to capture in CCR1                                           */
      __IOM uint32_t CCR1_En    : 1;            /*!< [2..2] Enable CCR1                                                        */
      __IOM uint32_t CCRRLD     : 1;            /*!< [3..3] CCR Reload Mode                                                    */
      __IOM uint32_t CAP_CCR_Fix : 1;           /*!< [4..4] CAP update CCRs fix                                                */
    } CH2_CNTRL2_b;
  } ;
  
  union {
    __IOM uint32_t CH3_CNTRL2;                  /*!< (@ 0x00000068) CCR1 Control                                               */
    
