StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
    struct {
      __IOM uint32_t LBM        : 1;            /*!< [0..0] Loop Back Mode                                                     */
      __IOM uint32_t SSE        : 1;            /*!< [1..1] Synchronous Serial Enable                                          */
      __IOM uint32_t MS         : 1;            /*!< [2..2] Master or Slave mode                                               */
      __IOM uint32_t SOD        : 1;            /*!< [3..3] Slave mode Output Disable                                          */
    } CR1_b;
  } ;
  
  union {
    __IOM uint32_t DR;                          /*!< (@ 0x00000008) FIFO_Rx and FIFO_Tx access                                 */
    
    struct {
      __IOM uint32_t Data       : 16;           /*!< [15..0] Data value                                                        */
    } DR_b;
  } ;
  
  union {
    __IM  uint32_t SR;                          /*!< (@ 0x0000000C) Status Register                                            */
    
    struct {
      __IM  uint32_t TFE        : 1;            /*!< [0..0] FIFO_TX is Empty                                                   */
      __IM  uint32_t TNF        : 1;            /*!< [1..1] FIFO_TX is Not Full                                                */
      __IM  uint32_t RNE        : 1;            /*!< [2..2] FIFO_RX is Not Empty                                               */
      __IM  uint32_t RFF        : 1;            /*!< [3..3] FIFO_RX is Full                                                    */
      __IM  uint32_t BSY        : 1;            /*!< [4..4] Transfer in progress                                               */
    } SR_b;
  } ;
  
  union {
    __IOM uint32_t CPSR;                        /*!< (@ 0x00000010) Clock Prescaller Register                                  */
    
    struct {
      __IOM uint32_t CPSDVSR    : 8;            /*!< [7..0] Clock Prescaller                                                   */
    } CPSR_b;
  } ;
  
  union {
    __IOM uint32_t IMSC;                        /*!< (@ 0x00000014) IRQ Mask Set-Clear                                         */
    
    struct {
      __IOM uint32_t RORIM      : 1;            /*!< [0..0] Enable IRQ on FIFO_RX overrun                                      */
      __IOM uint32_t RTIM       : 1;            /*!< [1..1] Enable IQR on RX timeout for 32bits                                */
      __IOM uint32_t RXIM       : 1;            /*!< [2..2] Enable IQR on FIFO_RX ge 4 words                                   */
      __IOM uint32_t TXIM       : 1;            /*!< [3..3] Enable IQR on FIFO_TX le 4 words                                   */
    } IMSC_b;
  } ;
  
  union {
    __IM  uint32_t RIS;                         /*!< (@ 0x00000018) Raw Interupt Status                                        */
    
    struct {
      __IM  uint32_t RORRIS     : 1;            /*!< [0..0] FIFO_RX is overrun                                                 */
      __IM  uint32_t RTRIS      : 1;            /*!< [1..1] RX timeout for 32bits                                              */
      __IM  uint32_t RXRIS      : 1;            /*!< [2..2] FIFO_RX gt words                                                   */
      __IM  uint32_t TXRIS      : 1;            /*!< [3..3] FIFO_TX le words                                                   */
    } RIS_b;
  } ;
  
  union {
    __IM  uint32_t MIS;                         /*!< (@ 0x0000001C) Masked Interupt Status                                     */
    
    struct {
      __IM  uint32_t RORMIS     : 1;            /*!< [0..0] FIFO_RX is overrun                                                 */
      __IM  uint32_t RTMIS      : 1;            /*!< [1..1] RX timeout for 32bits                                              */
      __IM  uint32_t RXMIS      : 1;            /*!< [2..2] FIFO_RX ge 4 words                                                 */
      __IM  uint32_t TXMIS      : 1;            /*!< [3..3] FIFO_TX le 4 words                                                 */
    } MIS_b;
  } ;
  
  union {
    __OM  uint32_t ICR;                         /*!< (@ 0x00000020) Interupt Clear Register                                    */
    
    struct {
      __OM  uint32_t RORIC      : 1;            /*!< [0..0] Clear FIFO_RX overrun flag                                         */
      __OM  uint32_t RTIC       : 1;            /*!< [1..1] Clear RX timeout flag                                              */
    } ICR_b;
  } ;
  
  union {
    __IOM uint32_t DMACR;                       /*!< (@ 0x00000024) DMA Control Register                                       */
    
    struct {
      __IOM uint32_t RXDMAE     : 1;            /*!< [0..0] Enable DMA by FIFO_RX has data                                     */
      __IOM uint32_t TXDMAE     : 1;            /*!< [1..1] Enable DMA by FIFO_TX not Full                                     */
    } DMACR_b;
  } ;
} MDR_SSP1_Type;                                /*!< Size = 40 (0x28)                                                          */



/* =========================================================================================================================== */
/* ================                                         MDR_PORTA                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief GPIO Port Control (MDR_PORTA)
  */

typedef struct {                                /*!< (@ 0x400A8000) MDR_PORTA Structure                                        */
  
  union {
    __IOM uint32_t RXTX;                        /*!< (@ 0x00000000) GPIO Pin Data                                              */
    
    struct {
      __IOM uint32_t Pin_0      : 1;            /*!< [0..0] Pin data value                                                     */
      __IOM uint32_t Pin_1      : 1;            /*!< [1..1] Pin data value                                                     */
      __IOM uint32_t Pin_2      : 1;            /*!< [2..2] Pin data value                                                     */
      __IOM uint32_t Pin_3      : 1;            /*!< [3..3] Pin data value                                                     */
      __IOM uint32_t Pin_4      : 1;            /*!< [4..4] Pin data value                                                     */
      __IOM uint32_t Pin_5      : 1;            /*!< [5..5] Pin data value                                                     */
      __IOM uint32_t Pin_6      : 1;            /*!< [6..6] Pin data value                                                     */
      __IOM uint32_t Pin_7      : 1;            /*!< [7..7] Pin data value                                                     */
      __IOM uint32_t Pin_8      : 1;            /*!< [8..8] Pin data value                                                     */
      __IOM uint32_t Pin_9      : 1;            /*!< [9..9] Pin data value                                                     */
      __IOM uint32_t Pin_10     : 1;            /*!< [10..10] Pin data value                                                   */
      __IOM uint32_t Pin_11     : 1;            /*!< [11..11] Pin data value                                                   */
      __IOM uint32_t Pin_12     : 1;            /*!< [12..12] Pin data value                                                   */
      __IOM uint32_t Pin_13     : 1;            /*!< [13..13] Pin data value                                                   */
      __IOM uint32_t Pin_14     : 1;            /*!< [14..14] Pin data value                                                   */
      __IOM uint32_t Pin_15     : 1;            /*!< [15..15] Pin data value                                                   */
    } RXTX_b;
  } ;
  
  union {
    __IOM uint32_t OE;                          /*!< (@ 0x00000004) Output Enable Control                                      */
    
