StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
    struct {
      __IOM uint32_t Pin_0      : 1;            /*!< [0..0] Clear pin to 0                                                     */
      __IOM uint32_t Pin_1      : 1;            /*!< [1..1] Clear pin to 0                                                     */
      __IOM uint32_t Pin_2      : 1;            /*!< [2..2] Clear pin to 0                                                     */
      __IOM uint32_t Pin_3      : 1;            /*!< [3..3] Clear pin to 0                                                     */
      __IOM uint32_t Pin_4      : 1;            /*!< [4..4] Clear pin to 0                                                     */
      __IOM uint32_t Pin_5      : 1;            /*!< [5..5] Clear pin to 0                                                     */
      __IOM uint32_t Pin_6      : 1;            /*!< [6..6] Clear pin to 0                                                     */
      __IOM uint32_t Pin_7      : 1;            /*!< [7..7] Clear pin to 0                                                     */
      __IOM uint32_t Pin_8      : 1;            /*!< [8..8] Clear pin to 0                                                     */
      __IOM uint32_t Pin_9      : 1;            /*!< [9..9] Clear pin to 0                                                     */
      __IOM uint32_t Pin_10     : 1;            /*!< [10..10] Clear pin to 0                                                   */
      __IOM uint32_t Pin_11     : 1;            /*!< [11..11] Clear pin to 0                                                   */
      __IOM uint32_t Pin_12     : 1;            /*!< [12..12] Clear pin to 0                                                   */
      __IOM uint32_t Pin_13     : 1;            /*!< [13..13] Clear pin to 0                                                   */
      __IOM uint32_t Pin_14     : 1;            /*!< [14..14] Clear pin to 0                                                   */
      __IOM uint32_t Pin_15     : 1;            /*!< [15..15] Clear pin to 0                                                   */
    } CLRTX_b;
  } ;
  
  union {
    __IM  uint32_t RDTX;                        /*!< (@ 0x00000028) Value of RXTX in Port mode                                 */
    
    struct {
      __IM  uint32_t Pin_0      : 1;            /*!< [0..0] Pin data value                                                     */
      __IM  uint32_t Pin_1      : 1;            /*!< [1..1] Pin data value                                                     */
      __IM  uint32_t Pin_2      : 1;            /*!< [2..2] Pin data value                                                     */
      __IM  uint32_t Pin_3      : 1;            /*!< [3..3] Pin data value                                                     */
      __IM  uint32_t Pin_4      : 1;            /*!< [4..4] Pin data value                                                     */
      __IM  uint32_t Pin_5      : 1;            /*!< [5..5] Pin data value                                                     */
      __IM  uint32_t Pin_6      : 1;            /*!< [6..6] Pin data value                                                     */
      __IM  uint32_t Pin_7      : 1;            /*!< [7..7] Pin data value                                                     */
      __IM  uint32_t Pin_8      : 1;            /*!< [8..8] Pin data value                                                     */
      __IM  uint32_t Pin_9      : 1;            /*!< [9..9] Pin data value                                                     */
      __IM  uint32_t Pin_10     : 1;            /*!< [10..10] Pin data value                                                   */
      __IM  uint32_t Pin_11     : 1;            /*!< [11..11] Pin data value                                                   */
      __IM  uint32_t Pin_12     : 1;            /*!< [12..12] Pin data value                                                   */
      __IM  uint32_t Pin_13     : 1;            /*!< [13..13] Pin data value                                                   */
      __IM  uint32_t Pin_14     : 1;            /*!< [14..14] Pin data value                                                   */
      __IM  uint32_t Pin_15     : 1;            /*!< [15..15] Pin data value                                                   */
    } RDTX_b;
  } ;
} MDR_PORTA_Type;                               /*!< Size = 44 (0x2c)                                                          */


/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */

#define MDR_EEPROM_BASE             0x40018000UL
#define MDR_RST_CLOCK_BASE          0x40020000UL
#define MDR_DMA_BASE                0x40028000UL
#define MDR_Power_BASE              0x40058000UL
#define MDR_WWDT_BASE               0x40060000UL
#define MDR_IWDT_BASE               0x40068000UL
#define MDR_ADC_BASE                0x40088000UL
#define MDR_BKP_BASE                0x400D8000UL
#define MDR_CAN1_BASE               0x40000000UL
#define MDR_CAN2_BASE               0x40008000UL
#define MDR_UART1_BASE              0x40030000UL
#define MDR_UART2_BASE              0x40038000UL
#define MDR_TIMER1_BASE             0x40070000UL
#define MDR_TIMER2_BASE             0x40078000UL
#define MDR_TIMER3_BASE             0x40080000UL
#define MDR_TIMER4_BASE             0x40098000UL
#define MDR_SSP1_BASE               0x40040000UL
#define MDR_SSP2_BASE               0x400A0000UL
#define MDR_SSP3_BASE               0x400F8000UL
#define MDR_PORTA_BASE              0x400A8000UL
#define MDR_PORTB_BASE              0x400B0000UL
#define MDR_PORTC_BASE              0x400B8000UL
#define MDR_PORTD_BASE              0x400C0000UL
#define MDR_PORTE_BASE              0x400C8000UL
#define MDR_PORTF_BASE              0x400E8000UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */

#define MDR_EEPROM                  ((MDR_EEPROM_Type*)        MDR_EEPROM_BASE)
#define MDR_RST_CLOCK               ((MDR_RST_CLOCK_Type*)     MDR_RST_CLOCK_BASE)
#define MDR_DMA                     ((MDR_DMA_Type*)           MDR_DMA_BASE)
#define MDR_Power                   ((MDR_Power_Type*)         MDR_Power_BASE)
#define MDR_WWDT                    ((MDR_WWDT_Type*)          MDR_WWDT_BASE)
#define MDR_IWDT                    ((MDR_IWDT_Type*)          MDR_IWDT_BASE)
#define MDR_ADC                     ((MDR_ADC_Type*)           MDR_ADC_BASE)
#define MDR_BKP                     ((MDR_BKP_Type*)           MDR_BKP_BASE)
#define MDR_CAN1                    ((MDR_CAN1_Type*)          MDR_CAN1_BASE)
#define MDR_CAN2                    ((MDR_CAN1_Type*)          MDR_CAN2_BASE)
#define MDR_UART1                   ((MDR_UART1_Type*)         MDR_UART1_BASE)
#define MDR_UART2                   ((MDR_UART1_Type*)         MDR_UART2_BASE)
#define MDR_TIMER1                  ((MDR_TIMER1_Type*)        MDR_TIMER1_BASE)
#define MDR_TIMER2                  ((MDR_TIMER1_Type*)        MDR_TIMER2_BASE)
#define MDR_TIMER3                  ((MDR_TIMER1_Type*)        MDR_TIMER3_BASE)
#define MDR_TIMER4                  ((MDR_TIMER1_Type*)        MDR_TIMER4_BASE)
#define MDR_SSP1                    ((MDR_SSP1_Type*)          MDR_SSP1_BASE)
#define MDR_SSP2                    ((MDR_SSP1_Type*)          MDR_SSP2_BASE)
#define MDR_SSP3                    ((MDR_SSP1_Type*)          MDR_SSP3_BASE)
#define MDR_PORTA                   ((MDR_PORTA_Type*)         MDR_PORTA_BASE)
#define MDR_PORTB                   ((MDR_PORTA_Type*)         MDR_PORTB_BASE)
#define MDR_PORTC                   ((MDR_PORTA_Type*)         MDR_PORTC_BASE)
#define MDR_PORTD                   ((MDR_PORTA_Type*)         MDR_PORTD_BASE)
#define MDR_PORTE                   ((MDR_PORTA_Type*)         MDR_PORTE_BASE)
#define MDR_PORTF                   ((MDR_PORTA_Type*)         MDR_PORTF_BASE)

