StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
/** @} */ /* End of group Device_Peripheral_declaration */


/* =========================================  End of section using anonymous unions  ========================================= */
#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif


/* =========================================================================================================================== */
/* ================                                 Pos/Mask Cluster Section                                  ================ */
/* =========================================================================================================================== */


/** @addtogroup PosMask_clusters
  * @{
  */



/* =========================================================================================================================== */
/* ================                                            BUF                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  ID  =========================================================== */
#define BUF_ID_EID_Pos                    (0UL)                     /*!< BUF ID: EID (Bit 0)                                   */
#define BUF_ID_EID_Msk                    (0x3ffffUL)               /*!< BUF ID: EID (Bitfield-Mask: 0x3ffff)                  */
#define BUF_ID_SID_Pos                    (18UL)                    /*!< BUF ID: SID (Bit 18)                                  */
#define BUF_ID_SID_Msk                    (0x1ffc0000UL)            /*!< BUF ID: SID (Bitfield-Mask: 0x7ff)                    */
/* ==========================================================  DLC  ========================================================== */
#define BUF_DLC_DLC_Pos                   (0UL)                     /*!< BUF DLC: DLC (Bit 0)                                  */
#define BUF_DLC_DLC_Msk                   (0xfUL)                   /*!< BUF DLC: DLC (Bitfield-Mask: 0x0f)                    */
#define BUF_DLC_RTR_Pos                   (8UL)                     /*!< BUF DLC: RTR (Bit 8)                                  */
#define BUF_DLC_RTR_Msk                   (0x100UL)                 /*!< BUF DLC: RTR (Bitfield-Mask: 0x01)                    */
#define BUF_DLC_R1_Pos                    (9UL)                     /*!< BUF DLC: R1 (Bit 9)                                   */
#define BUF_DLC_R1_Msk                    (0x200UL)                 /*!< BUF DLC: R1 (Bitfield-Mask: 0x01)                     */
#define BUF_DLC_R0_Pos                    (10UL)                    /*!< BUF DLC: R0 (Bit 10)                                  */
#define BUF_DLC_R0_Msk                    (0x400UL)                 /*!< BUF DLC: R0 (Bitfield-Mask: 0x01)                     */
#define BUF_DLC_SRR_Pos                   (11UL)                    /*!< BUF DLC: SRR (Bit 11)                                 */
#define BUF_DLC_SRR_Msk                   (0x800UL)                 /*!< BUF DLC: SRR (Bitfield-Mask: 0x01)                    */
#define BUF_DLC_IDE_Pos                   (12UL)                    /*!< BUF DLC: IDE (Bit 12)                                 */
#define BUF_DLC_IDE_Msk                   (0x1000UL)                /*!< BUF DLC: IDE (Bitfield-Mask: 0x01)                    */
/* =========================================================  DATAL  ========================================================= */
#define BUF_DATAL_DB0_Pos                 (0UL)                     /*!< BUF DATAL: DB0 (Bit 0)                                */
#define BUF_DATAL_DB0_Msk                 (0xffUL)                  /*!< BUF DATAL: DB0 (Bitfield-Mask: 0xff)                  */
#define BUF_DATAL_DB1_Pos                 (8UL)                     /*!< BUF DATAL: DB1 (Bit 8)                                */
#define BUF_DATAL_DB1_Msk                 (0xff00UL)                /*!< BUF DATAL: DB1 (Bitfield-Mask: 0xff)                  */
#define BUF_DATAL_DB2_Pos                 (16UL)                    /*!< BUF DATAL: DB2 (Bit 16)                               */
#define BUF_DATAL_DB2_Msk                 (0xff0000UL)              /*!< BUF DATAL: DB2 (Bitfield-Mask: 0xff)                  */
#define BUF_DATAL_DB3_Pos                 (24UL)                    /*!< BUF DATAL: DB3 (Bit 24)                               */
#define BUF_DATAL_DB3_Msk                 (0xff000000UL)            /*!< BUF DATAL: DB3 (Bitfield-Mask: 0xff)                  */
/* =========================================================  DATAH  ========================================================= */
#define BUF_DATAH_DB4_Pos                 (0UL)                     /*!< BUF DATAH: DB4 (Bit 0)                                */
#define BUF_DATAH_DB4_Msk                 (0xffUL)                  /*!< BUF DATAH: DB4 (Bitfield-Mask: 0xff)                  */
#define BUF_DATAH_DB5_Pos                 (8UL)                     /*!< BUF DATAH: DB5 (Bit 8)                                */
#define BUF_DATAH_DB5_Msk                 (0xff00UL)                /*!< BUF DATAH: DB5 (Bitfield-Mask: 0xff)                  */
#define BUF_DATAH_DB6_Pos                 (16UL)                    /*!< BUF DATAH: DB6 (Bit 16)                               */
#define BUF_DATAH_DB6_Msk                 (0xff0000UL)              /*!< BUF DATAH: DB6 (Bitfield-Mask: 0xff)                  */
#define BUF_DATAH_DB7_Pos                 (24UL)                    /*!< BUF DATAH: DB7 (Bit 24)                               */
#define BUF_DATAH_DB7_Msk                 (0xff000000UL)            /*!< BUF DATAH: DB7 (Bitfield-Mask: 0xff)                  */


/* =========================================================================================================================== */
/* ================                                          FILTER                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  MASK  ========================================================== */
/* ========================================================  FILTER  ========================================================= */

/** @} */ /* End of group PosMask_clusters */


/* =========================================================================================================================== */
/* ================                                Pos/Mask Peripheral Section                                ================ */
/* =========================================================================================================================== */


/** @addtogroup PosMask_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                        MDR_EEPROM                                         ================ */
/* =========================================================================================================================== */

/* ==========================================================  CMD  ========================================================== */
#define MDR_EEPROM_CMD_CON_Pos            (0UL)                     /*!< MDR_EEPROM CMD: CON (Bit 0)                           */
#define MDR_EEPROM_CMD_CON_Msk            (0x1UL)                   /*!< MDR_EEPROM CMD: CON (Bitfield-Mask: 0x01)             */
#define MDR_EEPROM_CMD_WR_Pos             (1UL)                     /*!< MDR_EEPROM CMD: WR (Bit 1)                            */
#define MDR_EEPROM_CMD_WR_Msk             (0x2UL)                   /*!< MDR_EEPROM CMD: WR (Bitfield-Mask: 0x01)              */
#define MDR_EEPROM_CMD_RD_Pos             (2UL)                     /*!< MDR_EEPROM CMD: RD (Bit 2)                            */
#define MDR_EEPROM_CMD_RD_Msk             (0x4UL)                   /*!< MDR_EEPROM CMD: RD (Bitfield-Mask: 0x01)              */
#define MDR_EEPROM_CMD_DELAY_Pos          (3UL)                     /*!< MDR_EEPROM CMD: DELAY (Bit 3)                         */
#define MDR_EEPROM_CMD_DELAY_Msk          (0x38UL)                  /*!< MDR_EEPROM CMD: DELAY (Bitfield-Mask: 0x07)           */
#define MDR_EEPROM_CMD_XE_Pos             (6UL)                     /*!< MDR_EEPROM CMD: XE (Bit 6)                            */
#define MDR_EEPROM_CMD_XE_Msk             (0x40UL)                  /*!< MDR_EEPROM CMD: XE (Bitfield-Mask: 0x01)              */
#define MDR_EEPROM_CMD_YE_Pos             (7UL)                     /*!< MDR_EEPROM CMD: YE (Bit 7)                            */
#define MDR_EEPROM_CMD_YE_Msk             (0x80UL)                  /*!< MDR_EEPROM CMD: YE (Bitfield-Mask: 0x01)              */
#define MDR_EEPROM_CMD_SE_Pos             (8UL)                     /*!< MDR_EEPROM CMD: SE (Bit 8)                            */
#define MDR_EEPROM_CMD_SE_Msk             (0x100UL)                 /*!< MDR_EEPROM CMD: SE (Bitfield-Mask: 0x01)              */
#define MDR_EEPROM_CMD_IFREN_Pos          (9UL)                     /*!< MDR_EEPROM CMD: IFREN (Bit 9)                         */
#define MDR_EEPROM_CMD_IFREN_Msk          (0x200UL)                 /*!< MDR_EEPROM CMD: IFREN (Bitfield-Mask: 0x01)           */
#define MDR_EEPROM_CMD_ERASE_Pos          (10UL)                    /*!< MDR_EEPROM CMD: ERASE (Bit 10)                        */
#define MDR_EEPROM_CMD_ERASE_Msk          (0x400UL)                 /*!< MDR_EEPROM CMD: ERASE (Bitfield-Mask: 0x01)           */
#define MDR_EEPROM_CMD_MAS1_Pos           (11UL)                    /*!< MDR_EEPROM CMD: MAS1 (Bit 11)                         */
#define MDR_EEPROM_CMD_MAS1_Msk           (0x800UL)                 /*!< MDR_EEPROM CMD: MAS1 (Bitfield-Mask: 0x01)            */
#define MDR_EEPROM_CMD_PROG_Pos           (12UL)                    /*!< MDR_EEPROM CMD: PROG (Bit 12)                         */
#define MDR_EEPROM_CMD_PROG_Msk           (0x1000UL)                /*!< MDR_EEPROM CMD: PROG (Bitfield-Mask: 0x01)            */
#define MDR_EEPROM_CMD_NVSTR_Pos          (13UL)                    /*!< MDR_EEPROM CMD: NVSTR (Bit 13)                        */
#define MDR_EEPROM_CMD_NVSTR_Msk          (0x2000UL)                /*!< MDR_EEPROM CMD: NVSTR (Bitfield-Mask: 0x01)           */
/* =========================================================  ADDR  ========================================================== */
/* ==========================================================  DI  =========================================================== */
/* ==========================================================  DO  =========================================================== */
/* ==========================================================  KEY  ========================================================== */


/* =========================================================================================================================== */
/* ================                                       MDR_RST_CLOCK                                       ================ */
/* =========================================================================================================================== */

