StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
#define MDR_RST_CLOCK_ETH_CLOCK_ETH_BRG_Pos (0UL)                   /*!< MDR_RST_CLOCK ETH_CLOCK: ETH_BRG (Bit 0)              */
#define MDR_RST_CLOCK_ETH_CLOCK_ETH_BRG_Msk (0xffUL)                /*!< MDR_RST_CLOCK ETH_CLOCK: ETH_BRG (Bitfield-Mask: 0xff) */
#define MDR_RST_CLOCK_ETH_CLOCK_MIL_BRG_Pos (8UL)                   /*!< MDR_RST_CLOCK ETH_CLOCK: MIL_BRG (Bit 8)              */
#define MDR_RST_CLOCK_ETH_CLOCK_MIL_BRG_Msk (0x700UL)               /*!< MDR_RST_CLOCK ETH_CLOCK: MIL_BRG (Bitfield-Mask: 0x07) */
#define MDR_RST_CLOCK_ETH_CLOCK_PHY_BRG_Pos (16UL)                  /*!< MDR_RST_CLOCK ETH_CLOCK: PHY_BRG (Bit 16)             */
#define MDR_RST_CLOCK_ETH_CLOCK_PHY_BRG_Msk (0x70000UL)             /*!< MDR_RST_CLOCK ETH_CLOCK: PHY_BRG (Bitfield-Mask: 0x07) */
#define MDR_RST_CLOCK_ETH_CLOCK_ETH_CLK_EN_Pos (24UL)               /*!< MDR_RST_CLOCK ETH_CLOCK: ETH_CLK_EN (Bit 24)          */
#define MDR_RST_CLOCK_ETH_CLOCK_ETH_CLK_EN_Msk (0x1000000UL)        /*!< MDR_RST_CLOCK ETH_CLOCK: ETH_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_ETH_CLOCK_MIL_CLK_EN_Pos (25UL)               /*!< MDR_RST_CLOCK ETH_CLOCK: MIL_CLK_EN (Bit 25)          */
#define MDR_RST_CLOCK_ETH_CLOCK_MIL_CLK_EN_Msk (0x2000000UL)        /*!< MDR_RST_CLOCK ETH_CLOCK: MIL_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_ETH_CLOCK_SLEEP_Pos (26UL)                    /*!< MDR_RST_CLOCK ETH_CLOCK: SLEEP (Bit 26)               */
#define MDR_RST_CLOCK_ETH_CLOCK_SLEEP_Msk (0x4000000UL)             /*!< MDR_RST_CLOCK ETH_CLOCK: SLEEP (Bitfield-Mask: 0x01)  */
#define MDR_RST_CLOCK_ETH_CLOCK_PHY_CLK_EN_Pos (27UL)               /*!< MDR_RST_CLOCK ETH_CLOCK: PHY_CLK_EN (Bit 27)          */
#define MDR_RST_CLOCK_ETH_CLOCK_PHY_CLK_EN_Msk (0x8000000UL)        /*!< MDR_RST_CLOCK ETH_CLOCK: PHY_CLK_EN (Bitfield-Mask: 0x01) */
#define MDR_RST_CLOCK_ETH_CLOCK_PHY_CLK_SEL_Pos (28UL)              /*!< MDR_RST_CLOCK ETH_CLOCK: PHY_CLK_SEL (Bit 28)         */
#define MDR_RST_CLOCK_ETH_CLOCK_PHY_CLK_SEL_Msk (0x30000000UL)      /*!< MDR_RST_CLOCK ETH_CLOCK: PHY_CLK_SEL (Bitfield-Mask: 0x03) */


/* =========================================================================================================================== */
/* ================                                          MDR_DMA                                          ================ */
/* =========================================================================================================================== */

/* ========================================================  STATUS  ========================================================= */
#define MDR_DMA_STATUS_Enable_Pos         (0UL)                     /*!< MDR_DMA STATUS: Enable (Bit 0)                        */
#define MDR_DMA_STATUS_Enable_Msk         (0x1UL)                   /*!< MDR_DMA STATUS: Enable (Bitfield-Mask: 0x01)          */
#define MDR_DMA_STATUS_State_Pos          (4UL)                     /*!< MDR_DMA STATUS: State (Bit 4)                         */
#define MDR_DMA_STATUS_State_Msk          (0xf0UL)                  /*!< MDR_DMA STATUS: State (Bitfield-Mask: 0x0f)           */
#define MDR_DMA_STATUS_Chnls_minus1_Pos   (16UL)                    /*!< MDR_DMA STATUS: Chnls_minus1 (Bit 16)                 */
#define MDR_DMA_STATUS_Chnls_minus1_Msk   (0x1f0000UL)              /*!< MDR_DMA STATUS: Chnls_minus1 (Bitfield-Mask: 0x1f)    */
#define MDR_DMA_STATUS_test_status_Pos    (28UL)                    /*!< MDR_DMA STATUS: test_status (Bit 28)                  */
#define MDR_DMA_STATUS_test_status_Msk    (0x10000000UL)            /*!< MDR_DMA STATUS: test_status (Bitfield-Mask: 0x01)     */
/* ==========================================================  CFG  ========================================================== */
#define MDR_DMA_CFG_Enable_Pos            (0UL)                     /*!< MDR_DMA CFG: Enable (Bit 0)                           */
#define MDR_DMA_CFG_Enable_Msk            (0x1UL)                   /*!< MDR_DMA CFG: Enable (Bitfield-Mask: 0x01)             */
#define MDR_DMA_CFG_Privileged_Pos        (5UL)                     /*!< MDR_DMA CFG: Privileged (Bit 5)                       */
#define MDR_DMA_CFG_Privileged_Msk        (0x20UL)                  /*!< MDR_DMA CFG: Privileged (Bitfield-Mask: 0x01)         */
#define MDR_DMA_CFG_Bufferable_Pos        (6UL)                     /*!< MDR_DMA CFG: Bufferable (Bit 6)                       */
#define MDR_DMA_CFG_Bufferable_Msk        (0x40UL)                  /*!< MDR_DMA CFG: Bufferable (Bitfield-Mask: 0x01)         */
#define MDR_DMA_CFG_Cachable_Pos          (7UL)                     /*!< MDR_DMA CFG: Cachable (Bit 7)                         */
#define MDR_DMA_CFG_Cachable_Msk          (0x80UL)                  /*!< MDR_DMA CFG: Cachable (Bitfield-Mask: 0x01)           */
/* =====================================================  CTRL_BASE_PTR  ===================================================== */
#define MDR_DMA_CTRL_BASE_PTR_Addr_Hi_Pos (10UL)                    /*!< MDR_DMA CTRL_BASE_PTR: Addr_Hi (Bit 10)               */
#define MDR_DMA_CTRL_BASE_PTR_Addr_Hi_Msk (0xfffffc00UL)            /*!< MDR_DMA CTRL_BASE_PTR: Addr_Hi (Bitfield-Mask: 0x3fffff) */
/* ===================================================  ALT_CTRL_BASE_PTR  =================================================== */
#define MDR_DMA_ALT_CTRL_BASE_PTR_Addr_Pos (0UL)                    /*!< MDR_DMA ALT_CTRL_BASE_PTR: Addr (Bit 0)               */
#define MDR_DMA_ALT_CTRL_BASE_PTR_Addr_Msk (0xffffffffUL)           /*!< MDR_DMA ALT_CTRL_BASE_PTR: Addr (Bitfield-Mask: 0xffffffff) */
/* ===================================================  WAITONREQ_STATUS  ==================================================== */
#define MDR_DMA_WAITONREQ_STATUS_Ch__Pos  (0UL)                     /*!< MDR_DMA WAITONREQ_STATUS: Ch_ (Bit 0)                 */
#define MDR_DMA_WAITONREQ_STATUS_Ch__Msk  (0x1UL)                   /*!< MDR_DMA WAITONREQ_STATUS: Ch_ (Bitfield-Mask: 0x01)   */
/* ====================================================  CHNL_SW_REQUEST  ==================================================== */
#define MDR_DMA_CHNL_SW_REQUEST_Ch__Pos   (0UL)                     /*!< MDR_DMA CHNL_SW_REQUEST: Ch_ (Bit 0)                  */
#define MDR_DMA_CHNL_SW_REQUEST_Ch__Msk   (0x1UL)                   /*!< MDR_DMA CHNL_SW_REQUEST: Ch_ (Bitfield-Mask: 0x01)    */
/* ===================================================  CHNL_USEBURST_SET  =================================================== */
#define MDR_DMA_CHNL_USEBURST_SET_Ch__Pos (0UL)                     /*!< MDR_DMA CHNL_USEBURST_SET: Ch_ (Bit 0)                */
#define MDR_DMA_CHNL_USEBURST_SET_Ch__Msk (0x1UL)                   /*!< MDR_DMA CHNL_USEBURST_SET: Ch_ (Bitfield-Mask: 0x01)  */
/* ===================================================  CHNL_USEBURST_CLR  =================================================== */
#define MDR_DMA_CHNL_USEBURST_CLR_Ch__Pos (0UL)                     /*!< MDR_DMA CHNL_USEBURST_CLR: Ch_ (Bit 0)                */
#define MDR_DMA_CHNL_USEBURST_CLR_Ch__Msk (0x1UL)                   /*!< MDR_DMA CHNL_USEBURST_CLR: Ch_ (Bitfield-Mask: 0x01)  */
/* ===================================================  CHNL_REQ_MASK_SET  =================================================== */
#define MDR_DMA_CHNL_REQ_MASK_SET_Ch__Pos (0UL)                     /*!< MDR_DMA CHNL_REQ_MASK_SET: Ch_ (Bit 0)                */
#define MDR_DMA_CHNL_REQ_MASK_SET_Ch__Msk (0x1UL)                   /*!< MDR_DMA CHNL_REQ_MASK_SET: Ch_ (Bitfield-Mask: 0x01)  */
/* ===================================================  CHNL_REQ_MASK_CLR  =================================================== */
#define MDR_DMA_CHNL_REQ_MASK_CLR_Ch__Pos (0UL)                     /*!< MDR_DMA CHNL_REQ_MASK_CLR: Ch_ (Bit 0)                */
#define MDR_DMA_CHNL_REQ_MASK_CLR_Ch__Msk (0x1UL)                   /*!< MDR_DMA CHNL_REQ_MASK_CLR: Ch_ (Bitfield-Mask: 0x01)  */
/* ====================================================  CHNL_ENABLE_SET  ==================================================== */
#define MDR_DMA_CHNL_ENABLE_SET_Ch__Pos   (0UL)                     /*!< MDR_DMA CHNL_ENABLE_SET: Ch_ (Bit 0)                  */
#define MDR_DMA_CHNL_ENABLE_SET_Ch__Msk   (0x1UL)                   /*!< MDR_DMA CHNL_ENABLE_SET: Ch_ (Bitfield-Mask: 0x01)    */
/* ====================================================  CHNL_ENABLE_CLR  ==================================================== */
#define MDR_DMA_CHNL_ENABLE_CLR_Ch__Pos   (0UL)                     /*!< MDR_DMA CHNL_ENABLE_CLR: Ch_ (Bit 0)                  */
#define MDR_DMA_CHNL_ENABLE_CLR_Ch__Msk   (0x1UL)                   /*!< MDR_DMA CHNL_ENABLE_CLR: Ch_ (Bitfield-Mask: 0x01)    */
/* ===================================================  CHNL_PRI_ALT_SET  ==================================================== */
#define MDR_DMA_CHNL_PRI_ALT_SET_Ch__Pos  (0UL)                     /*!< MDR_DMA CHNL_PRI_ALT_SET: Ch_ (Bit 0)                 */
#define MDR_DMA_CHNL_PRI_ALT_SET_Ch__Msk  (0x1UL)                   /*!< MDR_DMA CHNL_PRI_ALT_SET: Ch_ (Bitfield-Mask: 0x01)   */
/* ===================================================  CHNL_PRI_ALT_CLR  ==================================================== */
#define MDR_DMA_CHNL_PRI_ALT_CLR_Ch__Pos  (0UL)                     /*!< MDR_DMA CHNL_PRI_ALT_CLR: Ch_ (Bit 0)                 */
#define MDR_DMA_CHNL_PRI_ALT_CLR_Ch__Msk  (0x1UL)                   /*!< MDR_DMA CHNL_PRI_ALT_CLR: Ch_ (Bitfield-Mask: 0x01)   */
/* ===================================================  CHNL_PRIORITY_SET  =================================================== */
#define MDR_DMA_CHNL_PRIORITY_SET_Ch__Pos (0UL)                     /*!< MDR_DMA CHNL_PRIORITY_SET: Ch_ (Bit 0)                */
#define MDR_DMA_CHNL_PRIORITY_SET_Ch__Msk (0x1UL)                   /*!< MDR_DMA CHNL_PRIORITY_SET: Ch_ (Bitfield-Mask: 0x01)  */
/* ===================================================  CHNL_PRIORITY_CLR  =================================================== */
#define MDR_DMA_CHNL_PRIORITY_CLR_Ch__Pos (0UL)                     /*!< MDR_DMA CHNL_PRIORITY_CLR: Ch_ (Bit 0)                */
#define MDR_DMA_CHNL_PRIORITY_CLR_Ch__Msk (0x1UL)                   /*!< MDR_DMA CHNL_PRIORITY_CLR: Ch_ (Bitfield-Mask: 0x01)  */
/* ========================================================  ERR_CLR  ======================================================== */
#define MDR_DMA_ERR_CLR_Ch__Pos           (0UL)                     /*!< MDR_DMA ERR_CLR: Ch_ (Bit 0)                          */
#define MDR_DMA_ERR_CLR_Ch__Msk           (0x1UL)                   /*!< MDR_DMA ERR_CLR: Ch_ (Bitfield-Mask: 0x01)            */


/* =========================================================================================================================== */
/* ================                                         MDR_Power                                         ================ */
/* =========================================================================================================================== */

/* =========================================================  PVDCS  ========================================================= */
#define MDR_Power_PVDCS_PVDEN_Pos         (0UL)                     /*!< MDR_Power PVDCS: PVDEN (Bit 0)                        */
#define MDR_Power_PVDCS_PVDEN_Msk         (0x1UL)                   /*!< MDR_Power PVDCS: PVDEN (Bitfield-Mask: 0x01)          */
#define MDR_Power_PVDCS_PBLS_Pos          (1UL)                     /*!< MDR_Power PVDCS: PBLS (Bit 1)                         */
#define MDR_Power_PVDCS_PBLS_Msk          (0x6UL)                   /*!< MDR_Power PVDCS: PBLS (Bitfield-Mask: 0x03)           */
#define MDR_Power_PVDCS_PLS_Pos           (3UL)                     /*!< MDR_Power PVDCS: PLS (Bit 3)                          */
#define MDR_Power_PVDCS_PLS_Msk           (0x38UL)                  /*!< MDR_Power PVDCS: PLS (Bitfield-Mask: 0x07)            */
#define MDR_Power_PVDCS_PVBD_Pos          (6UL)                     /*!< MDR_Power PVDCS: PVBD (Bit 6)                         */
#define MDR_Power_PVDCS_PVBD_Msk          (0x40UL)                  /*!< MDR_Power PVDCS: PVBD (Bitfield-Mask: 0x01)           */
#define MDR_Power_PVDCS_PVD_Pos           (7UL)                     /*!< MDR_Power PVDCS: PVD (Bit 7)                          */
#define MDR_Power_PVDCS_PVD_Msk           (0x80UL)                  /*!< MDR_Power PVDCS: PVD (Bitfield-Mask: 0x01)            */
#define MDR_Power_PVDCS_IEPVBD_Pos        (8UL)                     /*!< MDR_Power PVDCS: IEPVBD (Bit 8)                       */
#define MDR_Power_PVDCS_IEPVBD_Msk        (0x100UL)                 /*!< MDR_Power PVDCS: IEPVBD (Bitfield-Mask: 0x01)         */
#define MDR_Power_PVDCS_IEPVD_Pos         (9UL)                     /*!< MDR_Power PVDCS: IEPVD (Bit 9)                        */
#define MDR_Power_PVDCS_IEPVD_Msk         (0x200UL)                 /*!< MDR_Power PVDCS: IEPVD (Bitfield-Mask: 0x01)          */
#define MDR_Power_PVDCS_INVB_Pos          (10UL)                    /*!< MDR_Power PVDCS: INVB (Bit 10)                        */
#define MDR_Power_PVDCS_INVB_Msk          (0x400UL)                 /*!< MDR_Power PVDCS: INVB (Bitfield-Mask: 0x01)           */
#define MDR_Power_PVDCS_INV_Pos           (11UL)                    /*!< MDR_Power PVDCS: INV (Bit 11)                         */
#define MDR_Power_PVDCS_INV_Msk           (0x800UL)                 /*!< MDR_Power PVDCS: INV (Bitfield-Mask: 0x01)            */
#define MDR_Power_PVDCS_PVDBEN_Pos        (12UL)                    /*!< MDR_Power PVDCS: PVDBEN (Bit 12)                      */
#define MDR_Power_PVDCS_PVDBEN_Msk        (0x1000UL)                /*!< MDR_Power PVDCS: PVDBEN (Bitfield-Mask: 0x01)         */
/* ========================================================  ResReg  ========================================================= */
#define MDR_Power_ResReg_Value_Pos        (0UL)                     /*!< MDR_Power ResReg: Value (Bit 0)                       */
#define MDR_Power_ResReg_Value_Msk        (0xffffffffUL)            /*!< MDR_Power ResReg: Value (Bitfield-Mask: 0xffffffff)   */


/* =========================================================================================================================== */
/* ================                                         MDR_WWDT                                          ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR  =========================================================== */
#define MDR_WWDT_CR_T_Pos                 (0UL)                     /*!< MDR_WWDT CR: T (Bit 0)                                */
#define MDR_WWDT_CR_T_Msk                 (0x7fUL)                  /*!< MDR_WWDT CR: T (Bitfield-Mask: 0x7f)                  */
#define MDR_WWDT_CR_WDGA_Pos              (7UL)                     /*!< MDR_WWDT CR: WDGA (Bit 7)                             */
#define MDR_WWDT_CR_WDGA_Msk              (0x80UL)                  /*!< MDR_WWDT CR: WDGA (Bitfield-Mask: 0x01)               */
/* ==========================================================  CFR  ========================================================== */
#define MDR_WWDT_CFR_W_Pos                (0UL)                     /*!< MDR_WWDT CFR: W (Bit 0)                               */
#define MDR_WWDT_CFR_W_Msk                (0x7fUL)                  /*!< MDR_WWDT CFR: W (Bitfield-Mask: 0x7f)                 */
#define MDR_WWDT_CFR_WGTB_Pos             (7UL)                     /*!< MDR_WWDT CFR: WGTB (Bit 7)                            */
#define MDR_WWDT_CFR_WGTB_Msk             (0x180UL)                 /*!< MDR_WWDT CFR: WGTB (Bitfield-Mask: 0x03)              */
#define MDR_WWDT_CFR_EWI_Pos              (9UL)                     /*!< MDR_WWDT CFR: EWI (Bit 9)                             */
#define MDR_WWDT_CFR_EWI_Msk              (0x200UL)                 /*!< MDR_WWDT CFR: EWI (Bitfield-Mask: 0x01)               */
/* ==========================================================  SR  =========================================================== */
#define MDR_WWDT_SR_EWIF_Pos              (0UL)                     /*!< MDR_WWDT SR: EWIF (Bit 0)                             */
#define MDR_WWDT_SR_EWIF_Msk              (0x1UL)                   /*!< MDR_WWDT SR: EWIF (Bitfield-Mask: 0x01)               */


/* =========================================================================================================================== */
/* ================                                         MDR_IWDT                                          ================ */
/* =========================================================================================================================== */

/* ==========================================================  KR  =========================================================== */
#define MDR_IWDT_KR_KEY_Pos               (0UL)                     /*!< MDR_IWDT KR: KEY (Bit 0)                              */
#define MDR_IWDT_KR_KEY_Msk               (0xffffUL)                /*!< MDR_IWDT KR: KEY (Bitfield-Mask: 0xffff)              */
/* ==========================================================  PR  =========================================================== */
#define MDR_IWDT_PR_PR_Pos                (0UL)                     /*!< MDR_IWDT PR: PR (Bit 0)                               */
#define MDR_IWDT_PR_PR_Msk                (0x7UL)                   /*!< MDR_IWDT PR: PR (Bitfield-Mask: 0x07)                 */
/* ==========================================================  RLR  ========================================================== */
#define MDR_IWDT_RLR_PRL_Pos              (0UL)                     /*!< MDR_IWDT RLR: PRL (Bit 0)                             */
#define MDR_IWDT_RLR_PRL_Msk              (0xfffUL)                 /*!< MDR_IWDT RLR: PRL (Bitfield-Mask: 0xfff)              */
/* ==========================================================  SR  =========================================================== */
#define MDR_IWDT_SR_PVU_Pos               (0UL)                     /*!< MDR_IWDT SR: PVU (Bit 0)                              */
#define MDR_IWDT_SR_PVU_Msk               (0x1UL)                   /*!< MDR_IWDT SR: PVU (Bitfield-Mask: 0x01)                */
#define MDR_IWDT_SR_RVU_Pos               (1UL)                     /*!< MDR_IWDT SR: RVU (Bit 1)                              */
#define MDR_IWDT_SR_RVU_Msk               (0x2UL)                   /*!< MDR_IWDT SR: RVU (Bitfield-Mask: 0x01)                */


/* =========================================================================================================================== */
/* ================                                          MDR_ADC                                          ================ */
/* =========================================================================================================================== */

