StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
/* ========================================================  CONTROL  ======================================================== */
#define MDR_CAN1_CONTROL_CAN_EN_Pos       (0UL)                     /*!< MDR_CAN1 CONTROL: CAN_EN (Bit 0)                      */
#define MDR_CAN1_CONTROL_CAN_EN_Msk       (0x1UL)                   /*!< MDR_CAN1 CONTROL: CAN_EN (Bitfield-Mask: 0x01)        */
#define MDR_CAN1_CONTROL_ROM_Pos          (1UL)                     /*!< MDR_CAN1 CONTROL: ROM (Bit 1)                         */
#define MDR_CAN1_CONTROL_ROM_Msk          (0x2UL)                   /*!< MDR_CAN1 CONTROL: ROM (Bitfield-Mask: 0x01)           */
#define MDR_CAN1_CONTROL_STM_Pos          (2UL)                     /*!< MDR_CAN1 CONTROL: STM (Bit 2)                         */
#define MDR_CAN1_CONTROL_STM_Msk          (0x4UL)                   /*!< MDR_CAN1 CONTROL: STM (Bitfield-Mask: 0x01)           */
#define MDR_CAN1_CONTROL_SAP_Pos          (3UL)                     /*!< MDR_CAN1 CONTROL: SAP (Bit 3)                         */
#define MDR_CAN1_CONTROL_SAP_Msk          (0x8UL)                   /*!< MDR_CAN1 CONTROL: SAP (Bitfield-Mask: 0x01)           */
#define MDR_CAN1_CONTROL_ROP_Pos          (4UL)                     /*!< MDR_CAN1 CONTROL: ROP (Bit 4)                         */
#define MDR_CAN1_CONTROL_ROP_Msk          (0x10UL)                  /*!< MDR_CAN1 CONTROL: ROP (Bitfield-Mask: 0x01)           */
/* ========================================================  STATUS  ========================================================= */
#define MDR_CAN1_STATUS_RX_Ready_Pos      (0UL)                     /*!< MDR_CAN1 STATUS: RX_Ready (Bit 0)                     */
#define MDR_CAN1_STATUS_RX_Ready_Msk      (0x1UL)                   /*!< MDR_CAN1 STATUS: RX_Ready (Bitfield-Mask: 0x01)       */
#define MDR_CAN1_STATUS_TX_Ready_Pos      (1UL)                     /*!< MDR_CAN1 STATUS: TX_Ready (Bit 1)                     */
#define MDR_CAN1_STATUS_TX_Ready_Msk      (0x2UL)                   /*!< MDR_CAN1 STATUS: TX_Ready (Bitfield-Mask: 0x01)       */
#define MDR_CAN1_STATUS_ERR_Over_Pos      (2UL)                     /*!< MDR_CAN1 STATUS: ERR_Over (Bit 2)                     */
#define MDR_CAN1_STATUS_ERR_Over_Msk      (0x4UL)                   /*!< MDR_CAN1 STATUS: ERR_Over (Bitfield-Mask: 0x01)       */
#define MDR_CAN1_STATUS_ERR_Bit_Pos       (3UL)                     /*!< MDR_CAN1 STATUS: ERR_Bit (Bit 3)                      */
#define MDR_CAN1_STATUS_ERR_Bit_Msk       (0x8UL)                   /*!< MDR_CAN1 STATUS: ERR_Bit (Bitfield-Mask: 0x01)        */
#define MDR_CAN1_STATUS_ERR_StuffBit_Pos  (4UL)                     /*!< MDR_CAN1 STATUS: ERR_StuffBit (Bit 4)                 */
#define MDR_CAN1_STATUS_ERR_StuffBit_Msk  (0x10UL)                  /*!< MDR_CAN1 STATUS: ERR_StuffBit (Bitfield-Mask: 0x01)   */
#define MDR_CAN1_STATUS_ERR_CRC_Pos       (5UL)                     /*!< MDR_CAN1 STATUS: ERR_CRC (Bit 5)                      */
#define MDR_CAN1_STATUS_ERR_CRC_Msk       (0x20UL)                  /*!< MDR_CAN1 STATUS: ERR_CRC (Bitfield-Mask: 0x01)        */
#define MDR_CAN1_STATUS_ERR_FRAME_Pos     (6UL)                     /*!< MDR_CAN1 STATUS: ERR_FRAME (Bit 6)                    */
#define MDR_CAN1_STATUS_ERR_FRAME_Msk     (0x40UL)                  /*!< MDR_CAN1 STATUS: ERR_FRAME (Bitfield-Mask: 0x01)      */
#define MDR_CAN1_STATUS_ERR_ACK_Pos       (7UL)                     /*!< MDR_CAN1 STATUS: ERR_ACK (Bit 7)                      */
#define MDR_CAN1_STATUS_ERR_ACK_Msk       (0x80UL)                  /*!< MDR_CAN1 STATUS: ERR_ACK (Bitfield-Mask: 0x01)        */
#define MDR_CAN1_STATUS_ID_Lover_Pos      (8UL)                     /*!< MDR_CAN1 STATUS: ID_Lover (Bit 8)                     */
#define MDR_CAN1_STATUS_ID_Lover_Msk      (0x100UL)                 /*!< MDR_CAN1 STATUS: ID_Lover (Bitfield-Mask: 0x01)       */
#define MDR_CAN1_STATUS_ERR_Status_Pos    (9UL)                     /*!< MDR_CAN1 STATUS: ERR_Status (Bit 9)                   */
#define MDR_CAN1_STATUS_ERR_Status_Msk    (0x600UL)                 /*!< MDR_CAN1 STATUS: ERR_Status (Bitfield-Mask: 0x03)     */
#define MDR_CAN1_STATUS_RX_ERR_CNT8_Pos   (11UL)                    /*!< MDR_CAN1 STATUS: RX_ERR_CNT8 (Bit 11)                 */
#define MDR_CAN1_STATUS_RX_ERR_CNT8_Msk   (0x800UL)                 /*!< MDR_CAN1 STATUS: RX_ERR_CNT8 (Bitfield-Mask: 0x01)    */
#define MDR_CAN1_STATUS_TX_ERR_CNT8_Pos   (12UL)                    /*!< MDR_CAN1 STATUS: TX_ERR_CNT8 (Bit 12)                 */
#define MDR_CAN1_STATUS_TX_ERR_CNT8_Msk   (0x1000UL)                /*!< MDR_CAN1 STATUS: TX_ERR_CNT8 (Bitfield-Mask: 0x01)    */
#define MDR_CAN1_STATUS_RX_ERR_CNT_Pos    (16UL)                    /*!< MDR_CAN1 STATUS: RX_ERR_CNT (Bit 16)                  */
#define MDR_CAN1_STATUS_RX_ERR_CNT_Msk    (0xff0000UL)              /*!< MDR_CAN1 STATUS: RX_ERR_CNT (Bitfield-Mask: 0xff)     */
#define MDR_CAN1_STATUS_TX_ERR_CNT_Pos    (24UL)                    /*!< MDR_CAN1 STATUS: TX_ERR_CNT (Bit 24)                  */
#define MDR_CAN1_STATUS_TX_ERR_CNT_Msk    (0xff000000UL)            /*!< MDR_CAN1 STATUS: TX_ERR_CNT (Bitfield-Mask: 0xff)     */
/* ========================================================  BITTMNG  ======================================================== */
#define MDR_CAN1_BITTMNG_BRP_Pos          (0UL)                     /*!< MDR_CAN1 BITTMNG: BRP (Bit 0)                         */
#define MDR_CAN1_BITTMNG_BRP_Msk          (0xffffUL)                /*!< MDR_CAN1 BITTMNG: BRP (Bitfield-Mask: 0xffff)         */
#define MDR_CAN1_BITTMNG_PSEG_Pos         (16UL)                    /*!< MDR_CAN1 BITTMNG: PSEG (Bit 16)                       */
#define MDR_CAN1_BITTMNG_PSEG_Msk         (0x70000UL)               /*!< MDR_CAN1 BITTMNG: PSEG (Bitfield-Mask: 0x07)          */
#define MDR_CAN1_BITTMNG_SEG1_Pos         (19UL)                    /*!< MDR_CAN1 BITTMNG: SEG1 (Bit 19)                       */
#define MDR_CAN1_BITTMNG_SEG1_Msk         (0x380000UL)              /*!< MDR_CAN1 BITTMNG: SEG1 (Bitfield-Mask: 0x07)          */
#define MDR_CAN1_BITTMNG_SEG2_Pos         (22UL)                    /*!< MDR_CAN1 BITTMNG: SEG2 (Bit 22)                       */
#define MDR_CAN1_BITTMNG_SEG2_Msk         (0x1c00000UL)             /*!< MDR_CAN1 BITTMNG: SEG2 (Bitfield-Mask: 0x07)          */
#define MDR_CAN1_BITTMNG_SJW_Pos          (25UL)                    /*!< MDR_CAN1 BITTMNG: SJW (Bit 25)                        */
#define MDR_CAN1_BITTMNG_SJW_Msk          (0x6000000UL)             /*!< MDR_CAN1 BITTMNG: SJW (Bitfield-Mask: 0x03)           */
#define MDR_CAN1_BITTMNG_SB_Pos           (27UL)                    /*!< MDR_CAN1 BITTMNG: SB (Bit 27)                         */
#define MDR_CAN1_BITTMNG_SB_Msk           (0x8000000UL)             /*!< MDR_CAN1 BITTMNG: SB (Bitfield-Mask: 0x01)            */
/* ========================================================  INT_EN  ========================================================= */
#define MDR_CAN1_INT_EN_GLB_IntEn_Pos     (0UL)                     /*!< MDR_CAN1 INT_EN: GLB_IntEn (Bit 0)                    */
#define MDR_CAN1_INT_EN_GLB_IntEn_Msk     (0x1UL)                   /*!< MDR_CAN1 INT_EN: GLB_IntEn (Bitfield-Mask: 0x01)      */
#define MDR_CAN1_INT_EN_RX_IntEn_Pos      (1UL)                     /*!< MDR_CAN1 INT_EN: RX_IntEn (Bit 1)                     */
#define MDR_CAN1_INT_EN_RX_IntEn_Msk      (0x2UL)                   /*!< MDR_CAN1 INT_EN: RX_IntEn (Bitfield-Mask: 0x01)       */
#define MDR_CAN1_INT_EN_TX_IntEn_Pos      (2UL)                     /*!< MDR_CAN1 INT_EN: TX_IntEn (Bit 2)                     */
#define MDR_CAN1_INT_EN_TX_IntEn_Msk      (0x4UL)                   /*!< MDR_CAN1 INT_EN: TX_IntEn (Bitfield-Mask: 0x01)       */
#define MDR_CAN1_INT_EN_ERR_IntEn_Pos     (3UL)                     /*!< MDR_CAN1 INT_EN: ERR_IntEn (Bit 3)                    */
#define MDR_CAN1_INT_EN_ERR_IntEn_Msk     (0x8UL)                   /*!< MDR_CAN1 INT_EN: ERR_IntEn (Bitfield-Mask: 0x01)      */
#define MDR_CAN1_INT_EN_ErrOV_IntEn_Pos   (4UL)                     /*!< MDR_CAN1 INT_EN: ErrOV_IntEn (Bit 4)                  */
#define MDR_CAN1_INT_EN_ErrOV_IntEn_Msk   (0x10UL)                  /*!< MDR_CAN1 INT_EN: ErrOV_IntEn (Bitfield-Mask: 0x01)    */
/* =========================================================  OVER  ========================================================== */
#define MDR_CAN1_OVER_ERROR_MAX_Pos       (0UL)                     /*!< MDR_CAN1 OVER: ERROR_MAX (Bit 0)                      */
#define MDR_CAN1_OVER_ERROR_MAX_Msk       (0xffUL)                  /*!< MDR_CAN1 OVER: ERROR_MAX (Bitfield-Mask: 0xff)        */
/* =========================================================  RX_ID  ========================================================= */
#define MDR_CAN1_RX_ID_EID_Pos            (0UL)                     /*!< MDR_CAN1 RX_ID: EID (Bit 0)                           */
#define MDR_CAN1_RX_ID_EID_Msk            (0x3ffffUL)               /*!< MDR_CAN1 RX_ID: EID (Bitfield-Mask: 0x3ffff)          */
#define MDR_CAN1_RX_ID_SID_Pos            (18UL)                    /*!< MDR_CAN1 RX_ID: SID (Bit 18)                          */
#define MDR_CAN1_RX_ID_SID_Msk            (0x1ffc0000UL)            /*!< MDR_CAN1 RX_ID: SID (Bitfield-Mask: 0x7ff)            */
/* ========================================================  RX_DLC  ========================================================= */
#define MDR_CAN1_RX_DLC_DLC_Pos           (0UL)                     /*!< MDR_CAN1 RX_DLC: DLC (Bit 0)                          */
#define MDR_CAN1_RX_DLC_DLC_Msk           (0xfUL)                   /*!< MDR_CAN1 RX_DLC: DLC (Bitfield-Mask: 0x0f)            */
#define MDR_CAN1_RX_DLC_RTR_Pos           (8UL)                     /*!< MDR_CAN1 RX_DLC: RTR (Bit 8)                          */
#define MDR_CAN1_RX_DLC_RTR_Msk           (0x100UL)                 /*!< MDR_CAN1 RX_DLC: RTR (Bitfield-Mask: 0x01)            */
#define MDR_CAN1_RX_DLC_R1_Pos            (9UL)                     /*!< MDR_CAN1 RX_DLC: R1 (Bit 9)                           */
#define MDR_CAN1_RX_DLC_R1_Msk            (0x200UL)                 /*!< MDR_CAN1 RX_DLC: R1 (Bitfield-Mask: 0x01)             */
#define MDR_CAN1_RX_DLC_R0_Pos            (10UL)                    /*!< MDR_CAN1 RX_DLC: R0 (Bit 10)                          */
#define MDR_CAN1_RX_DLC_R0_Msk            (0x400UL)                 /*!< MDR_CAN1 RX_DLC: R0 (Bitfield-Mask: 0x01)             */
#define MDR_CAN1_RX_DLC_SRR_Pos           (11UL)                    /*!< MDR_CAN1 RX_DLC: SRR (Bit 11)                         */
#define MDR_CAN1_RX_DLC_SRR_Msk           (0x800UL)                 /*!< MDR_CAN1 RX_DLC: SRR (Bitfield-Mask: 0x01)            */
#define MDR_CAN1_RX_DLC_IDE_Pos           (12UL)                    /*!< MDR_CAN1 RX_DLC: IDE (Bit 12)                         */
#define MDR_CAN1_RX_DLC_IDE_Msk           (0x1000UL)                /*!< MDR_CAN1 RX_DLC: IDE (Bitfield-Mask: 0x01)            */
/* =======================================================  RX_DATAL  ======================================================== */
#define MDR_CAN1_RX_DATAL_DB0_Pos         (0UL)                     /*!< MDR_CAN1 RX_DATAL: DB0 (Bit 0)                        */
#define MDR_CAN1_RX_DATAL_DB0_Msk         (0xffUL)                  /*!< MDR_CAN1 RX_DATAL: DB0 (Bitfield-Mask: 0xff)          */
#define MDR_CAN1_RX_DATAL_DB1_Pos         (8UL)                     /*!< MDR_CAN1 RX_DATAL: DB1 (Bit 8)                        */
#define MDR_CAN1_RX_DATAL_DB1_Msk         (0xff00UL)                /*!< MDR_CAN1 RX_DATAL: DB1 (Bitfield-Mask: 0xff)          */
#define MDR_CAN1_RX_DATAL_DB2_Pos         (16UL)                    /*!< MDR_CAN1 RX_DATAL: DB2 (Bit 16)                       */
#define MDR_CAN1_RX_DATAL_DB2_Msk         (0xff0000UL)              /*!< MDR_CAN1 RX_DATAL: DB2 (Bitfield-Mask: 0xff)          */
#define MDR_CAN1_RX_DATAL_DB3_Pos         (24UL)                    /*!< MDR_CAN1 RX_DATAL: DB3 (Bit 24)                       */
#define MDR_CAN1_RX_DATAL_DB3_Msk         (0xff000000UL)            /*!< MDR_CAN1 RX_DATAL: DB3 (Bitfield-Mask: 0xff)          */
/* =======================================================  RX_DATAH  ======================================================== */
#define MDR_CAN1_RX_DATAH_DB4_Pos         (0UL)                     /*!< MDR_CAN1 RX_DATAH: DB4 (Bit 0)                        */
#define MDR_CAN1_RX_DATAH_DB4_Msk         (0xffUL)                  /*!< MDR_CAN1 RX_DATAH: DB4 (Bitfield-Mask: 0xff)          */
#define MDR_CAN1_RX_DATAH_DB5_Pos         (8UL)                     /*!< MDR_CAN1 RX_DATAH: DB5 (Bit 8)                        */
#define MDR_CAN1_RX_DATAH_DB5_Msk         (0xff00UL)                /*!< MDR_CAN1 RX_DATAH: DB5 (Bitfield-Mask: 0xff)          */
#define MDR_CAN1_RX_DATAH_DB6_Pos         (16UL)                    /*!< MDR_CAN1 RX_DATAH: DB6 (Bit 16)                       */
#define MDR_CAN1_RX_DATAH_DB6_Msk         (0xff0000UL)              /*!< MDR_CAN1 RX_DATAH: DB6 (Bitfield-Mask: 0xff)          */
#define MDR_CAN1_RX_DATAH_DB7_Pos         (24UL)                    /*!< MDR_CAN1 RX_DATAH: DB7 (Bit 24)                       */
#define MDR_CAN1_RX_DATAH_DB7_Msk         (0xff000000UL)            /*!< MDR_CAN1 RX_DATAH: DB7 (Bitfield-Mask: 0xff)          */
/* =========================================================  TX_ID  ========================================================= */
#define MDR_CAN1_TX_ID_EID_Pos            (0UL)                     /*!< MDR_CAN1 TX_ID: EID (Bit 0)                           */
#define MDR_CAN1_TX_ID_EID_Msk            (0x3ffffUL)               /*!< MDR_CAN1 TX_ID: EID (Bitfield-Mask: 0x3ffff)          */
#define MDR_CAN1_TX_ID_SID_Pos            (18UL)                    /*!< MDR_CAN1 TX_ID: SID (Bit 18)                          */
#define MDR_CAN1_TX_ID_SID_Msk            (0x1ffc0000UL)            /*!< MDR_CAN1 TX_ID: SID (Bitfield-Mask: 0x7ff)            */
/* ========================================================  TX_DLC  ========================================================= */
#define MDR_CAN1_TX_DLC_DLC_Pos           (0UL)                     /*!< MDR_CAN1 TX_DLC: DLC (Bit 0)                          */
#define MDR_CAN1_TX_DLC_DLC_Msk           (0xfUL)                   /*!< MDR_CAN1 TX_DLC: DLC (Bitfield-Mask: 0x0f)            */
#define MDR_CAN1_TX_DLC_RTR_Pos           (8UL)                     /*!< MDR_CAN1 TX_DLC: RTR (Bit 8)                          */
#define MDR_CAN1_TX_DLC_RTR_Msk           (0x100UL)                 /*!< MDR_CAN1 TX_DLC: RTR (Bitfield-Mask: 0x01)            */
#define MDR_CAN1_TX_DLC_R1_Pos            (9UL)                     /*!< MDR_CAN1 TX_DLC: R1 (Bit 9)                           */
#define MDR_CAN1_TX_DLC_R1_Msk            (0x200UL)                 /*!< MDR_CAN1 TX_DLC: R1 (Bitfield-Mask: 0x01)             */
#define MDR_CAN1_TX_DLC_R0_Pos            (10UL)                    /*!< MDR_CAN1 TX_DLC: R0 (Bit 10)                          */
#define MDR_CAN1_TX_DLC_R0_Msk            (0x400UL)                 /*!< MDR_CAN1 TX_DLC: R0 (Bitfield-Mask: 0x01)             */
#define MDR_CAN1_TX_DLC_SRR_Pos           (11UL)                    /*!< MDR_CAN1 TX_DLC: SRR (Bit 11)                         */
#define MDR_CAN1_TX_DLC_SRR_Msk           (0x800UL)                 /*!< MDR_CAN1 TX_DLC: SRR (Bitfield-Mask: 0x01)            */
#define MDR_CAN1_TX_DLC_IDE_Pos           (12UL)                    /*!< MDR_CAN1 TX_DLC: IDE (Bit 12)                         */
#define MDR_CAN1_TX_DLC_IDE_Msk           (0x1000UL)                /*!< MDR_CAN1 TX_DLC: IDE (Bitfield-Mask: 0x01)            */
/* =======================================================  TX_DATAL  ======================================================== */
#define MDR_CAN1_TX_DATAL_DB0_Pos         (0UL)                     /*!< MDR_CAN1 TX_DATAL: DB0 (Bit 0)                        */
#define MDR_CAN1_TX_DATAL_DB0_Msk         (0xffUL)                  /*!< MDR_CAN1 TX_DATAL: DB0 (Bitfield-Mask: 0xff)          */
#define MDR_CAN1_TX_DATAL_DB1_Pos         (8UL)                     /*!< MDR_CAN1 TX_DATAL: DB1 (Bit 8)                        */
#define MDR_CAN1_TX_DATAL_DB1_Msk         (0xff00UL)                /*!< MDR_CAN1 TX_DATAL: DB1 (Bitfield-Mask: 0xff)          */
#define MDR_CAN1_TX_DATAL_DB2_Pos         (16UL)                    /*!< MDR_CAN1 TX_DATAL: DB2 (Bit 16)                       */
#define MDR_CAN1_TX_DATAL_DB2_Msk         (0xff0000UL)              /*!< MDR_CAN1 TX_DATAL: DB2 (Bitfield-Mask: 0xff)          */
#define MDR_CAN1_TX_DATAL_DB3_Pos         (24UL)                    /*!< MDR_CAN1 TX_DATAL: DB3 (Bit 24)                       */
#define MDR_CAN1_TX_DATAL_DB3_Msk         (0xff000000UL)            /*!< MDR_CAN1 TX_DATAL: DB3 (Bitfield-Mask: 0xff)          */
/* =======================================================  TX_DATAH  ======================================================== */
#define MDR_CAN1_TX_DATAH_DB4_Pos         (0UL)                     /*!< MDR_CAN1 TX_DATAH: DB4 (Bit 0)                        */
#define MDR_CAN1_TX_DATAH_DB4_Msk         (0xffUL)                  /*!< MDR_CAN1 TX_DATAH: DB4 (Bitfield-Mask: 0xff)          */
#define MDR_CAN1_TX_DATAH_DB5_Pos         (8UL)                     /*!< MDR_CAN1 TX_DATAH: DB5 (Bit 8)                        */
#define MDR_CAN1_TX_DATAH_DB5_Msk         (0xff00UL)                /*!< MDR_CAN1 TX_DATAH: DB5 (Bitfield-Mask: 0xff)          */
#define MDR_CAN1_TX_DATAH_DB6_Pos         (16UL)                    /*!< MDR_CAN1 TX_DATAH: DB6 (Bit 16)                       */
#define MDR_CAN1_TX_DATAH_DB6_Msk         (0xff0000UL)              /*!< MDR_CAN1 TX_DATAH: DB6 (Bitfield-Mask: 0xff)          */
#define MDR_CAN1_TX_DATAH_DB7_Pos         (24UL)                    /*!< MDR_CAN1 TX_DATAH: DB7 (Bit 24)                       */
#define MDR_CAN1_TX_DATAH_DB7_Msk         (0xff000000UL)            /*!< MDR_CAN1 TX_DATAH: DB7 (Bitfield-Mask: 0xff)          */
/* ========================================================  BUF_CON  ======================================================== */
#define MDR_CAN1_BUF_CON_EN_Pos           (0UL)                     /*!< MDR_CAN1 BUF_CON: EN (Bit 0)                          */
#define MDR_CAN1_BUF_CON_EN_Msk           (0x1UL)                   /*!< MDR_CAN1 BUF_CON: EN (Bitfield-Mask: 0x01)            */
#define MDR_CAN1_BUF_CON_RX_TX_Pos        (1UL)                     /*!< MDR_CAN1 BUF_CON: RX_TX (Bit 1)                       */
#define MDR_CAN1_BUF_CON_RX_TX_Msk        (0x2UL)                   /*!< MDR_CAN1 BUF_CON: RX_TX (Bitfield-Mask: 0x01)         */
#define MDR_CAN1_BUF_CON_OVER_EN_Pos      (2UL)                     /*!< MDR_CAN1 BUF_CON: OVER_EN (Bit 2)                     */
#define MDR_CAN1_BUF_CON_OVER_EN_Msk      (0x4UL)                   /*!< MDR_CAN1 BUF_CON: OVER_EN (Bitfield-Mask: 0x01)       */
#define MDR_CAN1_BUF_CON_RTR_EN_Pos       (3UL)                     /*!< MDR_CAN1 BUF_CON: RTR_EN (Bit 3)                      */
#define MDR_CAN1_BUF_CON_RTR_EN_Msk       (0x8UL)                   /*!< MDR_CAN1 BUF_CON: RTR_EN (Bitfield-Mask: 0x01)        */
#define MDR_CAN1_BUF_CON_PRIOR_OFF_Pos    (4UL)                     /*!< MDR_CAN1 BUF_CON: PRIOR_OFF (Bit 4)                   */
#define MDR_CAN1_BUF_CON_PRIOR_OFF_Msk    (0x10UL)                  /*!< MDR_CAN1 BUF_CON: PRIOR_OFF (Bitfield-Mask: 0x01)     */
#define MDR_CAN1_BUF_CON_TX_REQ_Pos       (5UL)                     /*!< MDR_CAN1 BUF_CON: TX_REQ (Bit 5)                      */
#define MDR_CAN1_BUF_CON_TX_REQ_Msk       (0x20UL)                  /*!< MDR_CAN1 BUF_CON: TX_REQ (Bitfield-Mask: 0x01)        */
#define MDR_CAN1_BUF_CON_RX_FULL_Pos      (6UL)                     /*!< MDR_CAN1 BUF_CON: RX_FULL (Bit 6)                     */
#define MDR_CAN1_BUF_CON_RX_FULL_Msk      (0x40UL)                  /*!< MDR_CAN1 BUF_CON: RX_FULL (Bitfield-Mask: 0x01)       */
#define MDR_CAN1_BUF_CON_OVER_WR_Pos      (7UL)                     /*!< MDR_CAN1 BUF_CON: OVER_WR (Bit 7)                     */
#define MDR_CAN1_BUF_CON_OVER_WR_Msk      (0x80UL)                  /*!< MDR_CAN1 BUF_CON: OVER_WR (Bitfield-Mask: 0x01)       */
/* ========================================================  INT_RX  ========================================================= */
#define MDR_CAN1_INT_RX_RX_IRQ_En_Pos     (0UL)                     /*!< MDR_CAN1 INT_RX: RX_IRQ_En (Bit 0)                    */
#define MDR_CAN1_INT_RX_RX_IRQ_En_Msk     (0x1UL)                   /*!< MDR_CAN1 INT_RX: RX_IRQ_En (Bitfield-Mask: 0x01)      */
/* ==========================================================  RX  =========================================================== */
#define MDR_CAN1_RX_RX_FULL_Pos           (0UL)                     /*!< MDR_CAN1 RX: RX_FULL (Bit 0)                          */
#define MDR_CAN1_RX_RX_FULL_Msk           (0x1UL)                   /*!< MDR_CAN1 RX: RX_FULL (Bitfield-Mask: 0x01)            */
/* ========================================================  INT_TX  ========================================================= */
#define MDR_CAN1_INT_TX_TX_IRQ_En_Pos     (0UL)                     /*!< MDR_CAN1 INT_TX: TX_IRQ_En (Bit 0)                    */
#define MDR_CAN1_INT_TX_TX_IRQ_En_Msk     (0x1UL)                   /*!< MDR_CAN1 INT_TX: TX_IRQ_En (Bitfield-Mask: 0x01)      */
/* ==========================================================  TX  =========================================================== */
#define MDR_CAN1_TX_TX_nReq_Pos           (0UL)                     /*!< MDR_CAN1 TX: TX_nReq (Bit 0)                          */
#define MDR_CAN1_TX_TX_nReq_Msk           (0x1UL)                   /*!< MDR_CAN1 TX: TX_nReq (Bitfield-Mask: 0x01)            */


/* =========================================================================================================================== */
/* ================                                         MDR_UART1                                         ================ */
/* =========================================================================================================================== */

