StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
/* ==========================================================  DR  =========================================================== */
#define MDR_UART1_DR_DATA_Pos             (0UL)                     /*!< MDR_UART1 DR: DATA (Bit 0)                            */
#define MDR_UART1_DR_DATA_Msk             (0xffUL)                  /*!< MDR_UART1 DR: DATA (Bitfield-Mask: 0xff)              */
#define MDR_UART1_DR_FE_Pos               (8UL)                     /*!< MDR_UART1 DR: FE (Bit 8)                              */
#define MDR_UART1_DR_FE_Msk               (0x100UL)                 /*!< MDR_UART1 DR: FE (Bitfield-Mask: 0x01)                */
#define MDR_UART1_DR_PE_Pos               (9UL)                     /*!< MDR_UART1 DR: PE (Bit 9)                              */
#define MDR_UART1_DR_PE_Msk               (0x200UL)                 /*!< MDR_UART1 DR: PE (Bitfield-Mask: 0x01)                */
#define MDR_UART1_DR_BE_Pos               (10UL)                    /*!< MDR_UART1 DR: BE (Bit 10)                             */
#define MDR_UART1_DR_BE_Msk               (0x400UL)                 /*!< MDR_UART1 DR: BE (Bitfield-Mask: 0x01)                */
#define MDR_UART1_DR_OE_Pos               (11UL)                    /*!< MDR_UART1 DR: OE (Bit 11)                             */
#define MDR_UART1_DR_OE_Msk               (0x800UL)                 /*!< MDR_UART1 DR: OE (Bitfield-Mask: 0x01)                */
/* ========================================================  RSR_ECR  ======================================================== */
#define MDR_UART1_RSR_ECR_FE_Pos          (0UL)                     /*!< MDR_UART1 RSR_ECR: FE (Bit 0)                         */
#define MDR_UART1_RSR_ECR_FE_Msk          (0x1UL)                   /*!< MDR_UART1 RSR_ECR: FE (Bitfield-Mask: 0x01)           */
#define MDR_UART1_RSR_ECR_PE_Pos          (1UL)                     /*!< MDR_UART1 RSR_ECR: PE (Bit 1)                         */
#define MDR_UART1_RSR_ECR_PE_Msk          (0x2UL)                   /*!< MDR_UART1 RSR_ECR: PE (Bitfield-Mask: 0x01)           */
#define MDR_UART1_RSR_ECR_BE_Pos          (2UL)                     /*!< MDR_UART1 RSR_ECR: BE (Bit 2)                         */
#define MDR_UART1_RSR_ECR_BE_Msk          (0x4UL)                   /*!< MDR_UART1 RSR_ECR: BE (Bitfield-Mask: 0x01)           */
#define MDR_UART1_RSR_ECR_OE_Pos          (3UL)                     /*!< MDR_UART1 RSR_ECR: OE (Bit 3)                         */
#define MDR_UART1_RSR_ECR_OE_Msk          (0x8UL)                   /*!< MDR_UART1 RSR_ECR: OE (Bitfield-Mask: 0x01)           */
/* ==========================================================  FR  =========================================================== */
#define MDR_UART1_FR_CTS_Pos              (0UL)                     /*!< MDR_UART1 FR: CTS (Bit 0)                             */
#define MDR_UART1_FR_CTS_Msk              (0x1UL)                   /*!< MDR_UART1 FR: CTS (Bitfield-Mask: 0x01)               */
#define MDR_UART1_FR_DSR_Pos              (1UL)                     /*!< MDR_UART1 FR: DSR (Bit 1)                             */
#define MDR_UART1_FR_DSR_Msk              (0x2UL)                   /*!< MDR_UART1 FR: DSR (Bitfield-Mask: 0x01)               */
#define MDR_UART1_FR_DCD_Pos              (2UL)                     /*!< MDR_UART1 FR: DCD (Bit 2)                             */
#define MDR_UART1_FR_DCD_Msk              (0x4UL)                   /*!< MDR_UART1 FR: DCD (Bitfield-Mask: 0x01)               */
#define MDR_UART1_FR_BUSY_Pos             (3UL)                     /*!< MDR_UART1 FR: BUSY (Bit 3)                            */
#define MDR_UART1_FR_BUSY_Msk             (0x8UL)                   /*!< MDR_UART1 FR: BUSY (Bitfield-Mask: 0x01)              */
#define MDR_UART1_FR_RXFE_Pos             (4UL)                     /*!< MDR_UART1 FR: RXFE (Bit 4)                            */
#define MDR_UART1_FR_RXFE_Msk             (0x10UL)                  /*!< MDR_UART1 FR: RXFE (Bitfield-Mask: 0x01)              */
#define MDR_UART1_FR_TXFF_Pos             (5UL)                     /*!< MDR_UART1 FR: TXFF (Bit 5)                            */
#define MDR_UART1_FR_TXFF_Msk             (0x20UL)                  /*!< MDR_UART1 FR: TXFF (Bitfield-Mask: 0x01)              */
#define MDR_UART1_FR_RXFF_Pos             (6UL)                     /*!< MDR_UART1 FR: RXFF (Bit 6)                            */
#define MDR_UART1_FR_RXFF_Msk             (0x40UL)                  /*!< MDR_UART1 FR: RXFF (Bitfield-Mask: 0x01)              */
#define MDR_UART1_FR_TXFE_Pos             (7UL)                     /*!< MDR_UART1 FR: TXFE (Bit 7)                            */
#define MDR_UART1_FR_TXFE_Msk             (0x80UL)                  /*!< MDR_UART1 FR: TXFE (Bitfield-Mask: 0x01)              */
#define MDR_UART1_FR_RI_Pos               (8UL)                     /*!< MDR_UART1 FR: RI (Bit 8)                              */
#define MDR_UART1_FR_RI_Msk               (0x100UL)                 /*!< MDR_UART1 FR: RI (Bitfield-Mask: 0x01)                */
/* =========================================================  ILPR  ========================================================== */
#define MDR_UART1_ILPR_DVSR_Pos           (0UL)                     /*!< MDR_UART1 ILPR: DVSR (Bit 0)                          */
#define MDR_UART1_ILPR_DVSR_Msk           (0xffUL)                  /*!< MDR_UART1 ILPR: DVSR (Bitfield-Mask: 0xff)            */
/* =========================================================  IBRD  ========================================================== */
#define MDR_UART1_IBRD_Baud_DivInt_Pos    (0UL)                     /*!< MDR_UART1 IBRD: Baud_DivInt (Bit 0)                   */
#define MDR_UART1_IBRD_Baud_DivInt_Msk    (0xffffUL)                /*!< MDR_UART1 IBRD: Baud_DivInt (Bitfield-Mask: 0xffff)   */
/* =========================================================  FBRD  ========================================================== */
#define MDR_UART1_FBRD_Baud_DivFrac_Pos   (0UL)                     /*!< MDR_UART1 FBRD: Baud_DivFrac (Bit 0)                  */
#define MDR_UART1_FBRD_Baud_DivFrac_Msk   (0x3fUL)                  /*!< MDR_UART1 FBRD: Baud_DivFrac (Bitfield-Mask: 0x3f)    */
/* =========================================================  LCR_H  ========================================================= */
#define MDR_UART1_LCR_H_BRK_Pos           (0UL)                     /*!< MDR_UART1 LCR_H: BRK (Bit 0)                          */
#define MDR_UART1_LCR_H_BRK_Msk           (0x1UL)                   /*!< MDR_UART1 LCR_H: BRK (Bitfield-Mask: 0x01)            */
#define MDR_UART1_LCR_H_PEN_Pos           (1UL)                     /*!< MDR_UART1 LCR_H: PEN (Bit 1)                          */
#define MDR_UART1_LCR_H_PEN_Msk           (0x2UL)                   /*!< MDR_UART1 LCR_H: PEN (Bitfield-Mask: 0x01)            */
#define MDR_UART1_LCR_H_EPS_Pos           (2UL)                     /*!< MDR_UART1 LCR_H: EPS (Bit 2)                          */
#define MDR_UART1_LCR_H_EPS_Msk           (0x4UL)                   /*!< MDR_UART1 LCR_H: EPS (Bitfield-Mask: 0x01)            */
#define MDR_UART1_LCR_H_STP2_Pos          (3UL)                     /*!< MDR_UART1 LCR_H: STP2 (Bit 3)                         */
#define MDR_UART1_LCR_H_STP2_Msk          (0x8UL)                   /*!< MDR_UART1 LCR_H: STP2 (Bitfield-Mask: 0x01)           */
#define MDR_UART1_LCR_H_FEN_Pos           (4UL)                     /*!< MDR_UART1 LCR_H: FEN (Bit 4)                          */
#define MDR_UART1_LCR_H_FEN_Msk           (0x10UL)                  /*!< MDR_UART1 LCR_H: FEN (Bitfield-Mask: 0x01)            */
#define MDR_UART1_LCR_H_WLEN_Pos          (5UL)                     /*!< MDR_UART1 LCR_H: WLEN (Bit 5)                         */
#define MDR_UART1_LCR_H_WLEN_Msk          (0x60UL)                  /*!< MDR_UART1 LCR_H: WLEN (Bitfield-Mask: 0x03)           */
#define MDR_UART1_LCR_H_SPS_Pos           (7UL)                     /*!< MDR_UART1 LCR_H: SPS (Bit 7)                          */
#define MDR_UART1_LCR_H_SPS_Msk           (0x80UL)                  /*!< MDR_UART1 LCR_H: SPS (Bitfield-Mask: 0x01)            */
/* ==========================================================  CR  =========================================================== */
#define MDR_UART1_CR_EN_Pos               (0UL)                     /*!< MDR_UART1 CR: EN (Bit 0)                              */
#define MDR_UART1_CR_EN_Msk               (0x1UL)                   /*!< MDR_UART1 CR: EN (Bitfield-Mask: 0x01)                */
#define MDR_UART1_CR_SIREN_Pos            (1UL)                     /*!< MDR_UART1 CR: SIREN (Bit 1)                           */
#define MDR_UART1_CR_SIREN_Msk            (0x2UL)                   /*!< MDR_UART1 CR: SIREN (Bitfield-Mask: 0x01)             */
#define MDR_UART1_CR_SIRLP_Pos            (2UL)                     /*!< MDR_UART1 CR: SIRLP (Bit 2)                           */
#define MDR_UART1_CR_SIRLP_Msk            (0x4UL)                   /*!< MDR_UART1 CR: SIRLP (Bitfield-Mask: 0x01)             */
#define MDR_UART1_CR_LBE_Pos              (7UL)                     /*!< MDR_UART1 CR: LBE (Bit 7)                             */
#define MDR_UART1_CR_LBE_Msk              (0x80UL)                  /*!< MDR_UART1 CR: LBE (Bitfield-Mask: 0x01)               */
#define MDR_UART1_CR_TXE_Pos              (8UL)                     /*!< MDR_UART1 CR: TXE (Bit 8)                             */
#define MDR_UART1_CR_TXE_Msk              (0x100UL)                 /*!< MDR_UART1 CR: TXE (Bitfield-Mask: 0x01)               */
#define MDR_UART1_CR_RXE_Pos              (9UL)                     /*!< MDR_UART1 CR: RXE (Bit 9)                             */
#define MDR_UART1_CR_RXE_Msk              (0x200UL)                 /*!< MDR_UART1 CR: RXE (Bitfield-Mask: 0x01)               */
#define MDR_UART1_CR_DTR_Pos              (10UL)                    /*!< MDR_UART1 CR: DTR (Bit 10)                            */
#define MDR_UART1_CR_DTR_Msk              (0x400UL)                 /*!< MDR_UART1 CR: DTR (Bitfield-Mask: 0x01)               */
#define MDR_UART1_CR_RTS_Pos              (11UL)                    /*!< MDR_UART1 CR: RTS (Bit 11)                            */
#define MDR_UART1_CR_RTS_Msk              (0x800UL)                 /*!< MDR_UART1 CR: RTS (Bitfield-Mask: 0x01)               */
#define MDR_UART1_CR_Out1_Pos             (12UL)                    /*!< MDR_UART1 CR: Out1 (Bit 12)                           */
#define MDR_UART1_CR_Out1_Msk             (0x1000UL)                /*!< MDR_UART1 CR: Out1 (Bitfield-Mask: 0x01)              */
#define MDR_UART1_CR_Out2_Pos             (13UL)                    /*!< MDR_UART1 CR: Out2 (Bit 13)                           */
#define MDR_UART1_CR_Out2_Msk             (0x2000UL)                /*!< MDR_UART1 CR: Out2 (Bitfield-Mask: 0x01)              */
#define MDR_UART1_CR_RTSEn_Pos            (14UL)                    /*!< MDR_UART1 CR: RTSEn (Bit 14)                          */
#define MDR_UART1_CR_RTSEn_Msk            (0x4000UL)                /*!< MDR_UART1 CR: RTSEn (Bitfield-Mask: 0x01)             */
#define MDR_UART1_CR_CTSEn_Pos            (15UL)                    /*!< MDR_UART1 CR: CTSEn (Bit 15)                          */
#define MDR_UART1_CR_CTSEn_Msk            (0x8000UL)                /*!< MDR_UART1 CR: CTSEn (Bitfield-Mask: 0x01)             */
/* =========================================================  IFLS  ========================================================== */
#define MDR_UART1_IFLS_TXIFLSES_Pos       (0UL)                     /*!< MDR_UART1 IFLS: TXIFLSES (Bit 0)                      */
#define MDR_UART1_IFLS_TXIFLSES_Msk       (0x7UL)                   /*!< MDR_UART1 IFLS: TXIFLSES (Bitfield-Mask: 0x07)        */
#define MDR_UART1_IFLS_RXIFLSES_Pos       (3UL)                     /*!< MDR_UART1 IFLS: RXIFLSES (Bit 3)                      */
#define MDR_UART1_IFLS_RXIFLSES_Msk       (0x38UL)                  /*!< MDR_UART1 IFLS: RXIFLSES (Bitfield-Mask: 0x07)        */
/* =========================================================  IMSC  ========================================================== */
#define MDR_UART1_IMSC_RIM_IM_Pos         (0UL)                     /*!< MDR_UART1 IMSC: RIM_IM (Bit 0)                        */
#define MDR_UART1_IMSC_RIM_IM_Msk         (0x1UL)                   /*!< MDR_UART1 IMSC: RIM_IM (Bitfield-Mask: 0x01)          */
#define MDR_UART1_IMSC_STCM_IM_Pos        (1UL)                     /*!< MDR_UART1 IMSC: STCM_IM (Bit 1)                       */
#define MDR_UART1_IMSC_STCM_IM_Msk        (0x2UL)                   /*!< MDR_UART1 IMSC: STCM_IM (Bitfield-Mask: 0x01)         */
#define MDR_UART1_IMSC_DCDM_IM_Pos        (2UL)                     /*!< MDR_UART1 IMSC: DCDM_IM (Bit 2)                       */
#define MDR_UART1_IMSC_DCDM_IM_Msk        (0x4UL)                   /*!< MDR_UART1 IMSC: DCDM_IM (Bitfield-Mask: 0x01)         */
#define MDR_UART1_IMSC_DSRM_IM_Pos        (3UL)                     /*!< MDR_UART1 IMSC: DSRM_IM (Bit 3)                       */
#define MDR_UART1_IMSC_DSRM_IM_Msk        (0x8UL)                   /*!< MDR_UART1 IMSC: DSRM_IM (Bitfield-Mask: 0x01)         */
#define MDR_UART1_IMSC_RX_IM_Pos          (4UL)                     /*!< MDR_UART1 IMSC: RX_IM (Bit 4)                         */
#define MDR_UART1_IMSC_RX_IM_Msk          (0x10UL)                  /*!< MDR_UART1 IMSC: RX_IM (Bitfield-Mask: 0x01)           */
#define MDR_UART1_IMSC_TX_IM_Pos          (5UL)                     /*!< MDR_UART1 IMSC: TX_IM (Bit 5)                         */
#define MDR_UART1_IMSC_TX_IM_Msk          (0x20UL)                  /*!< MDR_UART1 IMSC: TX_IM (Bitfield-Mask: 0x01)           */
#define MDR_UART1_IMSC_RT_IM_Pos          (6UL)                     /*!< MDR_UART1 IMSC: RT_IM (Bit 6)                         */
#define MDR_UART1_IMSC_RT_IM_Msk          (0x40UL)                  /*!< MDR_UART1 IMSC: RT_IM (Bitfield-Mask: 0x01)           */
#define MDR_UART1_IMSC_FE_IM_Pos          (7UL)                     /*!< MDR_UART1 IMSC: FE_IM (Bit 7)                         */
#define MDR_UART1_IMSC_FE_IM_Msk          (0x80UL)                  /*!< MDR_UART1 IMSC: FE_IM (Bitfield-Mask: 0x01)           */
#define MDR_UART1_IMSC_PE_IM_Pos          (8UL)                     /*!< MDR_UART1 IMSC: PE_IM (Bit 8)                         */
#define MDR_UART1_IMSC_PE_IM_Msk          (0x100UL)                 /*!< MDR_UART1 IMSC: PE_IM (Bitfield-Mask: 0x01)           */
#define MDR_UART1_IMSC_BE_IM_Pos          (9UL)                     /*!< MDR_UART1 IMSC: BE_IM (Bit 9)                         */
#define MDR_UART1_IMSC_BE_IM_Msk          (0x200UL)                 /*!< MDR_UART1 IMSC: BE_IM (Bitfield-Mask: 0x01)           */
#define MDR_UART1_IMSC_OE_IM_Pos          (10UL)                    /*!< MDR_UART1 IMSC: OE_IM (Bit 10)                        */
#define MDR_UART1_IMSC_OE_IM_Msk          (0x400UL)                 /*!< MDR_UART1 IMSC: OE_IM (Bitfield-Mask: 0x01)           */
/* ==========================================================  RIS  ========================================================== */
#define MDR_UART1_RIS_RIM_RIS_Pos         (0UL)                     /*!< MDR_UART1 RIS: RIM_RIS (Bit 0)                        */
#define MDR_UART1_RIS_RIM_RIS_Msk         (0x1UL)                   /*!< MDR_UART1 RIS: RIM_RIS (Bitfield-Mask: 0x01)          */
#define MDR_UART1_RIS_STCM_RIS_Pos        (1UL)                     /*!< MDR_UART1 RIS: STCM_RIS (Bit 1)                       */
#define MDR_UART1_RIS_STCM_RIS_Msk        (0x2UL)                   /*!< MDR_UART1 RIS: STCM_RIS (Bitfield-Mask: 0x01)         */
#define MDR_UART1_RIS_DCDM_RIS_Pos        (2UL)                     /*!< MDR_UART1 RIS: DCDM_RIS (Bit 2)                       */
#define MDR_UART1_RIS_DCDM_RIS_Msk        (0x4UL)                   /*!< MDR_UART1 RIS: DCDM_RIS (Bitfield-Mask: 0x01)         */
#define MDR_UART1_RIS_DSRM_RIS_Pos        (3UL)                     /*!< MDR_UART1 RIS: DSRM_RIS (Bit 3)                       */
#define MDR_UART1_RIS_DSRM_RIS_Msk        (0x8UL)                   /*!< MDR_UART1 RIS: DSRM_RIS (Bitfield-Mask: 0x01)         */
#define MDR_UART1_RIS_RX_RIS_Pos          (4UL)                     /*!< MDR_UART1 RIS: RX_RIS (Bit 4)                         */
#define MDR_UART1_RIS_RX_RIS_Msk          (0x10UL)                  /*!< MDR_UART1 RIS: RX_RIS (Bitfield-Mask: 0x01)           */
#define MDR_UART1_RIS_TX_RIS_Pos          (5UL)                     /*!< MDR_UART1 RIS: TX_RIS (Bit 5)                         */
#define MDR_UART1_RIS_TX_RIS_Msk          (0x20UL)                  /*!< MDR_UART1 RIS: TX_RIS (Bitfield-Mask: 0x01)           */
#define MDR_UART1_RIS_RT_RIS_Pos          (6UL)                     /*!< MDR_UART1 RIS: RT_RIS (Bit 6)                         */
#define MDR_UART1_RIS_RT_RIS_Msk          (0x40UL)                  /*!< MDR_UART1 RIS: RT_RIS (Bitfield-Mask: 0x01)           */
#define MDR_UART1_RIS_FE_RIS_Pos          (7UL)                     /*!< MDR_UART1 RIS: FE_RIS (Bit 7)                         */
#define MDR_UART1_RIS_FE_RIS_Msk          (0x80UL)                  /*!< MDR_UART1 RIS: FE_RIS (Bitfield-Mask: 0x01)           */
#define MDR_UART1_RIS_PE_RIS_Pos          (8UL)                     /*!< MDR_UART1 RIS: PE_RIS (Bit 8)                         */
#define MDR_UART1_RIS_PE_RIS_Msk          (0x100UL)                 /*!< MDR_UART1 RIS: PE_RIS (Bitfield-Mask: 0x01)           */
#define MDR_UART1_RIS_BE_RIS_Pos          (9UL)                     /*!< MDR_UART1 RIS: BE_RIS (Bit 9)                         */
#define MDR_UART1_RIS_BE_RIS_Msk          (0x200UL)                 /*!< MDR_UART1 RIS: BE_RIS (Bitfield-Mask: 0x01)           */
#define MDR_UART1_RIS_OE_RIS_Pos          (10UL)                    /*!< MDR_UART1 RIS: OE_RIS (Bit 10)                        */
#define MDR_UART1_RIS_OE_RIS_Msk          (0x400UL)                 /*!< MDR_UART1 RIS: OE_RIS (Bitfield-Mask: 0x01)           */
/* ==========================================================  MIS  ========================================================== */
#define MDR_UART1_MIS_RIM_MIS_Pos         (0UL)                     /*!< MDR_UART1 MIS: RIM_MIS (Bit 0)                        */
#define MDR_UART1_MIS_RIM_MIS_Msk         (0x1UL)                   /*!< MDR_UART1 MIS: RIM_MIS (Bitfield-Mask: 0x01)          */
#define MDR_UART1_MIS_STCM_MIS_Pos        (1UL)                     /*!< MDR_UART1 MIS: STCM_MIS (Bit 1)                       */
#define MDR_UART1_MIS_STCM_MIS_Msk        (0x2UL)                   /*!< MDR_UART1 MIS: STCM_MIS (Bitfield-Mask: 0x01)         */
#define MDR_UART1_MIS_DCDM_MIS_Pos        (2UL)                     /*!< MDR_UART1 MIS: DCDM_MIS (Bit 2)                       */
#define MDR_UART1_MIS_DCDM_MIS_Msk        (0x4UL)                   /*!< MDR_UART1 MIS: DCDM_MIS (Bitfield-Mask: 0x01)         */
#define MDR_UART1_MIS_DSRM_MIS_Pos        (3UL)                     /*!< MDR_UART1 MIS: DSRM_MIS (Bit 3)                       */
#define MDR_UART1_MIS_DSRM_MIS_Msk        (0x8UL)                   /*!< MDR_UART1 MIS: DSRM_MIS (Bitfield-Mask: 0x01)         */
#define MDR_UART1_MIS_RX_MIS_Pos          (4UL)                     /*!< MDR_UART1 MIS: RX_MIS (Bit 4)                         */
#define MDR_UART1_MIS_RX_MIS_Msk          (0x10UL)                  /*!< MDR_UART1 MIS: RX_MIS (Bitfield-Mask: 0x01)           */
#define MDR_UART1_MIS_TX_MIS_Pos          (5UL)                     /*!< MDR_UART1 MIS: TX_MIS (Bit 5)                         */
#define MDR_UART1_MIS_TX_MIS_Msk          (0x20UL)                  /*!< MDR_UART1 MIS: TX_MIS (Bitfield-Mask: 0x01)           */
#define MDR_UART1_MIS_RT_MIS_Pos          (6UL)                     /*!< MDR_UART1 MIS: RT_MIS (Bit 6)                         */
#define MDR_UART1_MIS_RT_MIS_Msk          (0x40UL)                  /*!< MDR_UART1 MIS: RT_MIS (Bitfield-Mask: 0x01)           */
#define MDR_UART1_MIS_FE_MIS_Pos          (7UL)                     /*!< MDR_UART1 MIS: FE_MIS (Bit 7)                         */
#define MDR_UART1_MIS_FE_MIS_Msk          (0x80UL)                  /*!< MDR_UART1 MIS: FE_MIS (Bitfield-Mask: 0x01)           */
#define MDR_UART1_MIS_PE_MIS_Pos          (8UL)                     /*!< MDR_UART1 MIS: PE_MIS (Bit 8)                         */
#define MDR_UART1_MIS_PE_MIS_Msk          (0x100UL)                 /*!< MDR_UART1 MIS: PE_MIS (Bitfield-Mask: 0x01)           */
#define MDR_UART1_MIS_BE_MIS_Pos          (9UL)                     /*!< MDR_UART1 MIS: BE_MIS (Bit 9)                         */
#define MDR_UART1_MIS_BE_MIS_Msk          (0x200UL)                 /*!< MDR_UART1 MIS: BE_MIS (Bitfield-Mask: 0x01)           */
#define MDR_UART1_MIS_OE_MIS_Pos          (10UL)                    /*!< MDR_UART1 MIS: OE_MIS (Bit 10)                        */
#define MDR_UART1_MIS_OE_MIS_Msk          (0x400UL)                 /*!< MDR_UART1 MIS: OE_MIS (Bitfield-Mask: 0x01)           */
/* ==========================================================  ICR  ========================================================== */
#define MDR_UART1_ICR_RIM_IC_Pos          (0UL)                     /*!< MDR_UART1 ICR: RIM_IC (Bit 0)                         */
#define MDR_UART1_ICR_RIM_IC_Msk          (0x1UL)                   /*!< MDR_UART1 ICR: RIM_IC (Bitfield-Mask: 0x01)           */
#define MDR_UART1_ICR_STCM_IC_Pos         (1UL)                     /*!< MDR_UART1 ICR: STCM_IC (Bit 1)                        */
#define MDR_UART1_ICR_STCM_IC_Msk         (0x2UL)                   /*!< MDR_UART1 ICR: STCM_IC (Bitfield-Mask: 0x01)          */
#define MDR_UART1_ICR_DCDM_IC_Pos         (2UL)                     /*!< MDR_UART1 ICR: DCDM_IC (Bit 2)                        */
#define MDR_UART1_ICR_DCDM_IC_Msk         (0x4UL)                   /*!< MDR_UART1 ICR: DCDM_IC (Bitfield-Mask: 0x01)          */
#define MDR_UART1_ICR_DSRM_IC_Pos         (3UL)                     /*!< MDR_UART1 ICR: DSRM_IC (Bit 3)                        */
#define MDR_UART1_ICR_DSRM_IC_Msk         (0x8UL)                   /*!< MDR_UART1 ICR: DSRM_IC (Bitfield-Mask: 0x01)          */
#define MDR_UART1_ICR_RX_IC_Pos           (4UL)                     /*!< MDR_UART1 ICR: RX_IC (Bit 4)                          */
#define MDR_UART1_ICR_RX_IC_Msk           (0x10UL)                  /*!< MDR_UART1 ICR: RX_IC (Bitfield-Mask: 0x01)            */
#define MDR_UART1_ICR_TX_IC_Pos           (5UL)                     /*!< MDR_UART1 ICR: TX_IC (Bit 5)                          */
#define MDR_UART1_ICR_TX_IC_Msk           (0x20UL)                  /*!< MDR_UART1 ICR: TX_IC (Bitfield-Mask: 0x01)            */
#define MDR_UART1_ICR_RT_IC_Pos           (6UL)                     /*!< MDR_UART1 ICR: RT_IC (Bit 6)                          */
#define MDR_UART1_ICR_RT_IC_Msk           (0x40UL)                  /*!< MDR_UART1 ICR: RT_IC (Bitfield-Mask: 0x01)            */
#define MDR_UART1_ICR_FE_IC_Pos           (7UL)                     /*!< MDR_UART1 ICR: FE_IC (Bit 7)                          */
#define MDR_UART1_ICR_FE_IC_Msk           (0x80UL)                  /*!< MDR_UART1 ICR: FE_IC (Bitfield-Mask: 0x01)            */
#define MDR_UART1_ICR_PE_IC_Pos           (8UL)                     /*!< MDR_UART1 ICR: PE_IC (Bit 8)                          */
#define MDR_UART1_ICR_PE_IC_Msk           (0x100UL)                 /*!< MDR_UART1 ICR: PE_IC (Bitfield-Mask: 0x01)            */
#define MDR_UART1_ICR_BE_IC_Pos           (9UL)                     /*!< MDR_UART1 ICR: BE_IC (Bit 9)                          */
#define MDR_UART1_ICR_BE_IC_Msk           (0x200UL)                 /*!< MDR_UART1 ICR: BE_IC (Bitfield-Mask: 0x01)            */
#define MDR_UART1_ICR_OE_IC_Pos           (10UL)                    /*!< MDR_UART1 ICR: OE_IC (Bit 10)                         */
