StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
#define MDR_UART1_ICR_OE_IC_Msk           (0x400UL)                 /*!< MDR_UART1 ICR: OE_IC (Bitfield-Mask: 0x01)            */
/* =========================================================  DMACR  ========================================================= */
#define MDR_UART1_DMACR_RXDMAE_Pos        (0UL)                     /*!< MDR_UART1 DMACR: RXDMAE (Bit 0)                       */
#define MDR_UART1_DMACR_RXDMAE_Msk        (0x1UL)                   /*!< MDR_UART1 DMACR: RXDMAE (Bitfield-Mask: 0x01)         */
#define MDR_UART1_DMACR_TXDMAE_Pos        (1UL)                     /*!< MDR_UART1 DMACR: TXDMAE (Bit 1)                       */
#define MDR_UART1_DMACR_TXDMAE_Msk        (0x2UL)                   /*!< MDR_UART1 DMACR: TXDMAE (Bitfield-Mask: 0x01)         */
#define MDR_UART1_DMACR_DMAonErr_Pos      (2UL)                     /*!< MDR_UART1 DMACR: DMAonErr (Bit 2)                     */
#define MDR_UART1_DMACR_DMAonErr_Msk      (0x4UL)                   /*!< MDR_UART1 DMACR: DMAonErr (Bitfield-Mask: 0x01)       */
/* ==========================================================  TCR  ========================================================== */
#define MDR_UART1_TCR_ITEN_Pos            (0UL)                     /*!< MDR_UART1 TCR: ITEN (Bit 0)                           */
#define MDR_UART1_TCR_ITEN_Msk            (0x1UL)                   /*!< MDR_UART1 TCR: ITEN (Bitfield-Mask: 0x01)             */
#define MDR_UART1_TCR_TestFIFO_Pos        (1UL)                     /*!< MDR_UART1 TCR: TestFIFO (Bit 1)                       */
#define MDR_UART1_TCR_TestFIFO_Msk        (0x2UL)                   /*!< MDR_UART1 TCR: TestFIFO (Bitfield-Mask: 0x01)         */
#define MDR_UART1_TCR_SIRTest_Pos         (2UL)                     /*!< MDR_UART1 TCR: SIRTest (Bit 2)                        */
#define MDR_UART1_TCR_SIRTest_Msk         (0x4UL)                   /*!< MDR_UART1 TCR: SIRTest (Bitfield-Mask: 0x01)          */


/* =========================================================================================================================== */
/* ================                                        MDR_TIMER1                                         ================ */
/* =========================================================================================================================== */

/* ==========================================================  CNT  ========================================================== */
#define MDR_TIMER1_CNT_Value_Pos          (0UL)                     /*!< MDR_TIMER1 CNT: Value (Bit 0)                         */
#define MDR_TIMER1_CNT_Value_Msk          (0xffffffffUL)            /*!< MDR_TIMER1 CNT: Value (Bitfield-Mask: 0xffffffff)     */
/* ==========================================================  PSG  ========================================================== */
#define MDR_TIMER1_PSG_Value_Pos          (0UL)                     /*!< MDR_TIMER1 PSG: Value (Bit 0)                         */
#define MDR_TIMER1_PSG_Value_Msk          (0xffffUL)                /*!< MDR_TIMER1 PSG: Value (Bitfield-Mask: 0xffff)         */
/* ==========================================================  ARR  ========================================================== */
#define MDR_TIMER1_ARR_Value_Pos          (0UL)                     /*!< MDR_TIMER1 ARR: Value (Bit 0)                         */
#define MDR_TIMER1_ARR_Value_Msk          (0xffffffffUL)            /*!< MDR_TIMER1 ARR: Value (Bitfield-Mask: 0xffffffff)     */
/* =========================================================  CNTRL  ========================================================= */
#define MDR_TIMER1_CNTRL_CNT_EN_Pos       (0UL)                     /*!< MDR_TIMER1 CNTRL: CNT_EN (Bit 0)                      */
#define MDR_TIMER1_CNTRL_CNT_EN_Msk       (0x1UL)                   /*!< MDR_TIMER1 CNTRL: CNT_EN (Bitfield-Mask: 0x01)        */
#define MDR_TIMER1_CNTRL_ARRB_EN_Pos      (1UL)                     /*!< MDR_TIMER1 CNTRL: ARRB_EN (Bit 1)                     */
#define MDR_TIMER1_CNTRL_ARRB_EN_Msk      (0x2UL)                   /*!< MDR_TIMER1 CNTRL: ARRB_EN (Bitfield-Mask: 0x01)       */
#define MDR_TIMER1_CNTRL_WR_CMPL_Pos      (2UL)                     /*!< MDR_TIMER1 CNTRL: WR_CMPL (Bit 2)                     */
#define MDR_TIMER1_CNTRL_WR_CMPL_Msk      (0x4UL)                   /*!< MDR_TIMER1 CNTRL: WR_CMPL (Bitfield-Mask: 0x01)       */
#define MDR_TIMER1_CNTRL_DIR_Pos          (3UL)                     /*!< MDR_TIMER1 CNTRL: DIR (Bit 3)                         */
#define MDR_TIMER1_CNTRL_DIR_Msk          (0x8UL)                   /*!< MDR_TIMER1 CNTRL: DIR (Bitfield-Mask: 0x01)           */
#define MDR_TIMER1_CNTRL_FDTS_Pos         (4UL)                     /*!< MDR_TIMER1 CNTRL: FDTS (Bit 4)                        */
#define MDR_TIMER1_CNTRL_FDTS_Msk         (0x30UL)                  /*!< MDR_TIMER1 CNTRL: FDTS (Bitfield-Mask: 0x03)          */
#define MDR_TIMER1_CNTRL_CNT_MODE_Pos     (6UL)                     /*!< MDR_TIMER1 CNTRL: CNT_MODE (Bit 6)                    */
#define MDR_TIMER1_CNTRL_CNT_MODE_Msk     (0xc0UL)                  /*!< MDR_TIMER1 CNTRL: CNT_MODE (Bitfield-Mask: 0x03)      */
#define MDR_TIMER1_CNTRL_EVENT_SEL_Pos    (8UL)                     /*!< MDR_TIMER1 CNTRL: EVENT_SEL (Bit 8)                   */
#define MDR_TIMER1_CNTRL_EVENT_SEL_Msk    (0xf00UL)                 /*!< MDR_TIMER1 CNTRL: EVENT_SEL (Bitfield-Mask: 0x0f)     */
/* =========================================================  CCR1  ========================================================== */
#define MDR_TIMER1_CCR1_Value_Pos         (0UL)                     /*!< MDR_TIMER1 CCR1: Value (Bit 0)                        */
#define MDR_TIMER1_CCR1_Value_Msk         (0xffffffffUL)            /*!< MDR_TIMER1 CCR1: Value (Bitfield-Mask: 0xffffffff)    */
/* =========================================================  CCR2  ========================================================== */
#define MDR_TIMER1_CCR2_Value_Pos         (0UL)                     /*!< MDR_TIMER1 CCR2: Value (Bit 0)                        */
#define MDR_TIMER1_CCR2_Value_Msk         (0xffffffffUL)            /*!< MDR_TIMER1 CCR2: Value (Bitfield-Mask: 0xffffffff)    */
/* =========================================================  CCR3  ========================================================== */
#define MDR_TIMER1_CCR3_Value_Pos         (0UL)                     /*!< MDR_TIMER1 CCR3: Value (Bit 0)                        */
#define MDR_TIMER1_CCR3_Value_Msk         (0xffffffffUL)            /*!< MDR_TIMER1 CCR3: Value (Bitfield-Mask: 0xffffffff)    */
/* =========================================================  CCR4  ========================================================== */
#define MDR_TIMER1_CCR4_Value_Pos         (0UL)                     /*!< MDR_TIMER1 CCR4: Value (Bit 0)                        */
#define MDR_TIMER1_CCR4_Value_Msk         (0xffffffffUL)            /*!< MDR_TIMER1 CCR4: Value (Bitfield-Mask: 0xffffffff)    */
/* =======================================================  CH1_CNTRL  ======================================================= */
#define MDR_TIMER1_CH1_CNTRL_CHFLTR_Pos   (0UL)                     /*!< MDR_TIMER1 CH1_CNTRL: CHFLTR (Bit 0)                  */
#define MDR_TIMER1_CH1_CNTRL_CHFLTR_Msk   (0xfUL)                   /*!< MDR_TIMER1 CH1_CNTRL: CHFLTR (Bitfield-Mask: 0x0f)    */
#define MDR_TIMER1_CH1_CNTRL_CHSEL_Pos    (4UL)                     /*!< MDR_TIMER1 CH1_CNTRL: CHSEL (Bit 4)                   */
#define MDR_TIMER1_CH1_CNTRL_CHSEL_Msk    (0x30UL)                  /*!< MDR_TIMER1 CH1_CNTRL: CHSEL (Bitfield-Mask: 0x03)     */
#define MDR_TIMER1_CH1_CNTRL_CHPSC_Pos    (6UL)                     /*!< MDR_TIMER1 CH1_CNTRL: CHPSC (Bit 6)                   */
#define MDR_TIMER1_CH1_CNTRL_CHPSC_Msk    (0xc0UL)                  /*!< MDR_TIMER1 CH1_CNTRL: CHPSC (Bitfield-Mask: 0x03)     */
#define MDR_TIMER1_CH1_CNTRL_OCCE_Pos     (8UL)                     /*!< MDR_TIMER1 CH1_CNTRL: OCCE (Bit 8)                    */
#define MDR_TIMER1_CH1_CNTRL_OCCE_Msk     (0x100UL)                 /*!< MDR_TIMER1 CH1_CNTRL: OCCE (Bitfield-Mask: 0x01)      */
#define MDR_TIMER1_CH1_CNTRL_OCCM_Pos     (9UL)                     /*!< MDR_TIMER1 CH1_CNTRL: OCCM (Bit 9)                    */
#define MDR_TIMER1_CH1_CNTRL_OCCM_Msk     (0xe00UL)                 /*!< MDR_TIMER1 CH1_CNTRL: OCCM (Bitfield-Mask: 0x07)      */
#define MDR_TIMER1_CH1_CNTRL_BRKEN_Pos    (12UL)                    /*!< MDR_TIMER1 CH1_CNTRL: BRKEN (Bit 12)                  */
#define MDR_TIMER1_CH1_CNTRL_BRKEN_Msk    (0x1000UL)                /*!< MDR_TIMER1 CH1_CNTRL: BRKEN (Bitfield-Mask: 0x01)     */
#define MDR_TIMER1_CH1_CNTRL_ETREN_Pos    (13UL)                    /*!< MDR_TIMER1 CH1_CNTRL: ETREN (Bit 13)                  */
#define MDR_TIMER1_CH1_CNTRL_ETREN_Msk    (0x2000UL)                /*!< MDR_TIMER1 CH1_CNTRL: ETREN (Bitfield-Mask: 0x01)     */
#define MDR_TIMER1_CH1_CNTRL_WR_CMPL_Pos  (14UL)                    /*!< MDR_TIMER1 CH1_CNTRL: WR_CMPL (Bit 14)                */
#define MDR_TIMER1_CH1_CNTRL_WR_CMPL_Msk  (0x4000UL)                /*!< MDR_TIMER1 CH1_CNTRL: WR_CMPL (Bitfield-Mask: 0x01)   */
#define MDR_TIMER1_CH1_CNTRL_CAP_nPWM_Pos (15UL)                    /*!< MDR_TIMER1 CH1_CNTRL: CAP_nPWM (Bit 15)               */
#define MDR_TIMER1_CH1_CNTRL_CAP_nPWM_Msk (0x8000UL)                /*!< MDR_TIMER1 CH1_CNTRL: CAP_nPWM (Bitfield-Mask: 0x01)  */
/* =======================================================  CH2_CNTRL  ======================================================= */
#define MDR_TIMER1_CH2_CNTRL_CHFLTR_Pos   (0UL)                     /*!< MDR_TIMER1 CH2_CNTRL: CHFLTR (Bit 0)                  */
#define MDR_TIMER1_CH2_CNTRL_CHFLTR_Msk   (0xfUL)                   /*!< MDR_TIMER1 CH2_CNTRL: CHFLTR (Bitfield-Mask: 0x0f)    */
#define MDR_TIMER1_CH2_CNTRL_CHSEL_Pos    (4UL)                     /*!< MDR_TIMER1 CH2_CNTRL: CHSEL (Bit 4)                   */
#define MDR_TIMER1_CH2_CNTRL_CHSEL_Msk    (0x30UL)                  /*!< MDR_TIMER1 CH2_CNTRL: CHSEL (Bitfield-Mask: 0x03)     */
#define MDR_TIMER1_CH2_CNTRL_CHPSC_Pos    (6UL)                     /*!< MDR_TIMER1 CH2_CNTRL: CHPSC (Bit 6)                   */
#define MDR_TIMER1_CH2_CNTRL_CHPSC_Msk    (0xc0UL)                  /*!< MDR_TIMER1 CH2_CNTRL: CHPSC (Bitfield-Mask: 0x03)     */
#define MDR_TIMER1_CH2_CNTRL_OCCE_Pos     (8UL)                     /*!< MDR_TIMER1 CH2_CNTRL: OCCE (Bit 8)                    */
#define MDR_TIMER1_CH2_CNTRL_OCCE_Msk     (0x100UL)                 /*!< MDR_TIMER1 CH2_CNTRL: OCCE (Bitfield-Mask: 0x01)      */
#define MDR_TIMER1_CH2_CNTRL_OCCM_Pos     (9UL)                     /*!< MDR_TIMER1 CH2_CNTRL: OCCM (Bit 9)                    */
#define MDR_TIMER1_CH2_CNTRL_OCCM_Msk     (0xe00UL)                 /*!< MDR_TIMER1 CH2_CNTRL: OCCM (Bitfield-Mask: 0x07)      */
#define MDR_TIMER1_CH2_CNTRL_BRKEN_Pos    (12UL)                    /*!< MDR_TIMER1 CH2_CNTRL: BRKEN (Bit 12)                  */
#define MDR_TIMER1_CH2_CNTRL_BRKEN_Msk    (0x1000UL)                /*!< MDR_TIMER1 CH2_CNTRL: BRKEN (Bitfield-Mask: 0x01)     */
#define MDR_TIMER1_CH2_CNTRL_ETREN_Pos    (13UL)                    /*!< MDR_TIMER1 CH2_CNTRL: ETREN (Bit 13)                  */
#define MDR_TIMER1_CH2_CNTRL_ETREN_Msk    (0x2000UL)                /*!< MDR_TIMER1 CH2_CNTRL: ETREN (Bitfield-Mask: 0x01)     */
#define MDR_TIMER1_CH2_CNTRL_WR_CMPL_Pos  (14UL)                    /*!< MDR_TIMER1 CH2_CNTRL: WR_CMPL (Bit 14)                */
#define MDR_TIMER1_CH2_CNTRL_WR_CMPL_Msk  (0x4000UL)                /*!< MDR_TIMER1 CH2_CNTRL: WR_CMPL (Bitfield-Mask: 0x01)   */
#define MDR_TIMER1_CH2_CNTRL_CAP_nPWM_Pos (15UL)                    /*!< MDR_TIMER1 CH2_CNTRL: CAP_nPWM (Bit 15)               */
#define MDR_TIMER1_CH2_CNTRL_CAP_nPWM_Msk (0x8000UL)                /*!< MDR_TIMER1 CH2_CNTRL: CAP_nPWM (Bitfield-Mask: 0x01)  */
/* =======================================================  CH3_CNTRL  ======================================================= */
#define MDR_TIMER1_CH3_CNTRL_CHFLTR_Pos   (0UL)                     /*!< MDR_TIMER1 CH3_CNTRL: CHFLTR (Bit 0)                  */
#define MDR_TIMER1_CH3_CNTRL_CHFLTR_Msk   (0xfUL)                   /*!< MDR_TIMER1 CH3_CNTRL: CHFLTR (Bitfield-Mask: 0x0f)    */
#define MDR_TIMER1_CH3_CNTRL_CHSEL_Pos    (4UL)                     /*!< MDR_TIMER1 CH3_CNTRL: CHSEL (Bit 4)                   */
#define MDR_TIMER1_CH3_CNTRL_CHSEL_Msk    (0x30UL)                  /*!< MDR_TIMER1 CH3_CNTRL: CHSEL (Bitfield-Mask: 0x03)     */
#define MDR_TIMER1_CH3_CNTRL_CHPSC_Pos    (6UL)                     /*!< MDR_TIMER1 CH3_CNTRL: CHPSC (Bit 6)                   */
#define MDR_TIMER1_CH3_CNTRL_CHPSC_Msk    (0xc0UL)                  /*!< MDR_TIMER1 CH3_CNTRL: CHPSC (Bitfield-Mask: 0x03)     */
#define MDR_TIMER1_CH3_CNTRL_OCCE_Pos     (8UL)                     /*!< MDR_TIMER1 CH3_CNTRL: OCCE (Bit 8)                    */
#define MDR_TIMER1_CH3_CNTRL_OCCE_Msk     (0x100UL)                 /*!< MDR_TIMER1 CH3_CNTRL: OCCE (Bitfield-Mask: 0x01)      */
#define MDR_TIMER1_CH3_CNTRL_OCCM_Pos     (9UL)                     /*!< MDR_TIMER1 CH3_CNTRL: OCCM (Bit 9)                    */
#define MDR_TIMER1_CH3_CNTRL_OCCM_Msk     (0xe00UL)                 /*!< MDR_TIMER1 CH3_CNTRL: OCCM (Bitfield-Mask: 0x07)      */
#define MDR_TIMER1_CH3_CNTRL_BRKEN_Pos    (12UL)                    /*!< MDR_TIMER1 CH3_CNTRL: BRKEN (Bit 12)                  */
#define MDR_TIMER1_CH3_CNTRL_BRKEN_Msk    (0x1000UL)                /*!< MDR_TIMER1 CH3_CNTRL: BRKEN (Bitfield-Mask: 0x01)     */
#define MDR_TIMER1_CH3_CNTRL_ETREN_Pos    (13UL)                    /*!< MDR_TIMER1 CH3_CNTRL: ETREN (Bit 13)                  */
#define MDR_TIMER1_CH3_CNTRL_ETREN_Msk    (0x2000UL)                /*!< MDR_TIMER1 CH3_CNTRL: ETREN (Bitfield-Mask: 0x01)     */
#define MDR_TIMER1_CH3_CNTRL_WR_CMPL_Pos  (14UL)                    /*!< MDR_TIMER1 CH3_CNTRL: WR_CMPL (Bit 14)                */
#define MDR_TIMER1_CH3_CNTRL_WR_CMPL_Msk  (0x4000UL)                /*!< MDR_TIMER1 CH3_CNTRL: WR_CMPL (Bitfield-Mask: 0x01)   */
#define MDR_TIMER1_CH3_CNTRL_CAP_nPWM_Pos (15UL)                    /*!< MDR_TIMER1 CH3_CNTRL: CAP_nPWM (Bit 15)               */
#define MDR_TIMER1_CH3_CNTRL_CAP_nPWM_Msk (0x8000UL)                /*!< MDR_TIMER1 CH3_CNTRL: CAP_nPWM (Bitfield-Mask: 0x01)  */
/* =======================================================  CH4_CNTRL  ======================================================= */
#define MDR_TIMER1_CH4_CNTRL_CHFLTR_Pos   (0UL)                     /*!< MDR_TIMER1 CH4_CNTRL: CHFLTR (Bit 0)                  */
#define MDR_TIMER1_CH4_CNTRL_CHFLTR_Msk   (0xfUL)                   /*!< MDR_TIMER1 CH4_CNTRL: CHFLTR (Bitfield-Mask: 0x0f)    */
#define MDR_TIMER1_CH4_CNTRL_CHSEL_Pos    (4UL)                     /*!< MDR_TIMER1 CH4_CNTRL: CHSEL (Bit 4)                   */
#define MDR_TIMER1_CH4_CNTRL_CHSEL_Msk    (0x30UL)                  /*!< MDR_TIMER1 CH4_CNTRL: CHSEL (Bitfield-Mask: 0x03)     */
#define MDR_TIMER1_CH4_CNTRL_CHPSC_Pos    (6UL)                     /*!< MDR_TIMER1 CH4_CNTRL: CHPSC (Bit 6)                   */
#define MDR_TIMER1_CH4_CNTRL_CHPSC_Msk    (0xc0UL)                  /*!< MDR_TIMER1 CH4_CNTRL: CHPSC (Bitfield-Mask: 0x03)     */
#define MDR_TIMER1_CH4_CNTRL_OCCE_Pos     (8UL)                     /*!< MDR_TIMER1 CH4_CNTRL: OCCE (Bit 8)                    */
#define MDR_TIMER1_CH4_CNTRL_OCCE_Msk     (0x100UL)                 /*!< MDR_TIMER1 CH4_CNTRL: OCCE (Bitfield-Mask: 0x01)      */
#define MDR_TIMER1_CH4_CNTRL_OCCM_Pos     (9UL)                     /*!< MDR_TIMER1 CH4_CNTRL: OCCM (Bit 9)                    */
#define MDR_TIMER1_CH4_CNTRL_OCCM_Msk     (0xe00UL)                 /*!< MDR_TIMER1 CH4_CNTRL: OCCM (Bitfield-Mask: 0x07)      */
#define MDR_TIMER1_CH4_CNTRL_BRKEN_Pos    (12UL)                    /*!< MDR_TIMER1 CH4_CNTRL: BRKEN (Bit 12)                  */
#define MDR_TIMER1_CH4_CNTRL_BRKEN_Msk    (0x1000UL)                /*!< MDR_TIMER1 CH4_CNTRL: BRKEN (Bitfield-Mask: 0x01)     */
#define MDR_TIMER1_CH4_CNTRL_ETREN_Pos    (13UL)                    /*!< MDR_TIMER1 CH4_CNTRL: ETREN (Bit 13)                  */
#define MDR_TIMER1_CH4_CNTRL_ETREN_Msk    (0x2000UL)                /*!< MDR_TIMER1 CH4_CNTRL: ETREN (Bitfield-Mask: 0x01)     */
#define MDR_TIMER1_CH4_CNTRL_WR_CMPL_Pos  (14UL)                    /*!< MDR_TIMER1 CH4_CNTRL: WR_CMPL (Bit 14)                */
#define MDR_TIMER1_CH4_CNTRL_WR_CMPL_Msk  (0x4000UL)                /*!< MDR_TIMER1 CH4_CNTRL: WR_CMPL (Bitfield-Mask: 0x01)   */
#define MDR_TIMER1_CH4_CNTRL_CAP_nPWM_Pos (15UL)                    /*!< MDR_TIMER1 CH4_CNTRL: CAP_nPWM (Bit 15)               */
#define MDR_TIMER1_CH4_CNTRL_CAP_nPWM_Msk (0x8000UL)                /*!< MDR_TIMER1 CH4_CNTRL: CAP_nPWM (Bitfield-Mask: 0x01)  */
/* ======================================================  CH1_CNTRL1  ======================================================= */
#define MDR_TIMER1_CH1_CNTRL1_SelOE_Pos   (0UL)                     /*!< MDR_TIMER1 CH1_CNTRL1: SelOE (Bit 0)                  */
#define MDR_TIMER1_CH1_CNTRL1_SelOE_Msk   (0x3UL)                   /*!< MDR_TIMER1 CH1_CNTRL1: SelOE (Bitfield-Mask: 0x03)    */
#define MDR_TIMER1_CH1_CNTRL1_SelO_Pos    (2UL)                     /*!< MDR_TIMER1 CH1_CNTRL1: SelO (Bit 2)                   */
#define MDR_TIMER1_CH1_CNTRL1_SelO_Msk    (0xcUL)                   /*!< MDR_TIMER1 CH1_CNTRL1: SelO (Bitfield-Mask: 0x03)     */
#define MDR_TIMER1_CH1_CNTRL1_Inv_Pos     (4UL)                     /*!< MDR_TIMER1 CH1_CNTRL1: Inv (Bit 4)                    */
#define MDR_TIMER1_CH1_CNTRL1_Inv_Msk     (0x10UL)                  /*!< MDR_TIMER1 CH1_CNTRL1: Inv (Bitfield-Mask: 0x01)      */
#define MDR_TIMER1_CH1_CNTRL1_NSelOE_Pos  (8UL)                     /*!< MDR_TIMER1 CH1_CNTRL1: NSelOE (Bit 8)                 */
#define MDR_TIMER1_CH1_CNTRL1_NSelOE_Msk  (0x300UL)                 /*!< MDR_TIMER1 CH1_CNTRL1: NSelOE (Bitfield-Mask: 0x03)   */
#define MDR_TIMER1_CH1_CNTRL1_NSelO_Pos   (10UL)                    /*!< MDR_TIMER1 CH1_CNTRL1: NSelO (Bit 10)                 */
#define MDR_TIMER1_CH1_CNTRL1_NSelO_Msk   (0xc00UL)                 /*!< MDR_TIMER1 CH1_CNTRL1: NSelO (Bitfield-Mask: 0x03)    */
#define MDR_TIMER1_CH1_CNTRL1_NInv_Pos    (12UL)                    /*!< MDR_TIMER1 CH1_CNTRL1: NInv (Bit 12)                  */
#define MDR_TIMER1_CH1_CNTRL1_NInv_Msk    (0x1000UL)                /*!< MDR_TIMER1 CH1_CNTRL1: NInv (Bitfield-Mask: 0x01)     */
/* ======================================================  CH2_CNTRL1  ======================================================= */
#define MDR_TIMER1_CH2_CNTRL1_SelOE_Pos   (0UL)                     /*!< MDR_TIMER1 CH2_CNTRL1: SelOE (Bit 0)                  */
#define MDR_TIMER1_CH2_CNTRL1_SelOE_Msk   (0x3UL)                   /*!< MDR_TIMER1 CH2_CNTRL1: SelOE (Bitfield-Mask: 0x03)    */
#define MDR_TIMER1_CH2_CNTRL1_SelO_Pos    (2UL)                     /*!< MDR_TIMER1 CH2_CNTRL1: SelO (Bit 2)                   */
#define MDR_TIMER1_CH2_CNTRL1_SelO_Msk    (0xcUL)                   /*!< MDR_TIMER1 CH2_CNTRL1: SelO (Bitfield-Mask: 0x03)     */
#define MDR_TIMER1_CH2_CNTRL1_Inv_Pos     (4UL)                     /*!< MDR_TIMER1 CH2_CNTRL1: Inv (Bit 4)                    */
#define MDR_TIMER1_CH2_CNTRL1_Inv_Msk     (0x10UL)                  /*!< MDR_TIMER1 CH2_CNTRL1: Inv (Bitfield-Mask: 0x01)      */
#define MDR_TIMER1_CH2_CNTRL1_NSelOE_Pos  (8UL)                     /*!< MDR_TIMER1 CH2_CNTRL1: NSelOE (Bit 8)                 */
#define MDR_TIMER1_CH2_CNTRL1_NSelOE_Msk  (0x300UL)                 /*!< MDR_TIMER1 CH2_CNTRL1: NSelOE (Bitfield-Mask: 0x03)   */
#define MDR_TIMER1_CH2_CNTRL1_NSelO_Pos   (10UL)                    /*!< MDR_TIMER1 CH2_CNTRL1: NSelO (Bit 10)                 */
#define MDR_TIMER1_CH2_CNTRL1_NSelO_Msk   (0xc00UL)                 /*!< MDR_TIMER1 CH2_CNTRL1: NSelO (Bitfield-Mask: 0x03)    */
#define MDR_TIMER1_CH2_CNTRL1_NInv_Pos    (12UL)                    /*!< MDR_TIMER1 CH2_CNTRL1: NInv (Bit 12)                  */
#define MDR_TIMER1_CH2_CNTRL1_NInv_Msk    (0x1000UL)                /*!< MDR_TIMER1 CH2_CNTRL1: NInv (Bitfield-Mask: 0x01)     */
/* ======================================================  CH3_CNTRL1  ======================================================= */
#define MDR_TIMER1_CH3_CNTRL1_SelOE_Pos   (0UL)                     /*!< MDR_TIMER1 CH3_CNTRL1: SelOE (Bit 0)                  */
#define MDR_TIMER1_CH3_CNTRL1_SelOE_Msk   (0x3UL)                   /*!< MDR_TIMER1 CH3_CNTRL1: SelOE (Bitfield-Mask: 0x03)    */
#define MDR_TIMER1_CH3_CNTRL1_SelO_Pos    (2UL)                     /*!< MDR_TIMER1 CH3_CNTRL1: SelO (Bit 2)                   */
#define MDR_TIMER1_CH3_CNTRL1_SelO_Msk    (0xcUL)                   /*!< MDR_TIMER1 CH3_CNTRL1: SelO (Bitfield-Mask: 0x03)     */
#define MDR_TIMER1_CH3_CNTRL1_Inv_Pos     (4UL)                     /*!< MDR_TIMER1 CH3_CNTRL1: Inv (Bit 4)                    */
#define MDR_TIMER1_CH3_CNTRL1_Inv_Msk     (0x10UL)                  /*!< MDR_TIMER1 CH3_CNTRL1: Inv (Bitfield-Mask: 0x01)      */
#define MDR_TIMER1_CH3_CNTRL1_NSelOE_Pos  (8UL)                     /*!< MDR_TIMER1 CH3_CNTRL1: NSelOE (Bit 8)                 */
#define MDR_TIMER1_CH3_CNTRL1_NSelOE_Msk  (0x300UL)                 /*!< MDR_TIMER1 CH3_CNTRL1: NSelOE (Bitfield-Mask: 0x03)   */
#define MDR_TIMER1_CH3_CNTRL1_NSelO_Pos   (10UL)                    /*!< MDR_TIMER1 CH3_CNTRL1: NSelO (Bit 10)                 */
#define MDR_TIMER1_CH3_CNTRL1_NSelO_Msk   (0xc00UL)                 /*!< MDR_TIMER1 CH3_CNTRL1: NSelO (Bitfield-Mask: 0x03)    */
#define MDR_TIMER1_CH3_CNTRL1_NInv_Pos    (12UL)                    /*!< MDR_TIMER1 CH3_CNTRL1: NInv (Bit 12)                  */
#define MDR_TIMER1_CH3_CNTRL1_NInv_Msk    (0x1000UL)                /*!< MDR_TIMER1 CH3_CNTRL1: NInv (Bitfield-Mask: 0x01)     */
/* ======================================================  CH4_CNTRL1  ======================================================= */
#define MDR_TIMER1_CH4_CNTRL1_SelOE_Pos   (0UL)                     /*!< MDR_TIMER1 CH4_CNTRL1: SelOE (Bit 0)                  */
#define MDR_TIMER1_CH4_CNTRL1_SelOE_Msk   (0x3UL)                   /*!< MDR_TIMER1 CH4_CNTRL1: SelOE (Bitfield-Mask: 0x03)    */
#define MDR_TIMER1_CH4_CNTRL1_SelO_Pos    (2UL)                     /*!< MDR_TIMER1 CH4_CNTRL1: SelO (Bit 2)                   */
#define MDR_TIMER1_CH4_CNTRL1_SelO_Msk    (0xcUL)                   /*!< MDR_TIMER1 CH4_CNTRL1: SelO (Bitfield-Mask: 0x03)     */
#define MDR_TIMER1_CH4_CNTRL1_Inv_Pos     (4UL)                     /*!< MDR_TIMER1 CH4_CNTRL1: Inv (Bit 4)                    */
#define MDR_TIMER1_CH4_CNTRL1_Inv_Msk     (0x10UL)                  /*!< MDR_TIMER1 CH4_CNTRL1: Inv (Bitfield-Mask: 0x01)      */
#define MDR_TIMER1_CH4_CNTRL1_NSelOE_Pos  (8UL)                     /*!< MDR_TIMER1 CH4_CNTRL1: NSelOE (Bit 8)                 */
#define MDR_TIMER1_CH4_CNTRL1_NSelOE_Msk  (0x300UL)                 /*!< MDR_TIMER1 CH4_CNTRL1: NSelOE (Bitfield-Mask: 0x03)   */
#define MDR_TIMER1_CH4_CNTRL1_NSelO_Pos   (10UL)                    /*!< MDR_TIMER1 CH4_CNTRL1: NSelO (Bit 10)                 */
#define MDR_TIMER1_CH4_CNTRL1_NSelO_Msk   (0xc00UL)                 /*!< MDR_TIMER1 CH4_CNTRL1: NSelO (Bitfield-Mask: 0x03)    */
#define MDR_TIMER1_CH4_CNTRL1_NInv_Pos    (12UL)                    /*!< MDR_TIMER1 CH4_CNTRL1: NInv (Bit 12)                  */
#define MDR_TIMER1_CH4_CNTRL1_NInv_Msk    (0x1000UL)                /*!< MDR_TIMER1 CH4_CNTRL1: NInv (Bitfield-Mask: 0x01)     */
/* ========================================================  CH1_DTG  ======================================================== */
#define MDR_TIMER1_CH1_DTG_DTG_Pos        (0UL)                     /*!< MDR_TIMER1 CH1_DTG: DTG (Bit 0)                       */
