StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
#define MDR_TIMER1_CCR31_Value_Msk        (0xffffffffUL)            /*!< MDR_TIMER1 CCR31: Value (Bitfield-Mask: 0xffffffff)   */
/* =========================================================  CCR41  ========================================================= */
#define MDR_TIMER1_CCR41_Value_Pos        (0UL)                     /*!< MDR_TIMER1 CCR41: Value (Bit 0)                       */
#define MDR_TIMER1_CCR41_Value_Msk        (0xffffffffUL)            /*!< MDR_TIMER1 CCR41: Value (Bitfield-Mask: 0xffffffff)   */
/* ========================================================  DMA_RE1  ======================================================== */
#define MDR_TIMER1_DMA_RE1_CNT_ZERO_DMAE_Pos (0UL)                  /*!< MDR_TIMER1 DMA_RE1: CNT_ZERO_DMAE (Bit 0)             */
#define MDR_TIMER1_DMA_RE1_CNT_ZERO_DMAE_Msk (0x1UL)                /*!< MDR_TIMER1 DMA_RE1: CNT_ZERO_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE1_CNT_ARR_DMAE_Pos (1UL)                   /*!< MDR_TIMER1 DMA_RE1: CNT_ARR_DMAE (Bit 1)              */
#define MDR_TIMER1_DMA_RE1_CNT_ARR_DMAE_Msk (0x2UL)                 /*!< MDR_TIMER1 DMA_RE1: CNT_ARR_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE1_ETR_RE_DMAE_Pos (2UL)                    /*!< MDR_TIMER1 DMA_RE1: ETR_RE_DMAE (Bit 2)               */
#define MDR_TIMER1_DMA_RE1_ETR_RE_DMAE_Msk (0x4UL)                  /*!< MDR_TIMER1 DMA_RE1: ETR_RE_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE1_ETR_FE_DMAE_Pos (3UL)                    /*!< MDR_TIMER1 DMA_RE1: ETR_FE_DMAE (Bit 3)               */
#define MDR_TIMER1_DMA_RE1_ETR_FE_DMAE_Msk (0x8UL)                  /*!< MDR_TIMER1 DMA_RE1: ETR_FE_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE1_BRK_DMAE_Pos   (4UL)                     /*!< MDR_TIMER1 DMA_RE1: BRK_DMAE (Bit 4)                  */
#define MDR_TIMER1_DMA_RE1_BRK_DMAE_Msk   (0x10UL)                  /*!< MDR_TIMER1 DMA_RE1: BRK_DMAE (Bitfield-Mask: 0x01)    */
#define MDR_TIMER1_DMA_RE1_CCR_CAP_CH1_DMAE_Pos (5UL)               /*!< MDR_TIMER1 DMA_RE1: CCR_CAP_CH1_DMAE (Bit 5)          */
#define MDR_TIMER1_DMA_RE1_CCR_CAP_CH1_DMAE_Msk (0x20UL)            /*!< MDR_TIMER1 DMA_RE1: CCR_CAP_CH1_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE1_CCR_CAP_CH2_DMAE_Pos (6UL)               /*!< MDR_TIMER1 DMA_RE1: CCR_CAP_CH2_DMAE (Bit 6)          */
#define MDR_TIMER1_DMA_RE1_CCR_CAP_CH2_DMAE_Msk (0x40UL)            /*!< MDR_TIMER1 DMA_RE1: CCR_CAP_CH2_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE1_CCR_CAP_CH3_DMAE_Pos (7UL)               /*!< MDR_TIMER1 DMA_RE1: CCR_CAP_CH3_DMAE (Bit 7)          */
#define MDR_TIMER1_DMA_RE1_CCR_CAP_CH3_DMAE_Msk (0x80UL)            /*!< MDR_TIMER1 DMA_RE1: CCR_CAP_CH3_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE1_CCR_CAP_CH4_DMAE_Pos (8UL)               /*!< MDR_TIMER1 DMA_RE1: CCR_CAP_CH4_DMAE (Bit 8)          */
#define MDR_TIMER1_DMA_RE1_CCR_CAP_CH4_DMAE_Msk (0x100UL)           /*!< MDR_TIMER1 DMA_RE1: CCR_CAP_CH4_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE1_CCR_REF_CH1_DMAE_Pos (9UL)               /*!< MDR_TIMER1 DMA_RE1: CCR_REF_CH1_DMAE (Bit 9)          */
#define MDR_TIMER1_DMA_RE1_CCR_REF_CH1_DMAE_Msk (0x200UL)           /*!< MDR_TIMER1 DMA_RE1: CCR_REF_CH1_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE1_CCR_REF_CH2_DMAE_Pos (10UL)              /*!< MDR_TIMER1 DMA_RE1: CCR_REF_CH2_DMAE (Bit 10)         */
#define MDR_TIMER1_DMA_RE1_CCR_REF_CH2_DMAE_Msk (0x400UL)           /*!< MDR_TIMER1 DMA_RE1: CCR_REF_CH2_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE1_CCR_REF_CH3_DMAE_Pos (11UL)              /*!< MDR_TIMER1 DMA_RE1: CCR_REF_CH3_DMAE (Bit 11)         */
#define MDR_TIMER1_DMA_RE1_CCR_REF_CH3_DMAE_Msk (0x800UL)           /*!< MDR_TIMER1 DMA_RE1: CCR_REF_CH3_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE1_CCR_REF_CH4_DMAE_Pos (12UL)              /*!< MDR_TIMER1 DMA_RE1: CCR_REF_CH4_DMAE (Bit 12)         */
#define MDR_TIMER1_DMA_RE1_CCR_REF_CH4_DMAE_Msk (0x1000UL)          /*!< MDR_TIMER1 DMA_RE1: CCR_REF_CH4_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE1_CCR1_CAP_CH1_DMAE_Pos (13UL)             /*!< MDR_TIMER1 DMA_RE1: CCR1_CAP_CH1_DMAE (Bit 13)        */
#define MDR_TIMER1_DMA_RE1_CCR1_CAP_CH1_DMAE_Msk (0x2000UL)         /*!< MDR_TIMER1 DMA_RE1: CCR1_CAP_CH1_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE1_CCR1_CAP_CH2_DMAE_Pos (14UL)             /*!< MDR_TIMER1 DMA_RE1: CCR1_CAP_CH2_DMAE (Bit 14)        */
#define MDR_TIMER1_DMA_RE1_CCR1_CAP_CH2_DMAE_Msk (0x4000UL)         /*!< MDR_TIMER1 DMA_RE1: CCR1_CAP_CH2_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE1_CCR1_CAP_CH3_DMAE_Pos (15UL)             /*!< MDR_TIMER1 DMA_RE1: CCR1_CAP_CH3_DMAE (Bit 15)        */
#define MDR_TIMER1_DMA_RE1_CCR1_CAP_CH3_DMAE_Msk (0x8000UL)         /*!< MDR_TIMER1 DMA_RE1: CCR1_CAP_CH3_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE1_CCR1_CAP_CH4_DMAE_Pos (16UL)             /*!< MDR_TIMER1 DMA_RE1: CCR1_CAP_CH4_DMAE (Bit 16)        */
#define MDR_TIMER1_DMA_RE1_CCR1_CAP_CH4_DMAE_Msk (0x10000UL)        /*!< MDR_TIMER1 DMA_RE1: CCR1_CAP_CH4_DMAE (Bitfield-Mask: 0x01) */
/* ========================================================  DMA_RE2  ======================================================== */
#define MDR_TIMER1_DMA_RE2_CNT_ZERO_DMAE_Pos (0UL)                  /*!< MDR_TIMER1 DMA_RE2: CNT_ZERO_DMAE (Bit 0)             */
#define MDR_TIMER1_DMA_RE2_CNT_ZERO_DMAE_Msk (0x1UL)                /*!< MDR_TIMER1 DMA_RE2: CNT_ZERO_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE2_CNT_ARR_DMAE_Pos (1UL)                   /*!< MDR_TIMER1 DMA_RE2: CNT_ARR_DMAE (Bit 1)              */
#define MDR_TIMER1_DMA_RE2_CNT_ARR_DMAE_Msk (0x2UL)                 /*!< MDR_TIMER1 DMA_RE2: CNT_ARR_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE2_ETR_RE_DMAE_Pos (2UL)                    /*!< MDR_TIMER1 DMA_RE2: ETR_RE_DMAE (Bit 2)               */
#define MDR_TIMER1_DMA_RE2_ETR_RE_DMAE_Msk (0x4UL)                  /*!< MDR_TIMER1 DMA_RE2: ETR_RE_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE2_ETR_FE_DMAE_Pos (3UL)                    /*!< MDR_TIMER1 DMA_RE2: ETR_FE_DMAE (Bit 3)               */
#define MDR_TIMER1_DMA_RE2_ETR_FE_DMAE_Msk (0x8UL)                  /*!< MDR_TIMER1 DMA_RE2: ETR_FE_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE2_BRK_DMAE_Pos   (4UL)                     /*!< MDR_TIMER1 DMA_RE2: BRK_DMAE (Bit 4)                  */
#define MDR_TIMER1_DMA_RE2_BRK_DMAE_Msk   (0x10UL)                  /*!< MDR_TIMER1 DMA_RE2: BRK_DMAE (Bitfield-Mask: 0x01)    */
#define MDR_TIMER1_DMA_RE2_CCR_CAP_CH1_DMAE_Pos (5UL)               /*!< MDR_TIMER1 DMA_RE2: CCR_CAP_CH1_DMAE (Bit 5)          */
#define MDR_TIMER1_DMA_RE2_CCR_CAP_CH1_DMAE_Msk (0x20UL)            /*!< MDR_TIMER1 DMA_RE2: CCR_CAP_CH1_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE2_CCR_CAP_CH2_DMAE_Pos (6UL)               /*!< MDR_TIMER1 DMA_RE2: CCR_CAP_CH2_DMAE (Bit 6)          */
#define MDR_TIMER1_DMA_RE2_CCR_CAP_CH2_DMAE_Msk (0x40UL)            /*!< MDR_TIMER1 DMA_RE2: CCR_CAP_CH2_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE2_CCR_CAP_CH3_DMAE_Pos (7UL)               /*!< MDR_TIMER1 DMA_RE2: CCR_CAP_CH3_DMAE (Bit 7)          */
#define MDR_TIMER1_DMA_RE2_CCR_CAP_CH3_DMAE_Msk (0x80UL)            /*!< MDR_TIMER1 DMA_RE2: CCR_CAP_CH3_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE2_CCR_CAP_CH4_DMAE_Pos (8UL)               /*!< MDR_TIMER1 DMA_RE2: CCR_CAP_CH4_DMAE (Bit 8)          */
#define MDR_TIMER1_DMA_RE2_CCR_CAP_CH4_DMAE_Msk (0x100UL)           /*!< MDR_TIMER1 DMA_RE2: CCR_CAP_CH4_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE2_CCR_REF_CH1_DMAE_Pos (9UL)               /*!< MDR_TIMER1 DMA_RE2: CCR_REF_CH1_DMAE (Bit 9)          */
#define MDR_TIMER1_DMA_RE2_CCR_REF_CH1_DMAE_Msk (0x200UL)           /*!< MDR_TIMER1 DMA_RE2: CCR_REF_CH1_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE2_CCR_REF_CH2_DMAE_Pos (10UL)              /*!< MDR_TIMER1 DMA_RE2: CCR_REF_CH2_DMAE (Bit 10)         */
#define MDR_TIMER1_DMA_RE2_CCR_REF_CH2_DMAE_Msk (0x400UL)           /*!< MDR_TIMER1 DMA_RE2: CCR_REF_CH2_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE2_CCR_REF_CH3_DMAE_Pos (11UL)              /*!< MDR_TIMER1 DMA_RE2: CCR_REF_CH3_DMAE (Bit 11)         */
#define MDR_TIMER1_DMA_RE2_CCR_REF_CH3_DMAE_Msk (0x800UL)           /*!< MDR_TIMER1 DMA_RE2: CCR_REF_CH3_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE2_CCR_REF_CH4_DMAE_Pos (12UL)              /*!< MDR_TIMER1 DMA_RE2: CCR_REF_CH4_DMAE (Bit 12)         */
#define MDR_TIMER1_DMA_RE2_CCR_REF_CH4_DMAE_Msk (0x1000UL)          /*!< MDR_TIMER1 DMA_RE2: CCR_REF_CH4_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE2_CCR1_CAP_CH1_DMAE_Pos (13UL)             /*!< MDR_TIMER1 DMA_RE2: CCR1_CAP_CH1_DMAE (Bit 13)        */
#define MDR_TIMER1_DMA_RE2_CCR1_CAP_CH1_DMAE_Msk (0x2000UL)         /*!< MDR_TIMER1 DMA_RE2: CCR1_CAP_CH1_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE2_CCR1_CAP_CH2_DMAE_Pos (14UL)             /*!< MDR_TIMER1 DMA_RE2: CCR1_CAP_CH2_DMAE (Bit 14)        */
#define MDR_TIMER1_DMA_RE2_CCR1_CAP_CH2_DMAE_Msk (0x4000UL)         /*!< MDR_TIMER1 DMA_RE2: CCR1_CAP_CH2_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE2_CCR1_CAP_CH3_DMAE_Pos (15UL)             /*!< MDR_TIMER1 DMA_RE2: CCR1_CAP_CH3_DMAE (Bit 15)        */
#define MDR_TIMER1_DMA_RE2_CCR1_CAP_CH3_DMAE_Msk (0x8000UL)         /*!< MDR_TIMER1 DMA_RE2: CCR1_CAP_CH3_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE2_CCR1_CAP_CH4_DMAE_Pos (16UL)             /*!< MDR_TIMER1 DMA_RE2: CCR1_CAP_CH4_DMAE (Bit 16)        */
#define MDR_TIMER1_DMA_RE2_CCR1_CAP_CH4_DMAE_Msk (0x10000UL)        /*!< MDR_TIMER1 DMA_RE2: CCR1_CAP_CH4_DMAE (Bitfield-Mask: 0x01) */
/* ========================================================  DMA_RE3  ======================================================== */
#define MDR_TIMER1_DMA_RE3_CNT_ZERO_DMAE_Pos (0UL)                  /*!< MDR_TIMER1 DMA_RE3: CNT_ZERO_DMAE (Bit 0)             */
#define MDR_TIMER1_DMA_RE3_CNT_ZERO_DMAE_Msk (0x1UL)                /*!< MDR_TIMER1 DMA_RE3: CNT_ZERO_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE3_CNT_ARR_DMAE_Pos (1UL)                   /*!< MDR_TIMER1 DMA_RE3: CNT_ARR_DMAE (Bit 1)              */
#define MDR_TIMER1_DMA_RE3_CNT_ARR_DMAE_Msk (0x2UL)                 /*!< MDR_TIMER1 DMA_RE3: CNT_ARR_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE3_ETR_RE_DMAE_Pos (2UL)                    /*!< MDR_TIMER1 DMA_RE3: ETR_RE_DMAE (Bit 2)               */
#define MDR_TIMER1_DMA_RE3_ETR_RE_DMAE_Msk (0x4UL)                  /*!< MDR_TIMER1 DMA_RE3: ETR_RE_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE3_ETR_FE_DMAE_Pos (3UL)                    /*!< MDR_TIMER1 DMA_RE3: ETR_FE_DMAE (Bit 3)               */
#define MDR_TIMER1_DMA_RE3_ETR_FE_DMAE_Msk (0x8UL)                  /*!< MDR_TIMER1 DMA_RE3: ETR_FE_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE3_BRK_DMAE_Pos   (4UL)                     /*!< MDR_TIMER1 DMA_RE3: BRK_DMAE (Bit 4)                  */
#define MDR_TIMER1_DMA_RE3_BRK_DMAE_Msk   (0x10UL)                  /*!< MDR_TIMER1 DMA_RE3: BRK_DMAE (Bitfield-Mask: 0x01)    */
#define MDR_TIMER1_DMA_RE3_CCR_CAP_CH1_DMAE_Pos (5UL)               /*!< MDR_TIMER1 DMA_RE3: CCR_CAP_CH1_DMAE (Bit 5)          */
#define MDR_TIMER1_DMA_RE3_CCR_CAP_CH1_DMAE_Msk (0x20UL)            /*!< MDR_TIMER1 DMA_RE3: CCR_CAP_CH1_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE3_CCR_CAP_CH2_DMAE_Pos (6UL)               /*!< MDR_TIMER1 DMA_RE3: CCR_CAP_CH2_DMAE (Bit 6)          */
#define MDR_TIMER1_DMA_RE3_CCR_CAP_CH2_DMAE_Msk (0x40UL)            /*!< MDR_TIMER1 DMA_RE3: CCR_CAP_CH2_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE3_CCR_CAP_CH3_DMAE_Pos (7UL)               /*!< MDR_TIMER1 DMA_RE3: CCR_CAP_CH3_DMAE (Bit 7)          */
#define MDR_TIMER1_DMA_RE3_CCR_CAP_CH3_DMAE_Msk (0x80UL)            /*!< MDR_TIMER1 DMA_RE3: CCR_CAP_CH3_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE3_CCR_CAP_CH4_DMAE_Pos (8UL)               /*!< MDR_TIMER1 DMA_RE3: CCR_CAP_CH4_DMAE (Bit 8)          */
#define MDR_TIMER1_DMA_RE3_CCR_CAP_CH4_DMAE_Msk (0x100UL)           /*!< MDR_TIMER1 DMA_RE3: CCR_CAP_CH4_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE3_CCR_REF_CH1_DMAE_Pos (9UL)               /*!< MDR_TIMER1 DMA_RE3: CCR_REF_CH1_DMAE (Bit 9)          */
#define MDR_TIMER1_DMA_RE3_CCR_REF_CH1_DMAE_Msk (0x200UL)           /*!< MDR_TIMER1 DMA_RE3: CCR_REF_CH1_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE3_CCR_REF_CH2_DMAE_Pos (10UL)              /*!< MDR_TIMER1 DMA_RE3: CCR_REF_CH2_DMAE (Bit 10)         */
#define MDR_TIMER1_DMA_RE3_CCR_REF_CH2_DMAE_Msk (0x400UL)           /*!< MDR_TIMER1 DMA_RE3: CCR_REF_CH2_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE3_CCR_REF_CH3_DMAE_Pos (11UL)              /*!< MDR_TIMER1 DMA_RE3: CCR_REF_CH3_DMAE (Bit 11)         */
#define MDR_TIMER1_DMA_RE3_CCR_REF_CH3_DMAE_Msk (0x800UL)           /*!< MDR_TIMER1 DMA_RE3: CCR_REF_CH3_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE3_CCR_REF_CH4_DMAE_Pos (12UL)              /*!< MDR_TIMER1 DMA_RE3: CCR_REF_CH4_DMAE (Bit 12)         */
#define MDR_TIMER1_DMA_RE3_CCR_REF_CH4_DMAE_Msk (0x1000UL)          /*!< MDR_TIMER1 DMA_RE3: CCR_REF_CH4_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE3_CCR1_CAP_CH1_DMAE_Pos (13UL)             /*!< MDR_TIMER1 DMA_RE3: CCR1_CAP_CH1_DMAE (Bit 13)        */
#define MDR_TIMER1_DMA_RE3_CCR1_CAP_CH1_DMAE_Msk (0x2000UL)         /*!< MDR_TIMER1 DMA_RE3: CCR1_CAP_CH1_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE3_CCR1_CAP_CH2_DMAE_Pos (14UL)             /*!< MDR_TIMER1 DMA_RE3: CCR1_CAP_CH2_DMAE (Bit 14)        */
#define MDR_TIMER1_DMA_RE3_CCR1_CAP_CH2_DMAE_Msk (0x4000UL)         /*!< MDR_TIMER1 DMA_RE3: CCR1_CAP_CH2_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE3_CCR1_CAP_CH3_DMAE_Pos (15UL)             /*!< MDR_TIMER1 DMA_RE3: CCR1_CAP_CH3_DMAE (Bit 15)        */
#define MDR_TIMER1_DMA_RE3_CCR1_CAP_CH3_DMAE_Msk (0x8000UL)         /*!< MDR_TIMER1 DMA_RE3: CCR1_CAP_CH3_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE3_CCR1_CAP_CH4_DMAE_Pos (16UL)             /*!< MDR_TIMER1 DMA_RE3: CCR1_CAP_CH4_DMAE (Bit 16)        */
#define MDR_TIMER1_DMA_RE3_CCR1_CAP_CH4_DMAE_Msk (0x10000UL)        /*!< MDR_TIMER1 DMA_RE3: CCR1_CAP_CH4_DMAE (Bitfield-Mask: 0x01) */
/* ========================================================  DMA_RE4  ======================================================== */
#define MDR_TIMER1_DMA_RE4_CNT_ZERO_DMAE_Pos (0UL)                  /*!< MDR_TIMER1 DMA_RE4: CNT_ZERO_DMAE (Bit 0)             */
#define MDR_TIMER1_DMA_RE4_CNT_ZERO_DMAE_Msk (0x1UL)                /*!< MDR_TIMER1 DMA_RE4: CNT_ZERO_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE4_CNT_ARR_DMAE_Pos (1UL)                   /*!< MDR_TIMER1 DMA_RE4: CNT_ARR_DMAE (Bit 1)              */
#define MDR_TIMER1_DMA_RE4_CNT_ARR_DMAE_Msk (0x2UL)                 /*!< MDR_TIMER1 DMA_RE4: CNT_ARR_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE4_ETR_RE_DMAE_Pos (2UL)                    /*!< MDR_TIMER1 DMA_RE4: ETR_RE_DMAE (Bit 2)               */
#define MDR_TIMER1_DMA_RE4_ETR_RE_DMAE_Msk (0x4UL)                  /*!< MDR_TIMER1 DMA_RE4: ETR_RE_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE4_ETR_FE_DMAE_Pos (3UL)                    /*!< MDR_TIMER1 DMA_RE4: ETR_FE_DMAE (Bit 3)               */
#define MDR_TIMER1_DMA_RE4_ETR_FE_DMAE_Msk (0x8UL)                  /*!< MDR_TIMER1 DMA_RE4: ETR_FE_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE4_BRK_DMAE_Pos   (4UL)                     /*!< MDR_TIMER1 DMA_RE4: BRK_DMAE (Bit 4)                  */
#define MDR_TIMER1_DMA_RE4_BRK_DMAE_Msk   (0x10UL)                  /*!< MDR_TIMER1 DMA_RE4: BRK_DMAE (Bitfield-Mask: 0x01)    */
#define MDR_TIMER1_DMA_RE4_CCR_CAP_CH1_DMAE_Pos (5UL)               /*!< MDR_TIMER1 DMA_RE4: CCR_CAP_CH1_DMAE (Bit 5)          */
#define MDR_TIMER1_DMA_RE4_CCR_CAP_CH1_DMAE_Msk (0x20UL)            /*!< MDR_TIMER1 DMA_RE4: CCR_CAP_CH1_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE4_CCR_CAP_CH2_DMAE_Pos (6UL)               /*!< MDR_TIMER1 DMA_RE4: CCR_CAP_CH2_DMAE (Bit 6)          */
#define MDR_TIMER1_DMA_RE4_CCR_CAP_CH2_DMAE_Msk (0x40UL)            /*!< MDR_TIMER1 DMA_RE4: CCR_CAP_CH2_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE4_CCR_CAP_CH3_DMAE_Pos (7UL)               /*!< MDR_TIMER1 DMA_RE4: CCR_CAP_CH3_DMAE (Bit 7)          */
#define MDR_TIMER1_DMA_RE4_CCR_CAP_CH3_DMAE_Msk (0x80UL)            /*!< MDR_TIMER1 DMA_RE4: CCR_CAP_CH3_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE4_CCR_CAP_CH4_DMAE_Pos (8UL)               /*!< MDR_TIMER1 DMA_RE4: CCR_CAP_CH4_DMAE (Bit 8)          */
#define MDR_TIMER1_DMA_RE4_CCR_CAP_CH4_DMAE_Msk (0x100UL)           /*!< MDR_TIMER1 DMA_RE4: CCR_CAP_CH4_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE4_CCR_REF_CH1_DMAE_Pos (9UL)               /*!< MDR_TIMER1 DMA_RE4: CCR_REF_CH1_DMAE (Bit 9)          */
#define MDR_TIMER1_DMA_RE4_CCR_REF_CH1_DMAE_Msk (0x200UL)           /*!< MDR_TIMER1 DMA_RE4: CCR_REF_CH1_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE4_CCR_REF_CH2_DMAE_Pos (10UL)              /*!< MDR_TIMER1 DMA_RE4: CCR_REF_CH2_DMAE (Bit 10)         */
#define MDR_TIMER1_DMA_RE4_CCR_REF_CH2_DMAE_Msk (0x400UL)           /*!< MDR_TIMER1 DMA_RE4: CCR_REF_CH2_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE4_CCR_REF_CH3_DMAE_Pos (11UL)              /*!< MDR_TIMER1 DMA_RE4: CCR_REF_CH3_DMAE (Bit 11)         */
#define MDR_TIMER1_DMA_RE4_CCR_REF_CH3_DMAE_Msk (0x800UL)           /*!< MDR_TIMER1 DMA_RE4: CCR_REF_CH3_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE4_CCR_REF_CH4_DMAE_Pos (12UL)              /*!< MDR_TIMER1 DMA_RE4: CCR_REF_CH4_DMAE (Bit 12)         */
#define MDR_TIMER1_DMA_RE4_CCR_REF_CH4_DMAE_Msk (0x1000UL)          /*!< MDR_TIMER1 DMA_RE4: CCR_REF_CH4_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE4_CCR1_CAP_CH1_DMAE_Pos (13UL)             /*!< MDR_TIMER1 DMA_RE4: CCR1_CAP_CH1_DMAE (Bit 13)        */
#define MDR_TIMER1_DMA_RE4_CCR1_CAP_CH1_DMAE_Msk (0x2000UL)         /*!< MDR_TIMER1 DMA_RE4: CCR1_CAP_CH1_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE4_CCR1_CAP_CH2_DMAE_Pos (14UL)             /*!< MDR_TIMER1 DMA_RE4: CCR1_CAP_CH2_DMAE (Bit 14)        */
#define MDR_TIMER1_DMA_RE4_CCR1_CAP_CH2_DMAE_Msk (0x4000UL)         /*!< MDR_TIMER1 DMA_RE4: CCR1_CAP_CH2_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE4_CCR1_CAP_CH3_DMAE_Pos (15UL)             /*!< MDR_TIMER1 DMA_RE4: CCR1_CAP_CH3_DMAE (Bit 15)        */
#define MDR_TIMER1_DMA_RE4_CCR1_CAP_CH3_DMAE_Msk (0x8000UL)         /*!< MDR_TIMER1 DMA_RE4: CCR1_CAP_CH3_DMAE (Bitfield-Mask: 0x01) */
#define MDR_TIMER1_DMA_RE4_CCR1_CAP_CH4_DMAE_Pos (16UL)             /*!< MDR_TIMER1 DMA_RE4: CCR1_CAP_CH4_DMAE (Bit 16)        */
#define MDR_TIMER1_DMA_RE4_CCR1_CAP_CH4_DMAE_Msk (0x10000UL)        /*!< MDR_TIMER1 DMA_RE4: CCR1_CAP_CH4_DMAE (Bitfield-Mask: 0x01) */


/* =========================================================================================================================== */
/* ================                                         MDR_SSP1                                          ================ */
/* =========================================================================================================================== */

