StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
/* ==========================================================  CR0  ========================================================== */
#define MDR_SSP1_CR0_DSS_Pos              (0UL)                     /*!< MDR_SSP1 CR0: DSS (Bit 0)                             */
#define MDR_SSP1_CR0_DSS_Msk              (0xfUL)                   /*!< MDR_SSP1 CR0: DSS (Bitfield-Mask: 0x0f)               */
#define MDR_SSP1_CR0_FRF_Pos              (4UL)                     /*!< MDR_SSP1 CR0: FRF (Bit 4)                             */
#define MDR_SSP1_CR0_FRF_Msk              (0x30UL)                  /*!< MDR_SSP1 CR0: FRF (Bitfield-Mask: 0x03)               */
#define MDR_SSP1_CR0_SPO_Pos              (6UL)                     /*!< MDR_SSP1 CR0: SPO (Bit 6)                             */
#define MDR_SSP1_CR0_SPO_Msk              (0x40UL)                  /*!< MDR_SSP1 CR0: SPO (Bitfield-Mask: 0x01)               */
#define MDR_SSP1_CR0_SPH_Pos              (7UL)                     /*!< MDR_SSP1 CR0: SPH (Bit 7)                             */
#define MDR_SSP1_CR0_SPH_Msk              (0x80UL)                  /*!< MDR_SSP1 CR0: SPH (Bitfield-Mask: 0x01)               */
#define MDR_SSP1_CR0_SCR_Pos              (8UL)                     /*!< MDR_SSP1 CR0: SCR (Bit 8)                             */
#define MDR_SSP1_CR0_SCR_Msk              (0xff00UL)                /*!< MDR_SSP1 CR0: SCR (Bitfield-Mask: 0xff)               */
/* ==========================================================  CR1  ========================================================== */
#define MDR_SSP1_CR1_LBM_Pos              (0UL)                     /*!< MDR_SSP1 CR1: LBM (Bit 0)                             */
#define MDR_SSP1_CR1_LBM_Msk              (0x1UL)                   /*!< MDR_SSP1 CR1: LBM (Bitfield-Mask: 0x01)               */
#define MDR_SSP1_CR1_SSE_Pos              (1UL)                     /*!< MDR_SSP1 CR1: SSE (Bit 1)                             */
#define MDR_SSP1_CR1_SSE_Msk              (0x2UL)                   /*!< MDR_SSP1 CR1: SSE (Bitfield-Mask: 0x01)               */
#define MDR_SSP1_CR1_MS_Pos               (2UL)                     /*!< MDR_SSP1 CR1: MS (Bit 2)                              */
#define MDR_SSP1_CR1_MS_Msk               (0x4UL)                   /*!< MDR_SSP1 CR1: MS (Bitfield-Mask: 0x01)                */
#define MDR_SSP1_CR1_SOD_Pos              (3UL)                     /*!< MDR_SSP1 CR1: SOD (Bit 3)                             */
#define MDR_SSP1_CR1_SOD_Msk              (0x8UL)                   /*!< MDR_SSP1 CR1: SOD (Bitfield-Mask: 0x01)               */
/* ==========================================================  DR  =========================================================== */
#define MDR_SSP1_DR_Data_Pos              (0UL)                     /*!< MDR_SSP1 DR: Data (Bit 0)                             */
#define MDR_SSP1_DR_Data_Msk              (0xffffUL)                /*!< MDR_SSP1 DR: Data (Bitfield-Mask: 0xffff)             */
/* ==========================================================  SR  =========================================================== */
#define MDR_SSP1_SR_TFE_Pos               (0UL)                     /*!< MDR_SSP1 SR: TFE (Bit 0)                              */
#define MDR_SSP1_SR_TFE_Msk               (0x1UL)                   /*!< MDR_SSP1 SR: TFE (Bitfield-Mask: 0x01)                */
#define MDR_SSP1_SR_TNF_Pos               (1UL)                     /*!< MDR_SSP1 SR: TNF (Bit 1)                              */
#define MDR_SSP1_SR_TNF_Msk               (0x2UL)                   /*!< MDR_SSP1 SR: TNF (Bitfield-Mask: 0x01)                */
#define MDR_SSP1_SR_RNE_Pos               (2UL)                     /*!< MDR_SSP1 SR: RNE (Bit 2)                              */
#define MDR_SSP1_SR_RNE_Msk               (0x4UL)                   /*!< MDR_SSP1 SR: RNE (Bitfield-Mask: 0x01)                */
#define MDR_SSP1_SR_RFF_Pos               (3UL)                     /*!< MDR_SSP1 SR: RFF (Bit 3)                              */
#define MDR_SSP1_SR_RFF_Msk               (0x8UL)                   /*!< MDR_SSP1 SR: RFF (Bitfield-Mask: 0x01)                */
#define MDR_SSP1_SR_BSY_Pos               (4UL)                     /*!< MDR_SSP1 SR: BSY (Bit 4)                              */
#define MDR_SSP1_SR_BSY_Msk               (0x10UL)                  /*!< MDR_SSP1 SR: BSY (Bitfield-Mask: 0x01)                */
/* =========================================================  CPSR  ========================================================== */
#define MDR_SSP1_CPSR_CPSDVSR_Pos         (0UL)                     /*!< MDR_SSP1 CPSR: CPSDVSR (Bit 0)                        */
#define MDR_SSP1_CPSR_CPSDVSR_Msk         (0xffUL)                  /*!< MDR_SSP1 CPSR: CPSDVSR (Bitfield-Mask: 0xff)          */
/* =========================================================  IMSC  ========================================================== */
#define MDR_SSP1_IMSC_RORIM_Pos           (0UL)                     /*!< MDR_SSP1 IMSC: RORIM (Bit 0)                          */
#define MDR_SSP1_IMSC_RORIM_Msk           (0x1UL)                   /*!< MDR_SSP1 IMSC: RORIM (Bitfield-Mask: 0x01)            */
#define MDR_SSP1_IMSC_RTIM_Pos            (1UL)                     /*!< MDR_SSP1 IMSC: RTIM (Bit 1)                           */
#define MDR_SSP1_IMSC_RTIM_Msk            (0x2UL)                   /*!< MDR_SSP1 IMSC: RTIM (Bitfield-Mask: 0x01)             */
#define MDR_SSP1_IMSC_RXIM_Pos            (2UL)                     /*!< MDR_SSP1 IMSC: RXIM (Bit 2)                           */
#define MDR_SSP1_IMSC_RXIM_Msk            (0x4UL)                   /*!< MDR_SSP1 IMSC: RXIM (Bitfield-Mask: 0x01)             */
#define MDR_SSP1_IMSC_TXIM_Pos            (3UL)                     /*!< MDR_SSP1 IMSC: TXIM (Bit 3)                           */
#define MDR_SSP1_IMSC_TXIM_Msk            (0x8UL)                   /*!< MDR_SSP1 IMSC: TXIM (Bitfield-Mask: 0x01)             */
/* ==========================================================  RIS  ========================================================== */
#define MDR_SSP1_RIS_RORRIS_Pos           (0UL)                     /*!< MDR_SSP1 RIS: RORRIS (Bit 0)                          */
#define MDR_SSP1_RIS_RORRIS_Msk           (0x1UL)                   /*!< MDR_SSP1 RIS: RORRIS (Bitfield-Mask: 0x01)            */
#define MDR_SSP1_RIS_RTRIS_Pos            (1UL)                     /*!< MDR_SSP1 RIS: RTRIS (Bit 1)                           */
#define MDR_SSP1_RIS_RTRIS_Msk            (0x2UL)                   /*!< MDR_SSP1 RIS: RTRIS (Bitfield-Mask: 0x01)             */
#define MDR_SSP1_RIS_RXRIS_Pos            (2UL)                     /*!< MDR_SSP1 RIS: RXRIS (Bit 2)                           */
#define MDR_SSP1_RIS_RXRIS_Msk            (0x4UL)                   /*!< MDR_SSP1 RIS: RXRIS (Bitfield-Mask: 0x01)             */
#define MDR_SSP1_RIS_TXRIS_Pos            (3UL)                     /*!< MDR_SSP1 RIS: TXRIS (Bit 3)                           */
#define MDR_SSP1_RIS_TXRIS_Msk            (0x8UL)                   /*!< MDR_SSP1 RIS: TXRIS (Bitfield-Mask: 0x01)             */
/* ==========================================================  MIS  ========================================================== */
#define MDR_SSP1_MIS_RORMIS_Pos           (0UL)                     /*!< MDR_SSP1 MIS: RORMIS (Bit 0)                          */
#define MDR_SSP1_MIS_RORMIS_Msk           (0x1UL)                   /*!< MDR_SSP1 MIS: RORMIS (Bitfield-Mask: 0x01)            */
#define MDR_SSP1_MIS_RTMIS_Pos            (1UL)                     /*!< MDR_SSP1 MIS: RTMIS (Bit 1)                           */
#define MDR_SSP1_MIS_RTMIS_Msk            (0x2UL)                   /*!< MDR_SSP1 MIS: RTMIS (Bitfield-Mask: 0x01)             */
#define MDR_SSP1_MIS_RXMIS_Pos            (2UL)                     /*!< MDR_SSP1 MIS: RXMIS (Bit 2)                           */
#define MDR_SSP1_MIS_RXMIS_Msk            (0x4UL)                   /*!< MDR_SSP1 MIS: RXMIS (Bitfield-Mask: 0x01)             */
#define MDR_SSP1_MIS_TXMIS_Pos            (3UL)                     /*!< MDR_SSP1 MIS: TXMIS (Bit 3)                           */
#define MDR_SSP1_MIS_TXMIS_Msk            (0x8UL)                   /*!< MDR_SSP1 MIS: TXMIS (Bitfield-Mask: 0x01)             */
/* ==========================================================  ICR  ========================================================== */
#define MDR_SSP1_ICR_RORIC_Pos            (0UL)                     /*!< MDR_SSP1 ICR: RORIC (Bit 0)                           */
#define MDR_SSP1_ICR_RORIC_Msk            (0x1UL)                   /*!< MDR_SSP1 ICR: RORIC (Bitfield-Mask: 0x01)             */
#define MDR_SSP1_ICR_RTIC_Pos             (1UL)                     /*!< MDR_SSP1 ICR: RTIC (Bit 1)                            */
#define MDR_SSP1_ICR_RTIC_Msk             (0x2UL)                   /*!< MDR_SSP1 ICR: RTIC (Bitfield-Mask: 0x01)              */
/* =========================================================  DMACR  ========================================================= */
#define MDR_SSP1_DMACR_RXDMAE_Pos         (0UL)                     /*!< MDR_SSP1 DMACR: RXDMAE (Bit 0)                        */
#define MDR_SSP1_DMACR_RXDMAE_Msk         (0x1UL)                   /*!< MDR_SSP1 DMACR: RXDMAE (Bitfield-Mask: 0x01)          */
#define MDR_SSP1_DMACR_TXDMAE_Pos         (1UL)                     /*!< MDR_SSP1 DMACR: TXDMAE (Bit 1)                        */
#define MDR_SSP1_DMACR_TXDMAE_Msk         (0x2UL)                   /*!< MDR_SSP1 DMACR: TXDMAE (Bitfield-Mask: 0x01)          */


/* =========================================================================================================================== */
/* ================                                         MDR_PORTA                                         ================ */
/* =========================================================================================================================== */

/* =========================================================  RXTX  ========================================================== */
#define MDR_PORTA_RXTX_Pin__Pos           (0UL)                     /*!< MDR_PORTA RXTX: Pin_ (Bit 0)                          */
#define MDR_PORTA_RXTX_Pin__Msk           (0x1UL)                   /*!< MDR_PORTA RXTX: Pin_ (Bitfield-Mask: 0x01)            */
/* ==========================================================  OE  =========================================================== */
#define MDR_PORTA_OE_Pin__Pos             (0UL)                     /*!< MDR_PORTA OE: Pin_ (Bit 0)                            */
#define MDR_PORTA_OE_Pin__Msk             (0x1UL)                   /*!< MDR_PORTA OE: Pin_ (Bitfield-Mask: 0x01)              */
/* =========================================================  FUNC  ========================================================== */
#define MDR_PORTA_FUNC_Pin__Pos           (0UL)                     /*!< MDR_PORTA FUNC: Pin_ (Bit 0)                          */
#define MDR_PORTA_FUNC_Pin__Msk           (0x3UL)                   /*!< MDR_PORTA FUNC: Pin_ (Bitfield-Mask: 0x03)            */
/* ========================================================  ANALOG  ========================================================= */
#define MDR_PORTA_ANALOG_Pin__Pos         (0UL)                     /*!< MDR_PORTA ANALOG: Pin_ (Bit 0)                        */
#define MDR_PORTA_ANALOG_Pin__Msk         (0x1UL)                   /*!< MDR_PORTA ANALOG: Pin_ (Bitfield-Mask: 0x01)          */
/* =========================================================  PULL  ========================================================== */
#define MDR_PORTA_PULL_Down_Pin_0_Pos     (0UL)                     /*!< MDR_PORTA PULL: Down_Pin_0 (Bit 0)                    */
#define MDR_PORTA_PULL_Down_Pin_0_Msk     (0x1UL)                   /*!< MDR_PORTA PULL: Down_Pin_0 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PULL_Down_Pin_1_Pos     (1UL)                     /*!< MDR_PORTA PULL: Down_Pin_1 (Bit 1)                    */
#define MDR_PORTA_PULL_Down_Pin_1_Msk     (0x2UL)                   /*!< MDR_PORTA PULL: Down_Pin_1 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PULL_Down_Pin_2_Pos     (2UL)                     /*!< MDR_PORTA PULL: Down_Pin_2 (Bit 2)                    */
#define MDR_PORTA_PULL_Down_Pin_2_Msk     (0x4UL)                   /*!< MDR_PORTA PULL: Down_Pin_2 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PULL_Down_Pin_3_Pos     (3UL)                     /*!< MDR_PORTA PULL: Down_Pin_3 (Bit 3)                    */
#define MDR_PORTA_PULL_Down_Pin_3_Msk     (0x8UL)                   /*!< MDR_PORTA PULL: Down_Pin_3 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PULL_Down_Pin_4_Pos     (4UL)                     /*!< MDR_PORTA PULL: Down_Pin_4 (Bit 4)                    */
#define MDR_PORTA_PULL_Down_Pin_4_Msk     (0x10UL)                  /*!< MDR_PORTA PULL: Down_Pin_4 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PULL_Down_Pin_5_Pos     (5UL)                     /*!< MDR_PORTA PULL: Down_Pin_5 (Bit 5)                    */
#define MDR_PORTA_PULL_Down_Pin_5_Msk     (0x20UL)                  /*!< MDR_PORTA PULL: Down_Pin_5 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PULL_Down_Pin_6_Pos     (6UL)                     /*!< MDR_PORTA PULL: Down_Pin_6 (Bit 6)                    */
#define MDR_PORTA_PULL_Down_Pin_6_Msk     (0x40UL)                  /*!< MDR_PORTA PULL: Down_Pin_6 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PULL_Down_Pin_7_Pos     (7UL)                     /*!< MDR_PORTA PULL: Down_Pin_7 (Bit 7)                    */
#define MDR_PORTA_PULL_Down_Pin_7_Msk     (0x80UL)                  /*!< MDR_PORTA PULL: Down_Pin_7 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PULL_Down_Pin_8_Pos     (8UL)                     /*!< MDR_PORTA PULL: Down_Pin_8 (Bit 8)                    */
#define MDR_PORTA_PULL_Down_Pin_8_Msk     (0x100UL)                 /*!< MDR_PORTA PULL: Down_Pin_8 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PULL_Down_Pin_9_Pos     (9UL)                     /*!< MDR_PORTA PULL: Down_Pin_9 (Bit 9)                    */
#define MDR_PORTA_PULL_Down_Pin_9_Msk     (0x200UL)                 /*!< MDR_PORTA PULL: Down_Pin_9 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PULL_Down_Pin_10_Pos    (10UL)                    /*!< MDR_PORTA PULL: Down_Pin_10 (Bit 10)                  */
#define MDR_PORTA_PULL_Down_Pin_10_Msk    (0x400UL)                 /*!< MDR_PORTA PULL: Down_Pin_10 (Bitfield-Mask: 0x01)     */
#define MDR_PORTA_PULL_Down_Pin_11_Pos    (11UL)                    /*!< MDR_PORTA PULL: Down_Pin_11 (Bit 11)                  */
#define MDR_PORTA_PULL_Down_Pin_11_Msk    (0x800UL)                 /*!< MDR_PORTA PULL: Down_Pin_11 (Bitfield-Mask: 0x01)     */
#define MDR_PORTA_PULL_Down_Pin_12_Pos    (12UL)                    /*!< MDR_PORTA PULL: Down_Pin_12 (Bit 12)                  */
#define MDR_PORTA_PULL_Down_Pin_12_Msk    (0x1000UL)                /*!< MDR_PORTA PULL: Down_Pin_12 (Bitfield-Mask: 0x01)     */
#define MDR_PORTA_PULL_Down_Pin_13_Pos    (13UL)                    /*!< MDR_PORTA PULL: Down_Pin_13 (Bit 13)                  */
#define MDR_PORTA_PULL_Down_Pin_13_Msk    (0x2000UL)                /*!< MDR_PORTA PULL: Down_Pin_13 (Bitfield-Mask: 0x01)     */
#define MDR_PORTA_PULL_Down_Pin_14_Pos    (14UL)                    /*!< MDR_PORTA PULL: Down_Pin_14 (Bit 14)                  */
#define MDR_PORTA_PULL_Down_Pin_14_Msk    (0x4000UL)                /*!< MDR_PORTA PULL: Down_Pin_14 (Bitfield-Mask: 0x01)     */
#define MDR_PORTA_PULL_Down_Pin_15_Pos    (15UL)                    /*!< MDR_PORTA PULL: Down_Pin_15 (Bit 15)                  */
#define MDR_PORTA_PULL_Down_Pin_15_Msk    (0x8000UL)                /*!< MDR_PORTA PULL: Down_Pin_15 (Bitfield-Mask: 0x01)     */
#define MDR_PORTA_PULL_UP_Pin__Pos        (16UL)                    /*!< MDR_PORTA PULL: UP_Pin_ (Bit 16)                      */
#define MDR_PORTA_PULL_UP_Pin__Msk        (0x10000UL)               /*!< MDR_PORTA PULL: UP_Pin_ (Bitfield-Mask: 0x01)         */
/* ==========================================================  PD  =========================================================== */
#define MDR_PORTA_PD_Driver_Pin_0_Pos     (0UL)                     /*!< MDR_PORTA PD: Driver_Pin_0 (Bit 0)                    */
#define MDR_PORTA_PD_Driver_Pin_0_Msk     (0x1UL)                   /*!< MDR_PORTA PD: Driver_Pin_0 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PD_Driver_Pin_1_Pos     (1UL)                     /*!< MDR_PORTA PD: Driver_Pin_1 (Bit 1)                    */
#define MDR_PORTA_PD_Driver_Pin_1_Msk     (0x2UL)                   /*!< MDR_PORTA PD: Driver_Pin_1 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PD_Driver_Pin_2_Pos     (2UL)                     /*!< MDR_PORTA PD: Driver_Pin_2 (Bit 2)                    */
#define MDR_PORTA_PD_Driver_Pin_2_Msk     (0x4UL)                   /*!< MDR_PORTA PD: Driver_Pin_2 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PD_Driver_Pin_3_Pos     (3UL)                     /*!< MDR_PORTA PD: Driver_Pin_3 (Bit 3)                    */
#define MDR_PORTA_PD_Driver_Pin_3_Msk     (0x8UL)                   /*!< MDR_PORTA PD: Driver_Pin_3 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PD_Driver_Pin_4_Pos     (4UL)                     /*!< MDR_PORTA PD: Driver_Pin_4 (Bit 4)                    */
#define MDR_PORTA_PD_Driver_Pin_4_Msk     (0x10UL)                  /*!< MDR_PORTA PD: Driver_Pin_4 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PD_Driver_Pin_5_Pos     (5UL)                     /*!< MDR_PORTA PD: Driver_Pin_5 (Bit 5)                    */
#define MDR_PORTA_PD_Driver_Pin_5_Msk     (0x20UL)                  /*!< MDR_PORTA PD: Driver_Pin_5 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PD_Driver_Pin_6_Pos     (6UL)                     /*!< MDR_PORTA PD: Driver_Pin_6 (Bit 6)                    */
#define MDR_PORTA_PD_Driver_Pin_6_Msk     (0x40UL)                  /*!< MDR_PORTA PD: Driver_Pin_6 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PD_Driver_Pin_7_Pos     (7UL)                     /*!< MDR_PORTA PD: Driver_Pin_7 (Bit 7)                    */
#define MDR_PORTA_PD_Driver_Pin_7_Msk     (0x80UL)                  /*!< MDR_PORTA PD: Driver_Pin_7 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PD_Driver_Pin_8_Pos     (8UL)                     /*!< MDR_PORTA PD: Driver_Pin_8 (Bit 8)                    */
#define MDR_PORTA_PD_Driver_Pin_8_Msk     (0x100UL)                 /*!< MDR_PORTA PD: Driver_Pin_8 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PD_Driver_Pin_9_Pos     (9UL)                     /*!< MDR_PORTA PD: Driver_Pin_9 (Bit 9)                    */
#define MDR_PORTA_PD_Driver_Pin_9_Msk     (0x200UL)                 /*!< MDR_PORTA PD: Driver_Pin_9 (Bitfield-Mask: 0x01)      */
#define MDR_PORTA_PD_Driver_Pin_10_Pos    (10UL)                    /*!< MDR_PORTA PD: Driver_Pin_10 (Bit 10)                  */
#define MDR_PORTA_PD_Driver_Pin_10_Msk    (0x400UL)                 /*!< MDR_PORTA PD: Driver_Pin_10 (Bitfield-Mask: 0x01)     */
#define MDR_PORTA_PD_Driver_Pin_11_Pos    (11UL)                    /*!< MDR_PORTA PD: Driver_Pin_11 (Bit 11)                  */
#define MDR_PORTA_PD_Driver_Pin_11_Msk    (0x800UL)                 /*!< MDR_PORTA PD: Driver_Pin_11 (Bitfield-Mask: 0x01)     */
#define MDR_PORTA_PD_Driver_Pin_12_Pos    (12UL)                    /*!< MDR_PORTA PD: Driver_Pin_12 (Bit 12)                  */
#define MDR_PORTA_PD_Driver_Pin_12_Msk    (0x1000UL)                /*!< MDR_PORTA PD: Driver_Pin_12 (Bitfield-Mask: 0x01)     */
#define MDR_PORTA_PD_Driver_Pin_13_Pos    (13UL)                    /*!< MDR_PORTA PD: Driver_Pin_13 (Bit 13)                  */
#define MDR_PORTA_PD_Driver_Pin_13_Msk    (0x2000UL)                /*!< MDR_PORTA PD: Driver_Pin_13 (Bitfield-Mask: 0x01)     */
#define MDR_PORTA_PD_Driver_Pin_14_Pos    (14UL)                    /*!< MDR_PORTA PD: Driver_Pin_14 (Bit 14)                  */
#define MDR_PORTA_PD_Driver_Pin_14_Msk    (0x4000UL)                /*!< MDR_PORTA PD: Driver_Pin_14 (Bitfield-Mask: 0x01)     */
#define MDR_PORTA_PD_Driver_Pin_15_Pos    (15UL)                    /*!< MDR_PORTA PD: Driver_Pin_15 (Bit 15)                  */
#define MDR_PORTA_PD_Driver_Pin_15_Msk    (0x8000UL)                /*!< MDR_PORTA PD: Driver_Pin_15 (Bitfield-Mask: 0x01)     */
#define MDR_PORTA_PD_Schmitt_Pin__Pos     (16UL)                    /*!< MDR_PORTA PD: Schmitt_Pin_ (Bit 16)                   */
#define MDR_PORTA_PD_Schmitt_Pin__Msk     (0x10000UL)               /*!< MDR_PORTA PD: Schmitt_Pin_ (Bitfield-Mask: 0x01)      */
/* ==========================================================  PWR  ========================================================== */
#define MDR_PORTA_PWR_Pin__Pos            (0UL)                     /*!< MDR_PORTA PWR: Pin_ (Bit 0)                           */
#define MDR_PORTA_PWR_Pin__Msk            (0x3UL)                   /*!< MDR_PORTA PWR: Pin_ (Bitfield-Mask: 0x03)             */
/* =========================================================  GFEN  ========================================================== */
#define MDR_PORTA_GFEN_Pin__Pos           (0UL)                     /*!< MDR_PORTA GFEN: Pin_ (Bit 0)                          */
#define MDR_PORTA_GFEN_Pin__Msk           (0x1UL)                   /*!< MDR_PORTA GFEN: Pin_ (Bitfield-Mask: 0x01)            */
/* =========================================================  SETTX  ========================================================= */
#define MDR_PORTA_SETTX_Pin__Pos          (0UL)                     /*!< MDR_PORTA SETTX: Pin_ (Bit 0)                         */
#define MDR_PORTA_SETTX_Pin__Msk          (0x1UL)                   /*!< MDR_PORTA SETTX: Pin_ (Bitfield-Mask: 0x01)           */
/* =========================================================  CLRTX  ========================================================= */
#define MDR_PORTA_CLRTX_Pin__Pos          (0UL)                     /*!< MDR_PORTA CLRTX: Pin_ (Bit 0)                         */
#define MDR_PORTA_CLRTX_Pin__Msk          (0x1UL)                   /*!< MDR_PORTA CLRTX: Pin_ (Bitfield-Mask: 0x01)           */
/* =========================================================  RDTX  ========================================================== */
#define MDR_PORTA_RDTX_Pin__Pos           (0UL)                     /*!< MDR_PORTA RDTX: Pin_ (Bit 0)                          */
#define MDR_PORTA_RDTX_Pin__Msk           (0x1UL)                   /*!< MDR_PORTA RDTX: Pin_ (Bitfield-Mask: 0x01)            */

/** @} */ /* End of group PosMask_peripherals */


/* =========================================================================================================================== */
/* ================                             Enumerated Values Cluster Section                             ================ */
/* =========================================================================================================================== */


/** @addtogroup EnumValue_clusters
  * @{
  */



/* =========================================================================================================================== */
/* ================                                            BUF                                            ================ */
/* =========================================================================================================================== */

