StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
/* ==========================================================  ID  =========================================================== */
/* ==========================================================  DLC  ========================================================== */
/* ==================================================  BUF DLC DLC [0..3]  =================================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_DLC_DLC                                                      */
  MDR_CAN1_BUF_DLC_DLC_NoData          = 0,     /*!< NoData : Normal Operation                                                 */
  MDR_CAN1_BUF_DLC_DLC_Bytes_1         = 1,     /*!< Bytes_1 : Byte Count                                                      */
  MDR_CAN1_BUF_DLC_DLC_Bytes_2         = 2,     /*!< Bytes_2 : Byte Count                                                      */
  MDR_CAN1_BUF_DLC_DLC_Bytes_3         = 3,     /*!< Bytes_3 : Byte Count                                                      */
  MDR_CAN1_BUF_DLC_DLC_Bytes_4         = 4,     /*!< Bytes_4 : Byte Count                                                      */
  MDR_CAN1_BUF_DLC_DLC_Bytes_5         = 5,     /*!< Bytes_5 : Byte Count                                                      */
  MDR_CAN1_BUF_DLC_DLC_Bytes_6         = 6,     /*!< Bytes_6 : Byte Count                                                      */
  MDR_CAN1_BUF_DLC_DLC_Bytes_7         = 7,     /*!< Bytes_7 : Byte Count                                                      */
  MDR_CAN1_BUF_DLC_DLC_Bytes_8         = 8,     /*!< Bytes_8 : Byte Count                                                      */
} MDR_CAN1_BUF_DLC_DLC_Enum;

/* ==================================================  BUF DLC RTR [8..8]  =================================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_DLC_RTR                                                      */
  MDR_CAN1_BUF_DLC_RTR_Off             = 0,     /*!< Off : Disabled                                                            */
  MDR_CAN1_BUF_DLC_RTR_On              = 1,     /*!< On : Enabled                                                              */
} MDR_CAN1_BUF_DLC_RTR_Enum;

/* ===================================================  BUF DLC R1 [9..9]  =================================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_DLC_R1                                                       */
  MDR_CAN1_BUF_DLC_R1_Off              = 0,     /*!< Off : Disabled                                                            */
  MDR_CAN1_BUF_DLC_R1_On               = 1,     /*!< On : Enabled                                                              */
} MDR_CAN1_BUF_DLC_R1_Enum;

/* ==================================================  BUF DLC R0 [10..10]  ================================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_DLC_R0                                                       */
  MDR_CAN1_BUF_DLC_R0_Off              = 0,     /*!< Off : Disabled                                                            */
  MDR_CAN1_BUF_DLC_R0_On               = 1,     /*!< On : Enabled                                                              */
} MDR_CAN1_BUF_DLC_R0_Enum;

/* =================================================  BUF DLC SRR [11..11]  ================================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_DLC_SRR                                                      */
  MDR_CAN1_BUF_DLC_SRR_Off             = 0,     /*!< Off : Disabled                                                            */
  MDR_CAN1_BUF_DLC_SRR_On              = 1,     /*!< On : Enabled                                                              */
} MDR_CAN1_BUF_DLC_SRR_Enum;

/* =================================================  BUF DLC IDE [12..12]  ================================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_DLC_IDE                                                      */
  MDR_CAN1_BUF_DLC_IDE_Standard        = 0,     /*!< Standard : Standard frame                                                 */
  MDR_CAN1_BUF_DLC_IDE_Extended        = 1,     /*!< Extended : Extended frame                                                 */
} MDR_CAN1_BUF_DLC_IDE_Enum;

/* =========================================================  DATAL  ========================================================= */
/* =========================================================  DATAH  ========================================================= */


/* =========================================================================================================================== */
/* ================                                          FILTER                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  MASK  ========================================================== */
/* ========================================================  FILTER  ========================================================= */

/** @} */ /* End of group EnumValue_clusters */


/* =========================================================================================================================== */
/* ================                           Enumerated Values Peripheral Section                            ================ */
/* =========================================================================================================================== */


/** @addtogroup EnumValue_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                        MDR_EEPROM                                         ================ */
/* =========================================================================================================================== */

/* ==========================================================  CMD  ========================================================== */
/* ===============================================  MDR_EEPROM CMD CON [0..0]  =============================================== */
typedef enum {                                  /*!< MDR_EEPROM_CMD_CON                                                        */
  MDR_EEPROM_CMD__CON__Normal Access   = 0,     /*!< Normal Access : Normal access to memory                                   */
  MDR_EEPROM_CMD__CON__Controller Access = 1,   /*!< Controller Access : Access to memory though registers                     */
} MDR_EEPROM_CMD__CON__Enum;

/* ===============================================  MDR_EEPROM CMD WR [1..1]  ================================================ */
typedef enum {                                  /*!< MDR_EEPROM_CMD_WR                                                         */
  MDR_EEPROM_CMD__WR__Inactive         = 0,     /*!< Inactive : No write operation                                             */
  MDR_EEPROM_CMD__WR__Active           = 1,     /*!< Active : Write operation                                                  */
} MDR_EEPROM_CMD__WR__Enum;

/* ===============================================  MDR_EEPROM CMD RD [2..2]  ================================================ */
typedef enum {                                  /*!< MDR_EEPROM_CMD_RD                                                         */
  MDR_EEPROM_CMD__RD__Inactive         = 0,     /*!< Inactive : No read operation                                              */
  MDR_EEPROM_CMD__RD__Active           = 1,     /*!< Active : Read operation                                                   */
} MDR_EEPROM_CMD__RD__Enum;

/* ==============================================  MDR_EEPROM CMD DELAY [3..5]  ============================================== */
typedef enum {                                  /*!< MDR_EEPROM_CMD_DELAY                                                      */
  MDR_EEPROM_CMD__DELAY__le25MHz       = 0,     /*!< le25MHz : CPU freq is up to 25MHz                                         */
  MDR_EEPROM_CMD__DELAY__le50MHz       = 1,     /*!< le50MHz : CPU freq is up to 50MHz                                         */
  MDR_EEPROM_CMD__DELAY__le75MHz       = 2,     /*!< le75MHz : CPU freq is up to 75MHz                                         */
  MDR_EEPROM_CMD__DELAY__le100MHz      = 3,     /*!< le100MHz : CPU freq is up to 100MHz                                       */
  MDR_EEPROM_CMD__DELAY__le125MHz      = 4,     /*!< le125MHz : CPU freq is up to 125MHz                                       */
  MDR_EEPROM_CMD__DELAY__le150MHz      = 5,     /*!< le150MHz : CPU freq is up to 150MHz                                       */
  MDR_EEPROM_CMD__DELAY__le175MHz      = 6,     /*!< le175MHz : CPU freq is up to 175MHz                                       */
  MDR_EEPROM_CMD__DELAY__le200MHz      = 7,     /*!< le200MHz : CPU freq is up to 200MHz                                       */
} MDR_EEPROM_CMD__DELAY__Enum;

/* ===============================================  MDR_EEPROM CMD XE [6..6]  ================================================ */
typedef enum {                                  /*!< MDR_EEPROM_CMD_XE                                                         */
  MDR_EEPROM_CMD__XE__Off              = 0,     /*!< Off : Disable                                                             */
  MDR_EEPROM_CMD__XE__On               = 1,     /*!< On : Enable                                                               */
} MDR_EEPROM_CMD__XE__Enum;

/* ===============================================  MDR_EEPROM CMD YE [7..7]  ================================================ */
typedef enum {                                  /*!< MDR_EEPROM_CMD_YE                                                         */
  MDR_EEPROM_CMD_YE_Off                = 0,     /*!< Off : Disable                                                             */
  MDR_EEPROM_CMD_YE_On                 = 1,     /*!< On : Enable                                                               */
} MDR_EEPROM_CMD_YE_Enum;

/* ===============================================  MDR_EEPROM CMD SE [8..8]  ================================================ */
typedef enum {                                  /*!< MDR_EEPROM_CMD_SE                                                         */
  MDR_EEPROM_CMD_SE_Off                = 0,     /*!< Off : Disable                                                             */
  MDR_EEPROM_CMD_SE_On                 = 1,     /*!< On : Enable                                                               */
} MDR_EEPROM_CMD_SE_Enum;

/* ==============================================  MDR_EEPROM CMD IFREN [9..9]  ============================================== */
typedef enum {                                  /*!< MDR_EEPROM_CMD_IFREN                                                      */
  MDR_EEPROM_CMD__IFREN__Main          = 0,     /*!< Main : Main memory                                                        */
  MDR_EEPROM_CMD__IFREN__Info          = 1,     /*!< Info : Info memory                                                        */
} MDR_EEPROM_CMD__IFREN__Enum;

/* =============================================  MDR_EEPROM CMD ERASE [10..10]  ============================================= */
typedef enum {                                  /*!< MDR_EEPROM_CMD_ERASE                                                      */
  MDR_EEPROM_CMD__ERASE__Inactive      = 0,     /*!< Inactive : No erase operation                                             */
  MDR_EEPROM_CMD__ERASE__Active        = 1,     /*!< Active : Erase operation                                                  */
} MDR_EEPROM_CMD__ERASE__Enum;

/* =============================================  MDR_EEPROM CMD MAS1 [11..11]  ============================================== */
typedef enum {                                  /*!< MDR_EEPROM_CMD_MAS1                                                       */
  MDR_EEPROM_CMD_MAS1_Off              = 0,     /*!< Off : Disable                                                             */
  MDR_EEPROM_CMD_MAS1_On               = 1,     /*!< On : Enable                                                               */
} MDR_EEPROM_CMD_MAS1_Enum;

