StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
/* =============================================  MDR_EEPROM CMD PROG [12..12]  ============================================== */
typedef enum {                                  /*!< MDR_EEPROM_CMD_PROG                                                       */
  MDR_EEPROM_CMD__PROG__Inactive       = 0,     /*!< Inactive : No programm operation                                          */
  MDR_EEPROM_CMD__PROG__Active         = 1,     /*!< Active : Programm operation                                               */
} MDR_EEPROM_CMD__PROG__Enum;

/* =============================================  MDR_EEPROM CMD NVSTR [13..13]  ============================================= */
typedef enum {                                  /*!< MDR_EEPROM_CMD_NVSTR                                                      */
  MDR_EEPROM_CMD__NVSTR__Read          = 0,     /*!< Read : Read mode                                                          */
  MDR_EEPROM_CMD__NVSTR__Write         = 1,     /*!< Write : Programming or erase mode                                         */
} MDR_EEPROM_CMD__NVSTR__Enum;

/* =========================================================  ADDR  ========================================================== */
/* ==========================================================  DI  =========================================================== */
/* ==========================================================  DO  =========================================================== */
/* ==========================================================  KEY  ========================================================== */


/* =========================================================================================================================== */
/* ================                                       MDR_RST_CLOCK                                       ================ */
/* =========================================================================================================================== */

/* =====================================================  CLOCK_STATUS  ====================================================== */
/* =====================================  MDR_RST_CLOCK CLOCK_STATUS PLL_USB_RDY [0..0]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_CLOCK_STATUS_PLL_USB_RDY                                    */
  MDR_RST__STATUS__PLL_USB_RDY__NotReady = 0,   /*!< NotReady : PLL not ready                                                  */
  MDR_RST__STATUS__PLL_USB_RDY__Ready  = 1,     /*!< Ready : PLL ready                                                         */
} MDR_RST__STATUS__PLL_USB_RDY__Enum;

/* =====================================  MDR_RST_CLOCK CLOCK_STATUS PLL_CPU_RDY [1..1]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_CLOCK_STATUS_PLL_CPU_RDY                                    */
  MDR_RST__STATUS__PLL_CPU_RDY__NotReady = 0,   /*!< NotReady : PLL not ready                                                  */
  MDR_RST__STATUS__PLL_CPU_RDY__Ready  = 1,     /*!< Ready : PLL ready                                                         */
} MDR_RST__STATUS__PLL_CPU_RDY__Enum;

/* =======================================  MDR_RST_CLOCK CLOCK_STATUS HSE_RDY [2..2]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_CLOCK_STATUS_HSE_RDY                                        */
  MDR_RST__STATUS__HSE_RDY__NotReady   = 0,     /*!< NotReady : HSE not ready                                                  */
  MDR_RST__STATUS__HSE_RDY__Ready      = 1,     /*!< Ready : HSE ready                                                         */
} MDR_RST__STATUS__HSE_RDY__Enum;

/* ======================================  MDR_RST_CLOCK CLOCK_STATUS HSE2_RDY [3..3]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_CLOCK_STATUS_HSE2_RDY                                       */
  MDR_RST__STATUS__HSE2_RDY__NotReady  = 0,     /*!< NotReady : HSE2 not ready                                                 */
  MDR_RST__STATUS__HSE2_RDY__Ready     = 1,     /*!< Ready : HSE2 ready                                                        */
} MDR_RST__STATUS__HSE2_RDY__Enum;

/* ======================================================  PLL_CONTROL  ====================================================== */
/* ======================================  MDR_RST_CLOCK PLL_CONTROL PLL_USB_ON [0..0]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL_CONTROL_PLL_USB_ON                                      */
  MDR_RST__PLL__USB_EN__Off            = 0,     /*!< Off : PLL Off                                                             */
  MDR_RST__PLL__USB_EN__On             = 1,     /*!< On : PLL On                                                               */
} MDR_RST__PLL__USB_EN__Enum;

/* =====================================  MDR_RST_CLOCK PLL_CONTROL PLL_USB_PLD [1..1]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL_CONTROL_PLL_USB_PLD                                     */
  MDR_RST__PLL__USB_PLD__RestartOff    = 0,     /*!< RestartOff : PLL restart inactive                                         */
  MDR_RST__PLL__USB_PLD__DoRestart     = 1,     /*!< DoRestart : PLL Do Restart                                                */
} MDR_RST__PLL__USB_PLD__Enum;

/* ======================================  MDR_RST_CLOCK PLL_CONTROL PLL_CPU_ON [2..2]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL_CONTROL_PLL_CPU_ON                                      */
  MDR_RST__PLL__CPU_EN__Off            = 0,     /*!< Off : PLL Off                                                             */
  MDR_RST__PLL__CPU_EN__On             = 1,     /*!< On : PLL On                                                               */
} MDR_RST__PLL__CPU_EN__Enum;

/* =====================================  MDR_RST_CLOCK PLL_CONTROL PLL_CPU_PLD [3..3]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL_CONTROL_PLL_CPU_PLD                                     */
  MDR_RST__PLL__CPU_PLD__RestartOff    = 0,     /*!< RestartOff : PLL restart inactive                                         */
  MDR_RST__PLL__CPU_PLD__DoRestart     = 1,     /*!< DoRestart : PLL Do Restart                                                */
} MDR_RST__PLL__CPU_PLD__Enum;

