StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
/* =====================================  MDR_RST_CLOCK PLL_CONTROL PLL_USB_MUL [4..7]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL_CONTROL_PLL_USB_MUL                                     */
  MDR_RST__PLL__USB_MUL__x1            = 0,     /*!< x1 : PLL mul x1                                                           */
  MDR_RST__PLL__USB_MUL__x2            = 1,     /*!< x2 : PLL mul x2                                                           */
  MDR_RST__PLL__USB_MUL__x3            = 2,     /*!< x3 : PLL mul x3                                                           */
  MDR_RST__PLL__USB_MUL__x4            = 3,     /*!< x4 : PLL mul x4                                                           */
  MDR_RST__PLL__USB_MUL__x5            = 4,     /*!< x5 : PLL mul x5                                                           */
  MDR_RST__PLL__USB_MUL__x6            = 5,     /*!< x6 : PLL mul x6                                                           */
  MDR_RST__PLL__USB_MUL__x7            = 6,     /*!< x7 : PLL mul x7                                                           */
  MDR_RST__PLL__USB_MUL__x8            = 7,     /*!< x8 : PLL mul x8                                                           */
  MDR_RST__PLL__USB_MUL__x9            = 8,     /*!< x9 : PLL mul x9                                                           */
  MDR_RST__PLL__USB_MUL__x10           = 9,     /*!< x10 : PLL mul x10                                                         */
  MDR_RST__PLL__USB_MUL__x11           = 10,    /*!< x11 : PLL mul x11                                                         */
  MDR_RST__PLL__USB_MUL__x12           = 11,    /*!< x12 : PLL mul x12                                                         */
  MDR_RST__PLL__USB_MUL__x13           = 12,    /*!< x13 : PLL mul x13                                                         */
  MDR_RST__PLL__USB_MUL__x14           = 13,    /*!< x14 : PLL mul x14                                                         */
  MDR_RST__PLL__USB_MUL__x15           = 14,    /*!< x15 : PLL mul x15                                                         */
  MDR_RST__PLL__USB_MUL__x16           = 15,    /*!< x16 : PLL mul x16                                                         */
} MDR_RST__PLL__USB_MUL__Enum;

/* =====================================  MDR_RST_CLOCK PLL_CONTROL PLL_CPU_MUL [8..11]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PLL_CONTROL_PLL_CPU_MUL                                     */
  MDR_RST__PLL__CPU_MUL__x1            = 0,     /*!< x1 : PLL mul x1                                                           */
  MDR_RST__PLL__CPU_MUL__x2            = 1,     /*!< x2 : PLL mul x2                                                           */
  MDR_RST__PLL__CPU_MUL__x3            = 2,     /*!< x3 : PLL mul x3                                                           */
  MDR_RST__PLL__CPU_MUL__x4            = 3,     /*!< x4 : PLL mul x4                                                           */
  MDR_RST__PLL__CPU_MUL__x5            = 4,     /*!< x5 : PLL mul x5                                                           */
  MDR_RST__PLL__CPU_MUL__x6            = 5,     /*!< x6 : PLL mul x6                                                           */
  MDR_RST__PLL__CPU_MUL__x7            = 6,     /*!< x7 : PLL mul x7                                                           */
  MDR_RST__PLL__CPU_MUL__x8            = 7,     /*!< x8 : PLL mul x8                                                           */
  MDR_RST__PLL__CPU_MUL__x9            = 8,     /*!< x9 : PLL mul x9                                                           */
  MDR_RST__PLL__CPU_MUL__x10           = 9,     /*!< x10 : PLL mul x10                                                         */
  MDR_RST__PLL__CPU_MUL__x11           = 10,    /*!< x11 : PLL mul x11                                                         */
  MDR_RST__PLL__CPU_MUL__x12           = 11,    /*!< x12 : PLL mul x12                                                         */
  MDR_RST__PLL__CPU_MUL__x13           = 12,    /*!< x13 : PLL mul x13                                                         */
  MDR_RST__PLL__CPU_MUL__x14           = 13,    /*!< x14 : PLL mul x14                                                         */
  MDR_RST__PLL__CPU_MUL__x15           = 14,    /*!< x15 : PLL mul x15                                                         */
  MDR_RST__PLL__CPU_MUL__x16           = 15,    /*!< x16 : PLL mul x16                                                         */
} MDR_RST__PLL__CPU_MUL__Enum;

/* ======================================================  HS_CONTROL  ======================================================= */
/* ========================================  MDR_RST_CLOCK HS_CONTROL HSE_ON [0..0]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_HS_CONTROL_HSE_ON                                           */
  MDR_RST__HS__HSE_EN__Off             = 0,     /*!< Off : HSE Off                                                             */
  MDR_RST__HS__HSE_EN__On              = 1,     /*!< On : HSE On                                                               */
} MDR_RST__HS__HSE_EN__Enum;

/* ========================================  MDR_RST_CLOCK HS_CONTROL HSE_BYP [1..1]  ======================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_HS_CONTROL_HSE_BYP                                          */
  MDR_RST__HS__HSE_BYP__Off            = 0,     /*!< Off : HSE forms Clock from external oscillator                            */
  MDR_RST__HS__HSE_BYP__On             = 1,     /*!< On : HSE passes Clock from external generator                             */
} MDR_RST__HS__HSE_BYP__Enum;

/* ========================================  MDR_RST_CLOCK HS_CONTROL HSE2_ON [2..2]  ======================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_HS_CONTROL_HSE2_ON                                          */
  MDR_RST__HS__HSE2_EN__Off            = 0,     /*!< Off : HSE2 Off                                                            */
  MDR_RST__HS__HSE2_EN__On             = 1,     /*!< On : HSE2 On                                                              */
} MDR_RST__HS__HSE2_EN__Enum;

/* =======================================  MDR_RST_CLOCK HS_CONTROL HSE2_BYP [3..3]  ======================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_HS_CONTROL_HSE2_BYP                                         */
  MDR_RST__HS__HSE2_BYP__Off           = 0,     /*!< Off : HSE2 forms Clock from external oscillator                           */
  MDR_RST__HS__HSE2_BYP__On            = 1,     /*!< On : HSE2 passes Clock from external generator                            */
} MDR_RST__HS__HSE2_BYP__Enum;

/* =======================================================  CPU_CLOCK  ======================================================= */
/* =======================================  MDR_RST_CLOCK CPU_CLOCK CPU_C1_SEL [0..1]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_CPU_CLOCK_CPU_C1_SEL                                        */
  MDR_RST__CPU__C1__HSI                = 0,     /*!< HSI : CPU_C1 output is HSI                                                */
  MDR_RST__CPU__C1__HSI/2              = 1,     /*!< HSI/2 : CPU_C1 output is HSI/2                                            */
  MDR_RST__CPU__C1__HSE                = 2,     /*!< HSE : CPU_C1 output is HSE                                                */
  MDR_RST__CPU__C1__HSE/2              = 3,     /*!< HSE/2 : CPU_C1 output is HSE/2                                            */
} MDR_RST__CPU__C1__Enum;

/* =======================================  MDR_RST_CLOCK CPU_CLOCK CPU_C2_SEL [2..2]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_CPU_CLOCK_CPU_C2_SEL                                        */
  MDR_RST__CPU__C2__CPU_C1             = 0,     /*!< CPU_C1 : Freq from CPU_C1 mux direct                                      */
  MDR_RST__CPU__C2__PLLCPUo            = 1,     /*!< PLLCPUo : Freq from CPU_C1 mux through PLL                                */
} MDR_RST__CPU__C2__Enum;

