StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
/* =======================================  MDR_RST_CLOCK CPU_CLOCK CPU_C3_SEL [4..7]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_CPU_CLOCK_CPU_C3_SEL                                        */
  MDR_RST__CPU__C3__div1_0             = 0,     /*!< div1_0 : div by 1                                                         */
  MDR_RST__CPU__C3__div1_1             = 1,     /*!< div1_1 : div by 1                                                         */
  MDR_RST__CPU__C3__div1_2             = 2,     /*!< div1_2 : div by 1                                                         */
  MDR_RST__CPU__C3__div1_3             = 3,     /*!< div1_3 : div by 1                                                         */
  MDR_RST__CPU__C3__div1_4             = 4,     /*!< div1_4 : div by 1                                                         */
  MDR_RST__CPU__C3__div1_5             = 5,     /*!< div1_5 : div by 1                                                         */
  MDR_RST__CPU__C3__div1_6             = 6,     /*!< div1_6 : div by 1                                                         */
  MDR_RST__CPU__C3__div1_7             = 7,     /*!< div1_7 : div by 1                                                         */
  MDR_RST__CPU__C3__div2               = 8,     /*!< div2 : div by 2                                                           */
  MDR_RST__CPU__C3__div4               = 9,     /*!< div4 : div by 4                                                           */
  MDR_RST__CPU__C3__div8               = 10,    /*!< div8 : div by 8                                                           */
  MDR_RST__CPU__C3__div16              = 11,    /*!< div16 : div by 16                                                         */
  MDR_RST__CPU__C3__div32              = 12,    /*!< div32 : div by 32                                                         */
  MDR_RST__CPU__C3__div64              = 13,    /*!< div64 : div by 64                                                         */
  MDR_RST__CPU__C3__div128             = 14,    /*!< div128 : div by 128                                                       */
  MDR_RST__CPU__C3__div256             = 15,    /*!< div256 : div by 256                                                       */
} MDR_RST__CPU__C3__Enum;

/* ========================================  MDR_RST_CLOCK CPU_CLOCK HCLK_SEL [8..9]  ======================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_CPU_CLOCK_HCLK_SEL                                          */
  MDR_RST__CPU__HCLK__HSI              = 0,     /*!< HSI : CPU clock is HSI                                                    */
  MDR_RST__CPU__HCLK__CPU_C3           = 1,     /*!< CPU_C3 : CPU clock is CPU_C3 output                                       */
  MDR_RST__CPU__HCLK__LSE              = 2,     /*!< LSE : CPU clock is LSE                                                    */
  MDR_RST__CPU__HCLK__LSI              = 3,     /*!< LSI : CPU clock is LSI                                                    */
} MDR_RST__CPU__HCLK__Enum;

/* =======================================================  USB_CLOCK  ======================================================= */
/* =======================================  MDR_RST_CLOCK USB_CLOCK USB_C1_SEL [0..1]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_USB_CLOCK_USB_C1_SEL                                        */
  MDR_RST__USB__C1__HSI                = 0,     /*!< HSI : USB_C1 output is HSI                                                */
  MDR_RST__USB__C1__HSI/2              = 1,     /*!< HSI/2 : USB_C1 output is HSI/2                                            */
  MDR_RST__USB__C1__HSE                = 2,     /*!< HSE : USB_C1 output is HSE                                                */
  MDR_RST__USB__C1__HSE/2              = 3,     /*!< HSE/2 : USB_C1 output is HSE/2                                            */
} MDR_RST__USB__C1__Enum;

/* =======================================  MDR_RST_CLOCK USB_CLOCK USB_C2_SEL [2..2]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_USB_CLOCK_USB_C2_SEL                                        */
  MDR_RST__USB__C2__USB_C1             = 0,     /*!< USB_C1 : Freq from CPU_C1 mux direct                                      */
  MDR_RST__USB__C2__PLLUSBo            = 1,     /*!< PLLUSBo : Freq from CPU_C1 mux through PLL_USB                            */
} MDR_RST__USB__C2__Enum;

/* =======================================  MDR_RST_CLOCK USB_CLOCK USB_C3_SEL [4..4]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_USB_CLOCK_USB_C3_SEL                                        */
  MDR_RST__USB__C3__USB_C2             = 0,     /*!< USB_C2 : C3 Input is freq from C2                                         */
  MDR_RST__USB__C3__USB_C2_div2        = 1,     /*!< USB_C2_div2 : C3 Input is freq from C2/2                                  */
} MDR_RST__USB__C3__Enum;

/* =========================================  MDR_RST_CLOCK USB_CLOCK USB_EN [8..8]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_USB_CLOCK_USB_EN                                            */
  MDR_RST__USB__CLOCK__Off             = 0,     /*!< Off : Clock Disabled                                                      */
  MDR_RST__USB__CLOCK__On              = 1,     /*!< On : Clock Enabled                                                        */
} MDR_RST__USB__CLOCK__Enum;

/* =======================================================  ADC_CLOCK  ======================================================= */
/* =======================================  MDR_RST_CLOCK ADC_CLOCK ADC_C1_SEL [0..1]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_ADC_CLOCK_ADC_C1_SEL                                        */
  MDR_RST__ADC__C1__CPU_C1             = 0,     /*!< CPU_C1 : ADC_C1 output is CPU_C1                                          */
  MDR_RST__ADC__C1__USB_C1             = 1,     /*!< USB_C1 : ADC_C1 output is USB_C1                                          */
  MDR_RST__ADC__C1__CPU_C2             = 2,     /*!< CPU_C2 : ADC_C1 output is CPU_C2                                          */
  MDR_RST__ADC__C1__USB_C2             = 3,     /*!< USB_C2 : ADC_C1 output is USB_C2                                          */
} MDR_RST__ADC__C1__Enum;

/* =======================================  MDR_RST_CLOCK ADC_CLOCK ADC_C2_SEL [4..5]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_ADC_CLOCK_ADC_C2_SEL                                        */
  MDR_RST__ADC__C2__LSE                = 0,     /*!< LSE : ADC_C2 output is LSE                                                */
  MDR_RST__ADC__C2__LSI                = 1,     /*!< LSI : ADC_C2 output is LSI                                                */
  MDR_RST__ADC__C2__ADC_C1             = 2,     /*!< ADC_C1 : ADC_C2 output is ADC_C1                                          */
  MDR_RST__ADC__C2__HSI_C1             = 3,     /*!< HSI_C1 : ADC_C2 output is HSI_C1                                          */
} MDR_RST__ADC__C2__Enum;

/* ======================================  MDR_RST_CLOCK ADC_CLOCK ADC_C3_SEL [8..11]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL                                        */
  MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL_div1_0 = 0,/*!< div1_0 : div by 1                                                         */
  MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL_div1_1 = 1,/*!< div1_1 : div by 1                                                         */
  MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL_div1_2 = 2,/*!< div1_2 : div by 1                                                         */
  MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL_div1_3 = 3,/*!< div1_3 : div by 1                                                         */
  MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL_div1_4 = 4,/*!< div1_4 : div by 1                                                         */
  MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL_div1_5 = 5,/*!< div1_5 : div by 1                                                         */
  MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL_div1_6 = 6,/*!< div1_6 : div by 1                                                         */
  MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL_div1_7 = 7,/*!< div1_7 : div by 1                                                         */
  MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL_div2 = 8,  /*!< div2 : div by 2                                                           */
  MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL_div4 = 9,  /*!< div4 : div by 4                                                           */
  MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL_div8 = 10, /*!< div8 : div by 8                                                           */
  MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL_div16 = 11,/*!< div16 : div by 16                                                         */
  MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL_div32 = 12,/*!< div32 : div by 32                                                         */
  MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL_div64 = 13,/*!< div64 : div by 64                                                         */
  MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL_div128 = 14,/*!< div128 : div by 128                                                      */
  MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL_div256 = 15,/*!< div256 : div by 256                                                      */
} MDR_RST_CLOCK_ADC_CLOCK_ADC_C3_SEL_Enum;

