StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
/* =======================================  MDR_RST_CLOCK PER_CLOCK USB_CLK_EN [2..2]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_USB_CLK_EN                                        */
  MDR_RST__PER__SSP_CLOCK__Off         = 0,     /*!< Off : Clock Disabled                                                      */
  MDR_RST__PER__SSP_CLOCK__On          = 1,     /*!< On : Clock Enabled                                                        */
} MDR_RST__PER__SSP_CLOCK__Enum;

/* =====================================  MDR_RST_CLOCK PER_CLOCK EEPROM_CLK_EN [3..3]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_EEPROM_CLK_EN                                     */
  MDR_RST_CLOCK_PER_CLOCK_EEPROM_CLK_EN_Off = 0,/*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_EEPROM_CLK_EN_On = 1, /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_EEPROM_CLK_EN_Enum;

/* =======================================  MDR_RST_CLOCK PER_CLOCK RST_CLK_EN [4..4]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_RST_CLK_EN                                        */
  MDR_RST_CLOCK_PER_CLOCK_RST_CLK_EN_Off = 0,   /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_RST_CLK_EN_On = 1,    /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_RST_CLK_EN_Enum;

/* =======================================  MDR_RST_CLOCK PER_CLOCK DMA_CLK_EN [5..5]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_DMA_CLK_EN                                        */
  MDR_RST_CLOCK_PER_CLOCK_DMA_CLK_EN_Off = 0,   /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_DMA_CLK_EN_On = 1,    /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_DMA_CLK_EN_Enum;

/* ======================================  MDR_RST_CLOCK PER_CLOCK UART1_CLK_EN [6..6]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_UART1_CLK_EN                                      */
  MDR_RST_CLOCK_PER_CLOCK_UART1_CLK_EN_Off = 0, /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_UART1_CLK_EN_On = 1,  /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_UART1_CLK_EN_Enum;

/* ======================================  MDR_RST_CLOCK PER_CLOCK UART2_CLK_EN [7..7]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_UART2_CLK_EN                                      */
  MDR_RST_CLOCK_PER_CLOCK_UART2_CLK_EN_Off = 0, /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_UART2_CLK_EN_On = 1,  /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_UART2_CLK_EN_Enum;

/* ======================================  MDR_RST_CLOCK PER_CLOCK SPI1_CLK_EN [8..8]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_SPI1_CLK_EN                                       */
  MDR_RST_CLOCK_PER_CLOCK_SPI1_CLK_EN_Off = 0,  /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_SPI1_CLK_EN_On = 1,   /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_SPI1_CLK_EN_Enum;

/* ======================================  MDR_RST_CLOCK PER_CLOCK MIL1_CLK_EN [9..9]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_MIL1_CLK_EN                                       */
  MDR_RST_CLOCK_PER_CLOCK_MIL1_CLK_EN_Off = 0,  /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_MIL1_CLK_EN_On = 1,   /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_MIL1_CLK_EN_Enum;

/* =====================================  MDR_RST_CLOCK PER_CLOCK MIL2_CLK_EN [10..10]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_MIL2_CLK_EN                                       */
  MDR_RST_CLOCK_PER_CLOCK_MIL2_CLK_EN_Off = 0,  /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_MIL2_CLK_EN_On = 1,   /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_MIL2_CLK_EN_Enum;

/* ======================================  MDR_RST_CLOCK PER_CLOCK PWR_CLK_EN [11..11]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_PWR_CLK_EN                                        */
  MDR_RST_CLOCK_PER_CLOCK_PWR_CLK_EN_Off = 0,   /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_PWR_CLK_EN_On = 1,    /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_PWR_CLK_EN_Enum;

/* =====================================  MDR_RST_CLOCK PER_CLOCK WWDT_CLK_EN [12..12]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_WWDT_CLK_EN                                       */
  MDR_RST_CLOCK_PER_CLOCK_WWDT_CLK_EN_Off = 0,  /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_WWDT_CLK_EN_On = 1,   /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_WWDT_CLK_EN_Enum;

/* =====================================  MDR_RST_CLOCK PER_CLOCK IWDT_CLK_EN [13..13]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_IWDT_CLK_EN                                       */
  MDR_RST_CLOCK_PER_CLOCK_IWDT_CLK_EN_Off = 0,  /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_IWDT_CLK_EN_On = 1,   /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_IWDT_CLK_EN_Enum;

/* ====================================  MDR_RST_CLOCK PER_CLOCK TIMER1_CLK_EN [14..14]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_TIMER1_CLK_EN                                     */
  MDR_RST_CLOCK_PER_CLOCK_TIMER1_CLK_EN_Off = 0,/*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_TIMER1_CLK_EN_On = 1, /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_TIMER1_CLK_EN_Enum;

