StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
/* ====================================  MDR_RST_CLOCK PER_CLOCK TIMER2_CLK_EN [15..15]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_TIMER2_CLK_EN                                     */
  MDR_RST_CLOCK_PER_CLOCK_TIMER2_CLK_EN_Off = 0,/*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_TIMER2_CLK_EN_On = 1, /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_TIMER2_CLK_EN_Enum;

/* ====================================  MDR_RST_CLOCK PER_CLOCK TIMER3_CLK_EN [16..16]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_TIMER3_CLK_EN                                     */
  MDR_RST_CLOCK_PER_CLOCK_TIMER3_CLK_EN_Off = 0,/*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_TIMER3_CLK_EN_On = 1, /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_TIMER3_CLK_EN_Enum;

/* ======================================  MDR_RST_CLOCK PER_CLOCK ADC_CLK_EN [17..17]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_ADC_CLK_EN                                        */
  MDR_RST_CLOCK_PER_CLOCK_ADC_CLK_EN_Off = 0,   /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_ADC_CLK_EN_On = 1,    /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_ADC_CLK_EN_Enum;

/* ======================================  MDR_RST_CLOCK PER_CLOCK DAC_CLK_EN [18..18]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_DAC_CLK_EN                                        */
  MDR_RST_CLOCK_PER_CLOCK_DAC_CLK_EN_Off = 0,   /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_DAC_CLK_EN_On = 1,    /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_DAC_CLK_EN_Enum;

/* ====================================  MDR_RST_CLOCK PER_CLOCK TIMER4_CLK_EN [19..19]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_TIMER4_CLK_EN                                     */
  MDR_RST_CLOCK_PER_CLOCK_TIMER4_CLK_EN_Off = 0,/*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_TIMER4_CLK_EN_On = 1, /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_TIMER4_CLK_EN_Enum;

/* =====================================  MDR_RST_CLOCK PER_CLOCK SPI2_CLK_EN [20..20]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_SPI2_CLK_EN                                       */
  MDR_RST_CLOCK_PER_CLOCK_SPI2_CLK_EN_Off = 0,  /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_SPI2_CLK_EN_On = 1,   /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_SPI2_CLK_EN_Enum;

/* =====================================  MDR_RST_CLOCK PER_CLOCK PORTA_CLK_EN [21..21]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_PORTA_CLK_EN                                      */
  MDR_RST_CLOCK_PER_CLOCK_PORTA_CLK_EN_Off = 0, /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_PORTA_CLK_EN_On = 1,  /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_PORTA_CLK_EN_Enum;

/* =====================================  MDR_RST_CLOCK PER_CLOCK PORTB_CLK_EN [22..22]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_PORTB_CLK_EN                                      */
  MDR_RST_CLOCK_PER_CLOCK_PORTB_CLK_EN_Off = 0, /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_PORTB_CLK_EN_On = 1,  /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_PORTB_CLK_EN_Enum;

/* =====================================  MDR_RST_CLOCK PER_CLOCK PORTC_CLK_EN [23..23]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_PORTC_CLK_EN                                      */
  MDR_RST_CLOCK_PER_CLOCK_PORTC_CLK_EN_Off = 0, /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_PORTC_CLK_EN_On = 1,  /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_PORTC_CLK_EN_Enum;

/* =====================================  MDR_RST_CLOCK PER_CLOCK PORTD_CLK_EN [24..24]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_PORTD_CLK_EN                                      */
  MDR_RST_CLOCK_PER_CLOCK_PORTD_CLK_EN_Off = 0, /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_PORTD_CLK_EN_On = 1,  /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_PORTD_CLK_EN_Enum;

/* =====================================  MDR_RST_CLOCK PER_CLOCK PORTE_CLK_EN [25..25]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_PORTE_CLK_EN                                      */
  MDR_RST_CLOCK_PER_CLOCK_PORTE_CLK_EN_Off = 0, /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_PORTE_CLK_EN_On = 1,  /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_PORTE_CLK_EN_Enum;

/* ===================================  MDR_RST_CLOCK PER_CLOCK ARINC_RX_CLK_EN [26..26]  ==================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_ARINC_RX_CLK_EN                                   */
  MDR_RST_CLOCK_PER_CLOCK_ARINC_RX_CLK_EN_Off = 0,/*!< Off : Clock Disabled                                                    */
  MDR_RST_CLOCK_PER_CLOCK_ARINC_RX_CLK_EN_On = 1,/*!< On : Clock Enabled                                                       */
} MDR_RST_CLOCK_PER_CLOCK_ARINC_RX_CLK_EN_Enum;

/* ======================================  MDR_RST_CLOCK PER_CLOCK BKP_CLK_EN [27..27]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_BKP_CLK_EN                                        */
  MDR_RST_CLOCK_PER_CLOCK_BKP_CLK_EN_Off = 0,   /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_BKP_CLK_EN_On = 1,    /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_BKP_CLK_EN_Enum;

/* ===================================  MDR_RST_CLOCK PER_CLOCK ARINC_TX_CLK_EN [28..28]  ==================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_ARINC_TX_CLK_EN                                   */
  MDR_RST_CLOCK_PER_CLOCK_ARINC_TX_CLK_EN_Off = 0,/*!< Off : Clock Disabled                                                    */
  MDR_RST_CLOCK_PER_CLOCK_ARINC_TX_CLK_EN_On = 1,/*!< On : Clock Enabled                                                       */
} MDR_RST_CLOCK_PER_CLOCK_ARINC_TX_CLK_EN_Enum;

/* =====================================  MDR_RST_CLOCK PER_CLOCK PORTF_CLK_EN [29..29]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_PORTF_CLK_EN                                      */
  MDR_RST_CLOCK_PER_CLOCK_PORTF_CLK_EN_Off = 0, /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_PORTF_CLK_EN_On = 1,  /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_PORTF_CLK_EN_Enum;

/* ======================================  MDR_RST_CLOCK PER_CLOCK EBC_CLK_EN [30..30]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_EBC_CLK_EN                                        */
  MDR_RST_CLOCK_PER_CLOCK_EBC_CLK_EN_Off = 0,   /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_EBC_CLK_EN_On = 1,    /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_EBC_CLK_EN_Enum;

/* =====================================  MDR_RST_CLOCK PER_CLOCK SPI3_CLK_EN [31..31]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_PER_CLOCK_SPI3_CLK_EN                                       */
  MDR_RST_CLOCK_PER_CLOCK_SPI3_CLK_EN_Off = 0,  /*!< Off : Clock Disabled                                                      */
  MDR_RST_CLOCK_PER_CLOCK_SPI3_CLK_EN_On = 1,   /*!< On : Clock Enabled                                                        */
} MDR_RST_CLOCK_PER_CLOCK_SPI3_CLK_EN_Enum;

