StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
/* =======================================  MDR_RST_CLOCK TIM_CLOCK TIM3_BRG [16..18]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_TIM_CLOCK_TIM3_BRG                                          */
  MDR_RST_CLOCK_TIM_CLOCK_TIM3_BRG_div1 = 0,    /*!< div1 : div by 1                                                           */
  MDR_RST_CLOCK_TIM_CLOCK_TIM3_BRG_div2 = 1,    /*!< div2 : div by 2                                                           */
  MDR_RST_CLOCK_TIM_CLOCK_TIM3_BRG_div4 = 2,    /*!< div4 : div by 4                                                           */
  MDR_RST_CLOCK_TIM_CLOCK_TIM3_BRG_div8 = 3,    /*!< div8 : div by 8                                                           */
  MDR_RST_CLOCK_TIM_CLOCK_TIM3_BRG_div16 = 4,   /*!< div16 : div by 16                                                         */
  MDR_RST_CLOCK_TIM_CLOCK_TIM3_BRG_div32 = 5,   /*!< div32 : div by 32                                                         */
  MDR_RST_CLOCK_TIM_CLOCK_TIM3_BRG_div64 = 6,   /*!< div64 : div by 64                                                         */
  MDR_RST_CLOCK_TIM_CLOCK_TIM3_BRG_div128 = 7,  /*!< div128 : div by 128                                                       */
} MDR_RST_CLOCK_TIM_CLOCK_TIM3_BRG_Enum;

/* =====================================  MDR_RST_CLOCK TIM_CLOCK TIM1_CLK_EN [24..24]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_TIM_CLOCK_TIM1_CLK_EN                                       */
  MDR_RST__TIM__TIM1_CLK__Off          = 0,     /*!< Off : Timer1 Clock Disabled                                               */
  MDR_RST__TIM__TIM1_CLK__On           = 1,     /*!< On : Timer1 Clock Enabled                                                 */
} MDR_RST__TIM__TIM1_CLK__Enum;

/* =====================================  MDR_RST_CLOCK TIM_CLOCK TIM2_CLK_EN [25..25]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_TIM_CLOCK_TIM2_CLK_EN                                       */
  MDR_RST__TIM__TIM2_CLK__Off          = 0,     /*!< Off : Timer2 Clock Disabled                                               */
  MDR_RST__TIM__TIM2_CLK__On           = 1,     /*!< On : Timer2 Clock Enabled                                                 */
} MDR_RST__TIM__TIM2_CLK__Enum;

/* =====================================  MDR_RST_CLOCK TIM_CLOCK TIM3_CLK_EN [26..26]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_TIM_CLOCK_TIM3_CLK_EN                                       */
  MDR_RST__TIM__TIM3_CLK__Off          = 0,     /*!< Off : Timer3 Clock Disabled                                               */
  MDR_RST__TIM__TIM3_CLK__On           = 1,     /*!< On : Timer3 Clock Enabled                                                 */
} MDR_RST__TIM__TIM3_CLK__Enum;

/* ======================================================  UART_CLOCK  ======================================================= */
/* =======================================  MDR_RST_CLOCK UART_CLOCK UART1_BRG [0..2]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_UART_CLOCK_UART1_BRG                                        */
  MDR_RST_CLOCK_UART_CLOCK_UART1_BRG_div1 = 0,  /*!< div1 : div by 1                                                           */
  MDR_RST_CLOCK_UART_CLOCK_UART1_BRG_div2 = 1,  /*!< div2 : div by 2                                                           */
  MDR_RST_CLOCK_UART_CLOCK_UART1_BRG_div4 = 2,  /*!< div4 : div by 4                                                           */
  MDR_RST_CLOCK_UART_CLOCK_UART1_BRG_div8 = 3,  /*!< div8 : div by 8                                                           */
  MDR_RST_CLOCK_UART_CLOCK_UART1_BRG_div16 = 4, /*!< div16 : div by 16                                                         */
  MDR_RST_CLOCK_UART_CLOCK_UART1_BRG_div32 = 5, /*!< div32 : div by 32                                                         */
  MDR_RST_CLOCK_UART_CLOCK_UART1_BRG_div64 = 6, /*!< div64 : div by 64                                                         */
  MDR_RST_CLOCK_UART_CLOCK_UART1_BRG_div128 = 7,/*!< div128 : div by 128                                                       */
} MDR_RST_CLOCK_UART_CLOCK_UART1_BRG_Enum;

/* ======================================  MDR_RST_CLOCK UART_CLOCK UART2_BRG [8..10]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_UART_CLOCK_UART2_BRG                                        */
  MDR_RST_CLOCK_UART_CLOCK_UART2_BRG_div1 = 0,  /*!< div1 : div by 1                                                           */
  MDR_RST_CLOCK_UART_CLOCK_UART2_BRG_div2 = 1,  /*!< div2 : div by 2                                                           */
  MDR_RST_CLOCK_UART_CLOCK_UART2_BRG_div4 = 2,  /*!< div4 : div by 4                                                           */
  MDR_RST_CLOCK_UART_CLOCK_UART2_BRG_div8 = 3,  /*!< div8 : div by 8                                                           */
  MDR_RST_CLOCK_UART_CLOCK_UART2_BRG_div16 = 4, /*!< div16 : div by 16                                                         */
  MDR_RST_CLOCK_UART_CLOCK_UART2_BRG_div32 = 5, /*!< div32 : div by 32                                                         */
  MDR_RST_CLOCK_UART_CLOCK_UART2_BRG_div64 = 6, /*!< div64 : div by 64                                                         */
  MDR_RST_CLOCK_UART_CLOCK_UART2_BRG_div128 = 7,/*!< div128 : div by 128                                                       */
} MDR_RST_CLOCK_UART_CLOCK_UART2_BRG_Enum;

/* ======================================  MDR_RST_CLOCK UART_CLOCK TIM4_BRG [16..18]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_UART_CLOCK_TIM4_BRG                                         */
  MDR_RST_CLOCK_UART_CLOCK_TIM4_BRG_div1 = 0,   /*!< div1 : div by 1                                                           */
  MDR_RST_CLOCK_UART_CLOCK_TIM4_BRG_div2 = 1,   /*!< div2 : div by 2                                                           */
  MDR_RST_CLOCK_UART_CLOCK_TIM4_BRG_div4 = 2,   /*!< div4 : div by 4                                                           */
  MDR_RST_CLOCK_UART_CLOCK_TIM4_BRG_div8 = 3,   /*!< div8 : div by 8                                                           */
  MDR_RST_CLOCK_UART_CLOCK_TIM4_BRG_div16 = 4,  /*!< div16 : div by 16                                                         */
  MDR_RST_CLOCK_UART_CLOCK_TIM4_BRG_div32 = 5,  /*!< div32 : div by 32                                                         */
  MDR_RST_CLOCK_UART_CLOCK_TIM4_BRG_div64 = 6,  /*!< div64 : div by 64                                                         */
  MDR_RST_CLOCK_UART_CLOCK_TIM4_BRG_div128 = 7, /*!< div128 : div by 128                                                       */
} MDR_RST_CLOCK_UART_CLOCK_TIM4_BRG_Enum;

