StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
/* ====================================  MDR_RST_CLOCK UART_CLOCK UART1_CLK_EN [24..24]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_UART_CLOCK_UART1_CLK_EN                                     */
  MDR_RST__UART__UART1_CLK__Off        = 0,     /*!< Off : UART1 Clock Disabled                                                */
  MDR_RST__UART__UART1_CLK__On         = 1,     /*!< On : UART1 Clock Enabled                                                  */
} MDR_RST__UART__UART1_CLK__Enum;

/* ====================================  MDR_RST_CLOCK UART_CLOCK UART2_CLK_EN [25..25]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_UART_CLOCK_UART2_CLK_EN                                     */
  MDR_RST__UART__UART2_CLK__Off        = 0,     /*!< Off : UART2 Clock Disabled                                                */
  MDR_RST__UART__UART2_CLK__On         = 1,     /*!< On : UART2 Clock Enabled                                                  */
} MDR_RST__UART__UART2_CLK__Enum;

/* =====================================  MDR_RST_CLOCK UART_CLOCK TIM4_CLK_EN [26..26]  ===================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_UART_CLOCK_TIM4_CLK_EN                                      */
  MDR_RST__UART__TIM4_CLK__Off         = 0,     /*!< Off : Timer4 Clock Disabled                                               */
  MDR_RST__UART__TIM4_CLK__On          = 1,     /*!< On : Timer4 Clock Enabled                                                 */
} MDR_RST__UART__TIM4_CLK__Enum;

/* =======================================================  SSP_CLOCK  ======================================================= */
/* ========================================  MDR_RST_CLOCK SSP_CLOCK SSP1_BRG [0..2]  ======================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_SSP_CLOCK_SSP1_BRG                                          */
  MDR_RST_CLOCK_SSP_CLOCK_SSP1_BRG_div1 = 0,    /*!< div1 : div by 1                                                           */
  MDR_RST_CLOCK_SSP_CLOCK_SSP1_BRG_div2 = 1,    /*!< div2 : div by 2                                                           */
  MDR_RST_CLOCK_SSP_CLOCK_SSP1_BRG_div4 = 2,    /*!< div4 : div by 4                                                           */
  MDR_RST_CLOCK_SSP_CLOCK_SSP1_BRG_div8 = 3,    /*!< div8 : div by 8                                                           */
  MDR_RST_CLOCK_SSP_CLOCK_SSP1_BRG_div16 = 4,   /*!< div16 : div by 16                                                         */
  MDR_RST_CLOCK_SSP_CLOCK_SSP1_BRG_div32 = 5,   /*!< div32 : div by 32                                                         */
  MDR_RST_CLOCK_SSP_CLOCK_SSP1_BRG_div64 = 6,   /*!< div64 : div by 64                                                         */
  MDR_RST_CLOCK_SSP_CLOCK_SSP1_BRG_div128 = 7,  /*!< div128 : div by 128                                                       */
} MDR_RST_CLOCK_SSP_CLOCK_SSP1_BRG_Enum;

/* =======================================  MDR_RST_CLOCK SSP_CLOCK SSP2_BRG [8..10]  ======================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_SSP_CLOCK_SSP2_BRG                                          */
  MDR_RST_CLOCK_SSP_CLOCK_SSP2_BRG_div1 = 0,    /*!< div1 : div by 1                                                           */
  MDR_RST_CLOCK_SSP_CLOCK_SSP2_BRG_div2 = 1,    /*!< div2 : div by 2                                                           */
  MDR_RST_CLOCK_SSP_CLOCK_SSP2_BRG_div4 = 2,    /*!< div4 : div by 4                                                           */
  MDR_RST_CLOCK_SSP_CLOCK_SSP2_BRG_div8 = 3,    /*!< div8 : div by 8                                                           */
  MDR_RST_CLOCK_SSP_CLOCK_SSP2_BRG_div16 = 4,   /*!< div16 : div by 16                                                         */
  MDR_RST_CLOCK_SSP_CLOCK_SSP2_BRG_div32 = 5,   /*!< div32 : div by 32                                                         */
  MDR_RST_CLOCK_SSP_CLOCK_SSP2_BRG_div64 = 6,   /*!< div64 : div by 64                                                         */
  MDR_RST_CLOCK_SSP_CLOCK_SSP2_BRG_div128 = 7,  /*!< div128 : div by 128                                                       */
} MDR_RST_CLOCK_SSP_CLOCK_SSP2_BRG_Enum;

/* =======================================  MDR_RST_CLOCK SSP_CLOCK SSP3_BRG [16..18]  ======================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_SSP_CLOCK_SSP3_BRG                                          */
  MDR_RST_CLOCK_SSP_CLOCK_SSP3_BRG_div1 = 0,    /*!< div1 : div by 1                                                           */
  MDR_RST_CLOCK_SSP_CLOCK_SSP3_BRG_div2 = 1,    /*!< div2 : div by 2                                                           */
  MDR_RST_CLOCK_SSP_CLOCK_SSP3_BRG_div4 = 2,    /*!< div4 : div by 4                                                           */
  MDR_RST_CLOCK_SSP_CLOCK_SSP3_BRG_div8 = 3,    /*!< div8 : div by 8                                                           */
  MDR_RST_CLOCK_SSP_CLOCK_SSP3_BRG_div16 = 4,   /*!< div16 : div by 16                                                         */
  MDR_RST_CLOCK_SSP_CLOCK_SSP3_BRG_div32 = 5,   /*!< div32 : div by 32                                                         */
  MDR_RST_CLOCK_SSP_CLOCK_SSP3_BRG_div64 = 6,   /*!< div64 : div by 64                                                         */
  MDR_RST_CLOCK_SSP_CLOCK_SSP3_BRG_div128 = 7,  /*!< div128 : div by 128                                                       */
} MDR_RST_CLOCK_SSP_CLOCK_SSP3_BRG_Enum;

/* =====================================  MDR_RST_CLOCK SSP_CLOCK SSP1_CLK_EN [24..24]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_SSP_CLOCK_SSP1_CLK_EN                                       */
  MDR_RST__SSP__SSP1_CLK__Off          = 0,     /*!< Off : SSP1 Clock Disabled                                                 */
  MDR_RST__SSP__SSP1_CLK__On           = 1,     /*!< On : SSP1 Clock Enabled                                                   */
} MDR_RST__SSP__SSP1_CLK__Enum;

/* =====================================  MDR_RST_CLOCK SSP_CLOCK SSP2_CLK_EN [25..25]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_SSP_CLOCK_SSP2_CLK_EN                                       */
  MDR_RST__SSP__SSP2_CLK__Off          = 0,     /*!< Off : SSP2 Clock Disabled                                                 */
  MDR_RST__SSP__SSP2_CLK__On           = 1,     /*!< On : SSP2 Clock Enabled                                                   */
} MDR_RST__SSP__SSP2_CLK__Enum;

/* =====================================  MDR_RST_CLOCK SSP_CLOCK SSP3_CLK_EN [26..26]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_SSP_CLOCK_SSP3_CLK_EN                                       */
  MDR_RST__SSP__SSP3_CLK__Off          = 0,     /*!< Off : SSP3 Clock Disabled                                                 */
  MDR_RST__SSP__SSP3_CLK__On           = 1,     /*!< On : SSP3 Clock Enabled                                                   */
} MDR_RST__SSP__SSP3_CLK__Enum;

/* =======================================================  ETH_CLOCK  ======================================================= */
/* ========================================  MDR_RST_CLOCK ETH_CLOCK MIL_BRG [8..10]  ======================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_ETH_CLOCK_MIL_BRG                                           */
  MDR_RST_CLOCK_ETH_CLOCK_MIL_BRG_div1 = 0,     /*!< div1 : div by 1                                                           */
  MDR_RST_CLOCK_ETH_CLOCK_MIL_BRG_div2 = 1,     /*!< div2 : div by 2                                                           */
  MDR_RST_CLOCK_ETH_CLOCK_MIL_BRG_div4 = 2,     /*!< div4 : div by 4                                                           */
  MDR_RST_CLOCK_ETH_CLOCK_MIL_BRG_div8 = 3,     /*!< div8 : div by 8                                                           */
  MDR_RST_CLOCK_ETH_CLOCK_MIL_BRG_div16 = 4,    /*!< div16 : div by 16                                                         */
  MDR_RST_CLOCK_ETH_CLOCK_MIL_BRG_div32 = 5,    /*!< div32 : div by 32                                                         */
  MDR_RST_CLOCK_ETH_CLOCK_MIL_BRG_div64 = 6,    /*!< div64 : div by 64                                                         */
  MDR_RST_CLOCK_ETH_CLOCK_MIL_BRG_div128 = 7,   /*!< div128 : div by 128                                                       */
} MDR_RST_CLOCK_ETH_CLOCK_MIL_BRG_Enum;

/* =======================================  MDR_RST_CLOCK ETH_CLOCK PHY_BRG [16..18]  ======================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_ETH_CLOCK_PHY_BRG                                           */
  MDR_RST_CLOCK_ETH_CLOCK_PHY_BRG_div1 = 0,     /*!< div1 : div by 1                                                           */
  MDR_RST_CLOCK_ETH_CLOCK_PHY_BRG_div2 = 1,     /*!< div2 : div by 2                                                           */
  MDR_RST_CLOCK_ETH_CLOCK_PHY_BRG_div4 = 2,     /*!< div4 : div by 4                                                           */
  MDR_RST_CLOCK_ETH_CLOCK_PHY_BRG_div8 = 3,     /*!< div8 : div by 8                                                           */
  MDR_RST_CLOCK_ETH_CLOCK_PHY_BRG_div16 = 4,    /*!< div16 : div by 16                                                         */
  MDR_RST_CLOCK_ETH_CLOCK_PHY_BRG_div32 = 5,    /*!< div32 : div by 32                                                         */
  MDR_RST_CLOCK_ETH_CLOCK_PHY_BRG_div64 = 6,    /*!< div64 : div by 64                                                         */
  MDR_RST_CLOCK_ETH_CLOCK_PHY_BRG_div128 = 7,   /*!< div128 : div by 128                                                       */
} MDR_RST_CLOCK_ETH_CLOCK_PHY_BRG_Enum;

/* ======================================  MDR_RST_CLOCK ETH_CLOCK ETH_CLK_EN [24..24]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_ETH_CLOCK_ETH_CLK_EN                                        */
  MDR_RST__ETH__MAC_CLK__Off           = 0,     /*!< Off : MAC Clock Disabled                                                  */
  MDR_RST__ETH__MAC_CLK__On            = 1,     /*!< On : MAC Clock Enabled                                                    */
} MDR_RST__ETH__MAC_CLK__Enum;

/* ======================================  MDR_RST_CLOCK ETH_CLOCK MIL_CLK_EN [25..25]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_ETH_CLOCK_MIL_CLK_EN                                        */
  MDR_RST__ETH__MIL_CLK__Off           = 0,     /*!< Off : MIL Clock Disabled                                                  */
  MDR_RST__ETH__MIL_CLK__On            = 1,     /*!< On : MIL Clock Enabled                                                    */
} MDR_RST__ETH__MIL_CLK__Enum;

