StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
/* ========================================  MDR_RST_CLOCK ETH_CLOCK SLEEP [26..26]  ========================================= */
typedef enum {                                  /*!< MDR_RST_CLOCK_ETH_CLOCK_SLEEP                                             */
  MDR_RST__ETH__SLEEP__Off             = 0,     /*!< Off : Normal Mode                                                         */
  MDR_RST__ETH__SLEEP__GoSLEEP         = 1,     /*!< GoSLEEP : Go to SLEEP                                                     */
} MDR_RST__ETH__SLEEP__Enum;

/* ======================================  MDR_RST_CLOCK ETH_CLOCK PHY_CLK_EN [27..27]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_ETH_CLOCK_PHY_CLK_EN                                        */
  MDR_RST__ETH__PHY_CLK__Off           = 0,     /*!< Off : MIL Clock Disabled                                                  */
  MDR_RST__ETH__PHY_CLK__On            = 1,     /*!< On : MIL Clock Enabled                                                    */
} MDR_RST__ETH__PHY_CLK__Enum;

/* =====================================  MDR_RST_CLOCK ETH_CLOCK PHY_CLK_SEL [28..29]  ====================================== */
typedef enum {                                  /*!< MDR_RST_CLOCK_ETH_CLOCK_PHY_CLK_SEL                                       */
  MDR_RST__ETH__PHY_SEL__HSI           = 0,     /*!< HSI : PHY Clock from HSI                                                  */
  MDR_RST__ETH__PHY_SEL__HSE           = 1,     /*!< HSE : PHY Clock from HSE                                                  */
  MDR_RST__ETH__PHY_SEL__PLLCPUo       = 2,     /*!< PLLCPUo : PHY Clock from PLLCPUo                                          */
  MDR_RST__ETH__PHY_SEL__HSE2          = 3,     /*!< HSE2 : PHY Clock from HSE2                                                */
} MDR_RST__ETH__PHY_SEL__Enum;



/* =========================================================================================================================== */
/* ================                                          MDR_DMA                                          ================ */
/* =========================================================================================================================== */

/* ========================================================  STATUS  ========================================================= */
/* =============================================  MDR_DMA STATUS Enable [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_DMA_STATUS_Enable                                                     */
  MDR_DMA_STATUS_Enable_Disabled       = 0,     /*!< Disabled : Block inactive                                                 */
  MDR_DMA_STATUS_Enable_Enabled        = 1,     /*!< Enabled : Block active                                                    */
} MDR_DMA_STATUS_Enable_Enum;

/* ==============================================  MDR_DMA STATUS State [4..7]  ============================================== */
typedef enum {                                  /*!< MDR_DMA_STATUS_State                                                      */
  MDR_DMA_STATUS_State_Idle            = 0,     /*!< Idle : Idle state                                                         */
  MDR_DMA_STATUS_State_RD_Ctrl         = 1,     /*!< RD_Ctrl : Reading channel controller data                                 */
  MDR_DMA_STATUS_State_RD_pSrc         = 2,     /*!< RD_pSrc : Reading source data end pointer                                 */
  MDR_DMA_STATUS_State_RD_pDest        = 3,     /*!< RD_pDest : Reading destination data end pointer                           */
  MDR_DMA_STATUS_State_RD_Data         = 4,     /*!< RD_Data : Reading source data                                             */
  MDR_DMA_STATUS_State_WR_Data         = 5,     /*!< WR_Data : writing destination data                                        */
  MDR_DMA_STATUS_State_Wait_Clr        = 6,     /*!< Wait_Clr : Waiting for DMA request to clear                               */
  MDR_DMA_STATUS_State_WR_Ctrl         = 7,     /*!< WR_Ctrl : Writing channel controller data                                 */
  MDR_DMA_STATUS_State_Stalled         = 8,     /*!< Stalled : Stalled transfer                                                */
  MDR_DMA_STATUS_State_Done            = 9,     /*!< Done : Done transfer                                                      */
  MDR_DMA_STATUS_State_ScatGath        = 10,    /*!< ScatGath : scatter-gather transition                                      */
} MDR_DMA_STATUS_State_Enum;

/* =========================================  MDR_DMA STATUS Chnls_minus1 [16..20]  ========================================== */
typedef enum {                                  /*!< MDR_DMA_STATUS_Chnls_minus1                                               */
  MDR_DMA_STATUS_Chnls_minus1_1_channels = 0,   /*!< 1_channels : Channels Count                                               */
  MDR_DMA_STATUS_Chnls_minus1_2_channels = 1,   /*!< 2_channels : Channels Count                                               */
  MDR_DMA_STATUS_Chnls_minus1_3_channels = 2,   /*!< 3_channels : Channels Count                                               */
  MDR_DMA_STATUS_Chnls_minus1_4_channels = 3,   /*!< 4_channels : Channels Count                                               */
  MDR_DMA_STATUS_Chnls_minus1_5_channels = 4,   /*!< 5_channels : Channels Count                                               */
  MDR_DMA_STATUS_Chnls_minus1_6_channels = 5,   /*!< 6_channels : Channels Count                                               */
  MDR_DMA_STATUS_Chnls_minus1_7_channels = 6,   /*!< 7_channels : Channels Count                                               */
  MDR_DMA_STATUS_Chnls_minus1_8_channels = 7,   /*!< 8_channels : Channels Count                                               */
  MDR_DMA_STATUS_Chnls_minus1_9_channels = 8,   /*!< 9_channels : Channels Count                                               */
  MDR_DMA_STATUS_Chnls_minus1_10_channels = 9,  /*!< 10_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_11_channels = 10, /*!< 11_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_12_channels = 11, /*!< 12_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_13_channels = 12, /*!< 13_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_14_channels = 13, /*!< 14_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_15_channels = 14, /*!< 15_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_16_channels = 15, /*!< 16_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_17_channels = 16, /*!< 17_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_18_channels = 17, /*!< 18_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_19_channels = 18, /*!< 19_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_20_channels = 19, /*!< 20_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_21_channels = 20, /*!< 21_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_22_channels = 21, /*!< 22_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_23_channels = 22, /*!< 23_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_24_channels = 23, /*!< 24_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_25_channels = 24, /*!< 25_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_26_channels = 25, /*!< 26_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_27_channels = 26, /*!< 27_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_28_channels = 27, /*!< 28_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_29_channels = 28, /*!< 29_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_30_channels = 29, /*!< 30_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_31_channels = 30, /*!< 31_channels : Channels Count                                              */
  MDR_DMA_STATUS_Chnls_minus1_32_channels = 31, /*!< 32_channels : Channels Count                                              */
} MDR_DMA_STATUS_Chnls_minus1_Enum;

/* ==========================================  MDR_DMA STATUS test_status [28..28]  ========================================== */
typedef enum {                                  /*!< MDR_DMA_STATUS_test_status                                                */
  MDR_DMA_STATUS_test_status_Unavailable = 0,   /*!< Unavailable : Test logic unavailable                                      */
  MDR_DMA_STATUS_test_status_Available = 1,     /*!< Available : Test logic available                                          */
} MDR_DMA_STATUS_test_status_Enum;

/* ==========================================================  CFG  ========================================================== */
/* ===============================================  MDR_DMA CFG Enable [0..0]  =============================================== */
typedef enum {                                  /*!< MDR_DMA_CFG_Enable                                                        */
  MDR_DMA_CFG_Enable_Disabled          = 0,     /*!< Disabled : Block inactive                                                 */
  MDR_DMA_CFG_Enable_Enabled           = 1,     /*!< Enabled : Block active                                                    */
} MDR_DMA_CFG_Enable_Enum;

/* =============================================  MDR_DMA CFG Privileged [5..5]  ============================================= */
typedef enum {                                  /*!< MDR_DMA_CFG_Privileged                                                    */
  MDR_DMA_CFG_Privileged_Off           = 0,     /*!< Off : Inactive                                                            */
  MDR_DMA_CFG_Privileged_On            = 1,     /*!< On : Active                                                               */
} MDR_DMA_CFG_Privileged_Enum;

/* =============================================  MDR_DMA CFG Bufferable [6..6]  ============================================= */
typedef enum {                                  /*!< MDR_DMA_CFG_Bufferable                                                    */
  MDR_DMA_CFG_Bufferable_Off           = 0,     /*!< Off : Inactive                                                            */
  MDR_DMA_CFG_Bufferable_On            = 1,     /*!< On : Active                                                               */
} MDR_DMA_CFG_Bufferable_Enum;

/* ==============================================  MDR_DMA CFG Cachable [7..7]  ============================================== */
typedef enum {                                  /*!< MDR_DMA_CFG_Cachable                                                      */
  MDR_DMA_CFG_Cachable_Off             = 0,     /*!< Off : Inactive                                                            */
  MDR_DMA_CFG_Cachable_On              = 1,     /*!< On : Active                                                               */
} MDR_DMA_CFG_Cachable_Enum;

/* =====================================================  CTRL_BASE_PTR  ===================================================== */
/* ===================================================  ALT_CTRL_BASE_PTR  =================================================== */
/* ===================================================  WAITONREQ_STATUS  ==================================================== */
/* ==========================================  MDR_DMA WAITONREQ_STATUS Ch_ [0..0]  ========================================== */
typedef enum {                                  /*!< MDR_DMA_WAITONREQ_STATUS_Ch_                                              */
  MDR_DMA_WAITONREQ_STATUS_Ch__Off     = 0,     /*!< Off : Inactive                                                            */
  MDR_DMA_WAITONREQ_STATUS_Ch__On      = 1,     /*!< On : Active                                                               */
} MDR_DMA_WAITONREQ_STATUS_Ch__Enum;

/* ====================================================  CHNL_SW_REQUEST  ==================================================== */
/* ==========================================  MDR_DMA CHNL_SW_REQUEST Ch_ [0..0]  =========================================== */
typedef enum {                                  /*!< MDR_DMA_CHNL_SW_REQUEST_Ch_                                               */
  MDR_DMA_CHNL_SW_REQUEST_Ch__Off      = 0,     /*!< Off : Inactive                                                            */
  MDR_DMA_CHNL_SW_REQUEST_Ch__On       = 1,     /*!< On : Active                                                               */
} MDR_DMA_CHNL_SW_REQUEST_Ch__Enum;

