StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
/* ===================================================  CHNL_USEBURST_SET  =================================================== */
/* =========================================  MDR_DMA CHNL_USEBURST_SET Ch_ [0..0]  ========================================== */
typedef enum {                                  /*!< MDR_DMA_CHNL_USEBURST_SET_Ch_                                             */
  MDR_DMA_CHNL_USEBURST_SET_Ch__Off    = 0,     /*!< Off : Inactive                                                            */
  MDR_DMA_CHNL_USEBURST_SET_Ch__On     = 1,     /*!< On : Active                                                               */
} MDR_DMA_CHNL_USEBURST_SET_Ch__Enum;

/* ===================================================  CHNL_USEBURST_CLR  =================================================== */
/* =========================================  MDR_DMA CHNL_USEBURST_CLR Ch_ [0..0]  ========================================== */
typedef enum {                                  /*!< MDR_DMA_CHNL_USEBURST_CLR_Ch_                                             */
  MDR_DMA_CHNL_USEBURST_CLR_Ch__Off    = 0,     /*!< Off : Inactive                                                            */
  MDR_DMA_CHNL_USEBURST_CLR_Ch__On     = 1,     /*!< On : Active                                                               */
} MDR_DMA_CHNL_USEBURST_CLR_Ch__Enum;

/* ===================================================  CHNL_REQ_MASK_SET  =================================================== */
/* =========================================  MDR_DMA CHNL_REQ_MASK_SET Ch_ [0..0]  ========================================== */
typedef enum {                                  /*!< MDR_DMA_CHNL_REQ_MASK_SET_Ch_                                             */
  MDR_DMA_CHNL_REQ_MASK_SET_Ch__Off    = 0,     /*!< Off : Inactive                                                            */
  MDR_DMA_CHNL_REQ_MASK_SET_Ch__On     = 1,     /*!< On : Active                                                               */
} MDR_DMA_CHNL_REQ_MASK_SET_Ch__Enum;

/* ===================================================  CHNL_REQ_MASK_CLR  =================================================== */
/* =========================================  MDR_DMA CHNL_REQ_MASK_CLR Ch_ [0..0]  ========================================== */
typedef enum {                                  /*!< MDR_DMA_CHNL_REQ_MASK_CLR_Ch_                                             */
  MDR_DMA_CHNL_REQ_MASK_CLR_Ch__Off    = 0,     /*!< Off : Inactive                                                            */
  MDR_DMA_CHNL_REQ_MASK_CLR_Ch__On     = 1,     /*!< On : Active                                                               */
} MDR_DMA_CHNL_REQ_MASK_CLR_Ch__Enum;

/* ====================================================  CHNL_ENABLE_SET  ==================================================== */
/* ==========================================  MDR_DMA CHNL_ENABLE_SET Ch_ [0..0]  =========================================== */
typedef enum {                                  /*!< MDR_DMA_CHNL_ENABLE_SET_Ch_                                               */
  MDR_DMA_CHNL_ENABLE_SET_Ch__Off      = 0,     /*!< Off : Inactive                                                            */
  MDR_DMA_CHNL_ENABLE_SET_Ch__On       = 1,     /*!< On : Active                                                               */
} MDR_DMA_CHNL_ENABLE_SET_Ch__Enum;

/* ====================================================  CHNL_ENABLE_CLR  ==================================================== */
/* ==========================================  MDR_DMA CHNL_ENABLE_CLR Ch_ [0..0]  =========================================== */
typedef enum {                                  /*!< MDR_DMA_CHNL_ENABLE_CLR_Ch_                                               */
  MDR_DMA_CHNL_ENABLE_CLR_Ch__Off      = 0,     /*!< Off : Inactive                                                            */
  MDR_DMA_CHNL_ENABLE_CLR_Ch__On       = 1,     /*!< On : Active                                                               */
} MDR_DMA_CHNL_ENABLE_CLR_Ch__Enum;

/* ===================================================  CHNL_PRI_ALT_SET  ==================================================== */
/* ==========================================  MDR_DMA CHNL_PRI_ALT_SET Ch_ [0..0]  ========================================== */
typedef enum {                                  /*!< MDR_DMA_CHNL_PRI_ALT_SET_Ch_                                              */
  MDR_DMA_CHNL_PRI_ALT_SET_Ch__Off     = 0,     /*!< Off : Inactive                                                            */
  MDR_DMA_CHNL_PRI_ALT_SET_Ch__On      = 1,     /*!< On : Active                                                               */
} MDR_DMA_CHNL_PRI_ALT_SET_Ch__Enum;

/* ===================================================  CHNL_PRI_ALT_CLR  ==================================================== */
/* ==========================================  MDR_DMA CHNL_PRI_ALT_CLR Ch_ [0..0]  ========================================== */
typedef enum {                                  /*!< MDR_DMA_CHNL_PRI_ALT_CLR_Ch_                                              */
  MDR_DMA_CHNL_PRI_ALT_CLR_Ch__Off     = 0,     /*!< Off : Inactive                                                            */
  MDR_DMA_CHNL_PRI_ALT_CLR_Ch__On      = 1,     /*!< On : Active                                                               */
} MDR_DMA_CHNL_PRI_ALT_CLR_Ch__Enum;

/* ===================================================  CHNL_PRIORITY_SET  =================================================== */
/* =========================================  MDR_DMA CHNL_PRIORITY_SET Ch_ [0..0]  ========================================== */
typedef enum {                                  /*!< MDR_DMA_CHNL_PRIORITY_SET_Ch_                                             */
  MDR_DMA_CHNL_PRIORITY_SET_Ch__Off    = 0,     /*!< Off : Inactive                                                            */
  MDR_DMA_CHNL_PRIORITY_SET_Ch__On     = 1,     /*!< On : Active                                                               */
} MDR_DMA_CHNL_PRIORITY_SET_Ch__Enum;

