StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
/* ===================================================  CHNL_PRIORITY_CLR  =================================================== */
/* =========================================  MDR_DMA CHNL_PRIORITY_CLR Ch_ [0..0]  ========================================== */
typedef enum {                                  /*!< MDR_DMA_CHNL_PRIORITY_CLR_Ch_                                             */
  MDR_DMA_CHNL_PRIORITY_CLR_Ch__Off    = 0,     /*!< Off : Inactive                                                            */
  MDR_DMA_CHNL_PRIORITY_CLR_Ch__On     = 1,     /*!< On : Active                                                               */
} MDR_DMA_CHNL_PRIORITY_CLR_Ch__Enum;

/* ========================================================  ERR_CLR  ======================================================== */
/* ==============================================  MDR_DMA ERR_CLR Ch_ [0..0]  =============================================== */
typedef enum {                                  /*!< MDR_DMA_ERR_CLR_Ch_                                                       */
  MDR_DMA_ERR_CLR_Ch__Off              = 0,     /*!< Off : Inactive                                                            */
  MDR_DMA_ERR_CLR_Ch__On               = 1,     /*!< On : Active                                                               */
} MDR_DMA_ERR_CLR_Ch__Enum;



/* =========================================================================================================================== */
/* ================                                         MDR_Power                                         ================ */
/* =========================================================================================================================== */

/* =========================================================  PVDCS  ========================================================= */
/* =============================================  MDR_Power PVDCS PVDEN [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_Power_PVDCS_PVDEN                                                     */
  MDR_Power_PVDCS_PVDEN_Off            = 0,     /*!< Off : Disabled                                                            */
  MDR_Power_PVDCS_PVDEN_On             = 1,     /*!< On : Enabled                                                              */
} MDR_Power_PVDCS_PVDEN_Enum;

/* ==============================================  MDR_Power PVDCS PBLS [1..2]  ============================================== */
typedef enum {                                  /*!< MDR_Power_PVDCS_PBLS                                                      */
  MDR_Power_PVDCS_PBLS_1v8             = 0,     /*!< 1v8 : Level of 1.8 volts                                                  */
  MDR_Power_PVDCS_PBLS_2v2             = 1,     /*!< 2v2 : Level of 2.2 volts                                                  */
  MDR_Power_PVDCS_PBLS_2v6             = 2,     /*!< 2v6 : Level of 2.6 volts                                                  */
  MDR_Power_PVDCS_PBLS_3v0             = 3,     /*!< 3v0 : Level of 3.0 volts                                                  */
} MDR_Power_PVDCS_PBLS_Enum;

/* ==============================================  MDR_Power PVDCS PLS [3..5]  =============================================== */
typedef enum {                                  /*!< MDR_Power_PVDCS_PLS                                                       */
  MDR_Power_PVDCS_PLS_2v0              = 0,     /*!< 2v0 : Level of 2.0 volts                                                  */
  MDR_Power_PVDCS_PLS_2v2              = 1,     /*!< 2v2 : Level of 2.2 volts                                                  */
  MDR_Power_PVDCS_PLS_2v4              = 2,     /*!< 2v4 : Level of 2.4 volts                                                  */
  MDR_Power_PVDCS_PLS_2v6              = 3,     /*!< 2v6 : Level of 2.6 volts                                                  */
  MDR_Power_PVDCS_PLS_2v8              = 4,     /*!< 2v8 : Level of 2.8 volts                                                  */
  MDR_Power_PVDCS_PLS_3v0              = 5,     /*!< 3v0 : Level of 3.0 volts                                                  */
  MDR_Power_PVDCS_PLS_3v2              = 6,     /*!< 3v2 : Level of 3.2 volts                                                  */
  MDR_Power_PVDCS_PLS_3v4              = 7,     /*!< 3v4 : Level of 3.4 volts                                                  */
} MDR_Power_PVDCS_PLS_Enum;

/* ==============================================  MDR_Power PVDCS PVBD [6..6]  ============================================== */
typedef enum {                                  /*!< MDR_Power_PVDCS_PVBD                                                      */
  MDR_Power_PVDCS_PVBD_Inactive        = 0,     /*!< Inactive : No Event                                                       */
  MDR_Power_PVDCS_PVBD_Active          = 1,     /*!< Active : Event is active                                                  */
} MDR_Power_PVDCS_PVBD_Enum;

/* ==============================================  MDR_Power PVDCS PVD [7..7]  =============================================== */
typedef enum {                                  /*!< MDR_Power_PVDCS_PVD                                                       */
  MDR_Power_PVDCS_PVD_Inactive         = 0,     /*!< Inactive : No Event                                                       */
  MDR_Power_PVDCS_PVD_Active           = 1,     /*!< Active : Event is active                                                  */
} MDR_Power_PVDCS_PVD_Enum;

/* =============================================  MDR_Power PVDCS IEPVBD [8..8]  ============================================= */
typedef enum {                                  /*!< MDR_Power_PVDCS_IEPVBD                                                    */
  MDR_Power_PVDCS_IEPVBD_Off           = 0,     /*!< Off : Disabled                                                            */
  MDR_Power_PVDCS_IEPVBD_On            = 1,     /*!< On : Enabled                                                              */
} MDR_Power_PVDCS_IEPVBD_Enum;

/* =============================================  MDR_Power PVDCS IEPVD [9..9]  ============================================== */
typedef enum {                                  /*!< MDR_Power_PVDCS_IEPVD                                                     */
  MDR_Power_PVDCS_IEPVD_Off            = 0,     /*!< Off : Disabled                                                            */
  MDR_Power_PVDCS_IEPVD_On             = 1,     /*!< On : Enabled                                                              */
} MDR_Power_PVDCS_IEPVD_Enum;

/* =============================================  MDR_Power PVDCS INVB [10..10]  ============================================= */
typedef enum {                                  /*!< MDR_Power_PVDCS_INVB                                                      */
  MDR_Power_PVDCS_INVB_Off             = 0,     /*!< Off : Disabled                                                            */
  MDR_Power_PVDCS_INVB_On              = 1,     /*!< On : Enabled                                                              */
} MDR_Power_PVDCS_INVB_Enum;

/* =============================================  MDR_Power PVDCS INV [11..11]  ============================================== */
typedef enum {                                  /*!< MDR_Power_PVDCS_INV                                                       */
  MDR_Power_PVDCS_INV_Off              = 0,     /*!< Off : Disabled                                                            */
  MDR_Power_PVDCS_INV_On               = 1,     /*!< On : Enabled                                                              */
} MDR_Power_PVDCS_INV_Enum;

