StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
/* ============================================  MDR_Power PVDCS PVDBEN [12..12]  ============================================ */
typedef enum {                                  /*!< MDR_Power_PVDCS_PVDBEN                                                    */
  MDR_Power_PVDCS_PVDBEN_Off           = 0,     /*!< Off : Disabled                                                            */
  MDR_Power_PVDCS_PVDBEN_On            = 1,     /*!< On : Enabled                                                              */
} MDR_Power_PVDCS_PVDBEN_Enum;

/* ========================================================  ResReg  ========================================================= */


/* =========================================================================================================================== */
/* ================                                         MDR_WWDT                                          ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR  =========================================================== */
/* ================================================  MDR_WWDT CR WDGA [7..7]  ================================================ */
typedef enum {                                  /*!< MDR_WWDT_CR_WDGA                                                          */
  MDR_WWDG_EN__Off                     = 0,     /*!< Off : Disabled                                                            */
  MDR_WWDG_EN__On                      = 1,     /*!< On : Enabled                                                              */
} MDR_WWDG_EN__Enum;

/* ==========================================================  CFR  ========================================================== */
/* ===============================================  MDR_WWDT CFR WGTB [7..8]  ================================================ */
typedef enum {                                  /*!< MDR_WWDT_CFR_WGTB                                                         */
  MDR_CFR_WGTB___div1                  = 0,     /*!< div1 : CLK = LSI/4096/1                                                   */
  MDR_CFR_WGTB___div2                  = 1,     /*!< div2 : CLK = LSI/4096/2                                                   */
  MDR_CFR_WGTB___div4                  = 2,     /*!< div4 : CLK = LSI/4096/4                                                   */
  MDR_CFR_WGTB___div8                  = 3,     /*!< div8 : CLK = LSI/4096/8                                                   */
} MDR_CFR_WGTB___Enum;

/* ================================================  MDR_WWDT CFR EWI [9..9]  ================================================ */
typedef enum {                                  /*!< MDR_WWDT_CFR_EWI                                                          */
  MDR_CFR_EWI___Off                    = 0,     /*!< Off : Disabled IRQ on T=0x40                                              */
  MDR_CFR_EWI___On                     = 1,     /*!< On : Enabled IRQ on T=0x40                                                */
} MDR_CFR_EWI___Enum;

/* ==========================================================  SR  =========================================================== */
/* ================================================  MDR_WWDT SR EWIF [0..0]  ================================================ */
typedef enum {                                  /*!< MDR_WWDT_SR_EWIF                                                          */
  MDR_SR_EWIF___Off                    = 0,     /*!< Off : Event Off                                                           */
  MDR_SR_EWIF___Onn                    = 1,     /*!< Onn : Event On                                                            */
} MDR_SR_EWIF___Enum;



/* =========================================================================================================================== */
/* ================                                         MDR_IWDT                                          ================ */
/* =========================================================================================================================== */

/* ==========================================================  KR  =========================================================== */
/* ==========================================================  PR  =========================================================== */
/* =================================================  MDR_IWDT PR PR [0..2]  ================================================= */
typedef enum {                                  /*!< MDR_IWDT_PR_PR                                                            */
  MDR_IWDT_PR___div4                   = 0,     /*!< div4 : LSI div 4                                                          */
  MDR_IWDT_PR___div8                   = 1,     /*!< div8 : LSI div 8                                                          */
  MDR_IWDT_PR___div16                  = 2,     /*!< div16 : LSI div 16                                                        */
  MDR_IWDT_PR___div32                  = 3,     /*!< div32 : LSI div 32                                                        */
  MDR_IWDT_PR___div64                  = 4,     /*!< div64 : LSI div 64                                                        */
  MDR_IWDT_PR___div128                 = 5,     /*!< div128 : LSI div 128                                                      */
  MDR_IWDT_PR___div256                 = 6,     /*!< div256 : LSI div 256                                                      */
  MDR_IWDT_PR___div256_1               = 7,     /*!< div256_1 : LSI div 256                                                    */
} MDR_IWDT_PR___Enum;

/* ==========================================================  RLR  ========================================================== */
/* ==========================================================  SR  =========================================================== */
/* ================================================  MDR_IWDT SR PVU [0..0]  ================================================= */
typedef enum {                                  /*!< MDR_IWDT_SR_PVU                                                           */
  MDR_IWDT_PVU___Ready                 = 0,     /*!< Ready : PR ready for write                                                */
  MDR_IWDT_PVU___Busy                  = 1,     /*!< Busy : PR busy                                                            */
} MDR_IWDT_PVU___Enum;

/* ================================================  MDR_IWDT SR RVU [1..1]  ================================================= */
typedef enum {                                  /*!< MDR_IWDT_SR_RVU                                                           */
  MDR_IWDT_RVU___Ready                 = 0,     /*!< Ready : PRL ready for write                                               */
  MDR_IWDT_RVU___Busy                  = 1,     /*!< Busy : PRL busy                                                           */
} MDR_IWDT_RVU___Enum;



/* =========================================================================================================================== */
/* ================                                          MDR_ADC                                          ================ */
/* =========================================================================================================================== */

/* =======================================================  ADC1_Cfg  ======================================================== */
/* =============================================  MDR_ADC ADC1_Cfg ADON [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_ADC_ADC1_Cfg_ADON                                                     */
  MDR_ADC_ADC1_Cfg_ADON_Off            = 0,     /*!< Off : Disabled                                                            */
  MDR_ADC_ADC1_Cfg_ADON_On             = 1,     /*!< On : Enabled                                                              */
} MDR_ADC_ADC1_Cfg_ADON_Enum;

/* ==============================================  MDR_ADC ADC1_Cfg GO [1..1]  =============================================== */
typedef enum {                                  /*!< MDR_ADC_ADC1_Cfg_GO                                                       */
  MDR_ADC_ADC1_Cfg_GO_Inactive         = 0,     /*!< Inactive : Autoclear to zero after start                                  */
  MDR_ADC_ADC1_Cfg_GO_Start            = 1,     /*!< Start : Start measurement                                                 */
} MDR_ADC_ADC1_Cfg_GO_Enum;

/* =============================================  MDR_ADC ADC1_Cfg CLKS [2..2]  ============================================== */
typedef enum {                                  /*!< MDR_ADC_ADC1_Cfg_CLKS                                                     */
  MDR_ADC_ADC1_Cfg_CLKS_CPU_Clock      = 0,     /*!< CPU_Clock : CPU_Clock used                                                */
  MDR_ADC_ADC1_Cfg_CLKS_ADC_Clock      = 1,     /*!< ADC_Clock : ADC_Clock used                                                */
} MDR_ADC_ADC1_Cfg_CLKS_Enum;

/* ============================================  MDR_ADC ADC1_Cfg SAMPLE [3..3]  ============================================= */
typedef enum {                                  /*!< MDR_ADC_ADC1_Cfg_SAMPLE                                                   */
  MDR_ADC_ADC1_Cfg_SAMPLE_Single       = 0,     /*!< Single : Single measurement by GO                                         */
  MDR_ADC_ADC1_Cfg_SAMPLE_Continuouse  = 1,     /*!< Continuouse : Continuous measurement, until stop by ADON                  */
} MDR_ADC_ADC1_Cfg_SAMPLE_Enum;

/* ==============================================  MDR_ADC ADC1_Cfg CHS [4..8]  ============================================== */
typedef enum {                                  /*!< MDR_ADC_ADC1_Cfg_CHS                                                      */
  MDR_ADC_ADC1_Cfg_CHS_Channel_0_RefP  = 0,     /*!< Channel_0_RefP : Signal on PD7, Ref+                                      */
  MDR_ADC_ADC1_Cfg_CHS_Channel_1_RefN  = 1,     /*!< Channel_1_RefN : Signal on PD8, Ref-                                      */
  MDR_ADC_ADC1_Cfg_CHS_Channel_2       = 2,     /*!< Channel_2 : Signal on PD9                                                 */
  MDR_ADC_ADC1_Cfg_CHS_Channel_3       = 3,     /*!< Channel_3 : Signal on PD10                                                */
  MDR_ADC_ADC1_Cfg_CHS_Channel_4       = 4,     /*!< Channel_4 : Signal on PD11                                                */
  MDR_ADC_ADC1_Cfg_CHS_Channel_5       = 5,     /*!< Channel_5 : Signal on PD12                                                */
  MDR_ADC_ADC1_Cfg_CHS_Channel_6       = 6,     /*!< Channel_6 : Signal on PD13                                                */
  MDR_ADC_ADC1_Cfg_CHS_Channel_7       = 7,     /*!< Channel_7 : Signal on PD14                                                */
  MDR_ADC_ADC1_Cfg_CHS_TS_VRef_1.23    = 30,    /*!< TS_VRef_1.23 : Signal from Thermosensor                                   */
  MDR_ADC_ADC1_Cfg_CHS_TS_Temperature  = 31,    /*!< TS_Temperature : Signal from Thermosensor                                 */
} MDR_ADC_ADC1_Cfg_CHS_Enum;

/* =============================================  MDR_ADC ADC1_Cfg CHCH [9..9]  ============================================== */
typedef enum {                                  /*!< MDR_ADC_ADC1_Cfg_CHCH                                                     */
  MDR_ADC_ADC1_Cfg_CHCH_Disable        = 0,     /*!< Disable : Measure only CHS channel                                        */
  MDR_ADC_ADC1_Cfg_CHCH_Enable         = 1,     /*!< Enable : Measure channels selected in reg CHSEL                           */
} MDR_ADC_ADC1_Cfg_CHCH_Enum;

/* ============================================  MDR_ADC ADC1_Cfg RGNC [10..10]  ============================================= */
typedef enum {                                  /*!< MDR_ADC_ADC1_Cfg_RGNC                                                     */
  MDR_ADC_ADC1_Cfg_RGNC_Disable        = 0,     /*!< Disable : Flag STATUSx.AWOIFEN inactive                                   */
  MDR_ADC_ADC1_Cfg_RGNC_Enable         = 1,     /*!< Enable : Flag STATUSx.AWOIFEN enable                                      */
} MDR_ADC_ADC1_Cfg_RGNC_Enum;

