StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
/* ========================================================  CONTROL  ======================================================== */
/* ============================================  MDR_CAN1 CONTROL CAN_EN [0..0]  ============================================= */
typedef enum {                                  /*!< MDR_CAN1_CONTROL_CAN_EN                                                   */
  MDR_CAN1_CONTROL_CAN_EN_Off          = 0,     /*!< Off : Disabled                                                            */
  MDR_CAN1_CONTROL_CAN_EN_On           = 1,     /*!< On : Enabled                                                              */
} MDR_CAN1_CONTROL_CAN_EN_Enum;

/* ==============================================  MDR_CAN1 CONTROL ROM [1..1]  ============================================== */
typedef enum {                                  /*!< MDR_CAN1_CONTROL_ROM                                                      */
  MDR_CAN1_CONTROL_ROM_Off             = 0,     /*!< Off : Disabled                                                            */
  MDR_CAN1_CONTROL_ROM_On              = 1,     /*!< On : Enabled                                                              */
} MDR_CAN1_CONTROL_ROM_Enum;

/* ==============================================  MDR_CAN1 CONTROL STM [2..2]  ============================================== */
typedef enum {                                  /*!< MDR_CAN1_CONTROL_STM                                                      */
  MDR_CAN1_CONTROL_STM_Off             = 0,     /*!< Off : Disabled                                                            */
  MDR_CAN1_CONTROL_STM_On              = 1,     /*!< On : Enabled                                                              */
} MDR_CAN1_CONTROL_STM_Enum;

/* ==============================================  MDR_CAN1 CONTROL SAP [3..3]  ============================================== */
typedef enum {                                  /*!< MDR_CAN1_CONTROL_SAP                                                      */
  MDR_CAN1_CONTROL_SAP_Off             = 0,     /*!< Off : Disabled                                                            */
  MDR_CAN1_CONTROL_SAP_On              = 1,     /*!< On : Enabled                                                              */
} MDR_CAN1_CONTROL_SAP_Enum;

/* ==============================================  MDR_CAN1 CONTROL ROP [4..4]  ============================================== */
typedef enum {                                  /*!< MDR_CAN1_CONTROL_ROP                                                      */
  MDR_CAN1_CONTROL_ROP_Off             = 0,     /*!< Off : Disabled                                                            */
  MDR_CAN1_CONTROL_ROP_On              = 1,     /*!< On : Enabled                                                              */
} MDR_CAN1_CONTROL_ROP_Enum;

/* ========================================================  STATUS  ========================================================= */
/* ============================================  MDR_CAN1 STATUS RX_Ready [0..0]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_STATUS_RX_Ready                                                  */
  MDR_CAN1_STATUS_RX_Ready_Off         = 0,     /*!< Off : Event Inactive                                                      */
  MDR_CAN1_STATUS_RX_Ready_On          = 1,     /*!< On : Event Active                                                         */
} MDR_CAN1_STATUS_RX_Ready_Enum;

/* ============================================  MDR_CAN1 STATUS TX_Ready [1..1]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_STATUS_TX_Ready                                                  */
  MDR_CAN1_STATUS_TX_Ready_Off         = 0,     /*!< Off : Event Inactive                                                      */
  MDR_CAN1_STATUS_TX_Ready_On          = 1,     /*!< On : Event Active                                                         */
} MDR_CAN1_STATUS_TX_Ready_Enum;

/* ============================================  MDR_CAN1 STATUS ERR_Over [2..2]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_STATUS_ERR_Over                                                  */
  MDR_CAN1_STATUS_ERR_Over_Off         = 0,     /*!< Off : Event Inactive                                                      */
  MDR_CAN1_STATUS_ERR_Over_On          = 1,     /*!< On : Event Active                                                         */
} MDR_CAN1_STATUS_ERR_Over_Enum;

/* ============================================  MDR_CAN1 STATUS ERR_Bit [3..3]  ============================================= */
typedef enum {                                  /*!< MDR_CAN1_STATUS_ERR_Bit                                                   */
  MDR_CAN1_STATUS_ERR_Bit_Off          = 0,     /*!< Off : Event Inactive                                                      */
  MDR_CAN1_STATUS_ERR_Bit_On           = 1,     /*!< On : Event Active                                                         */
} MDR_CAN1_STATUS_ERR_Bit_Enum;

/* ==========================================  MDR_CAN1 STATUS ERR_StuffBit [4..4]  ========================================== */
typedef enum {                                  /*!< MDR_CAN1_STATUS_ERR_StuffBit                                              */
  MDR_CAN1_STATUS_ERR_StuffBit_Off     = 0,     /*!< Off : Event Inactive                                                      */
  MDR_CAN1_STATUS_ERR_StuffBit_On      = 1,     /*!< On : Event Active                                                         */
} MDR_CAN1_STATUS_ERR_StuffBit_Enum;

/* ============================================  MDR_CAN1 STATUS ERR_CRC [5..5]  ============================================= */
typedef enum {                                  /*!< MDR_CAN1_STATUS_ERR_CRC                                                   */
  MDR_CAN1_STATUS_ERR_CRC_Off          = 0,     /*!< Off : Event Inactive                                                      */
  MDR_CAN1_STATUS_ERR_CRC_On           = 1,     /*!< On : Event Active                                                         */
} MDR_CAN1_STATUS_ERR_CRC_Enum;

