StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
/* ===========================================  MDR_CAN1 STATUS ERR_FRAME [6..6]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_STATUS_ERR_FRAME                                                 */
  MDR_CAN1_STATUS_ERR_FRAME_Off        = 0,     /*!< Off : Event Inactive                                                      */
  MDR_CAN1_STATUS_ERR_FRAME_On         = 1,     /*!< On : Event Active                                                         */
} MDR_CAN1_STATUS_ERR_FRAME_Enum;

/* ============================================  MDR_CAN1 STATUS ERR_ACK [7..7]  ============================================= */
typedef enum {                                  /*!< MDR_CAN1_STATUS_ERR_ACK                                                   */
  MDR_CAN1_STATUS_ERR_ACK_Off          = 0,     /*!< Off : Event Inactive                                                      */
  MDR_CAN1_STATUS_ERR_ACK_On           = 1,     /*!< On : Event Active                                                         */
} MDR_CAN1_STATUS_ERR_ACK_Enum;

/* ============================================  MDR_CAN1 STATUS ID_Lover [8..8]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_STATUS_ID_Lover                                                  */
  MDR_CAN1_STATUS_ID_Lover_Off         = 0,     /*!< Off : Event Inactive                                                      */
  MDR_CAN1_STATUS_ID_Lover_On          = 1,     /*!< On : Event Active                                                         */
} MDR_CAN1_STATUS_ID_Lover_Enum;

/* ==========================================  MDR_CAN1 STATUS ERR_Status [9..10]  =========================================== */
typedef enum {                                  /*!< MDR_CAN1_STATUS_ERR_Status                                                */
  MDR_CAN1_STATUS_ERR_Status_Active    = 0,     /*!< Active : Active mode                                                      */
  MDR_CAN1_STATUS_ERR_Status_Passive   = 1,     /*!< Passive : Pasiive error mode                                              */
  MDR_CAN1_STATUS_ERR_Status_BusOff    = 2,     /*!< BusOff : Bus Disable                                                      */
} MDR_CAN1_STATUS_ERR_Status_Enum;

/* =========================================  MDR_CAN1 STATUS RX_ERR_CNT8 [11..11]  ========================================== */
typedef enum {                                  /*!< MDR_CAN1_STATUS_RX_ERR_CNT8                                               */
  MDR_CAN1_STATUS_RX_ERR_CNT8_Off      = 0,     /*!< Off : Event Inactive                                                      */
  MDR_CAN1_STATUS_RX_ERR_CNT8_On       = 1,     /*!< On : Event Active                                                         */
} MDR_CAN1_STATUS_RX_ERR_CNT8_Enum;

/* =========================================  MDR_CAN1 STATUS TX_ERR_CNT8 [12..12]  ========================================== */
typedef enum {                                  /*!< MDR_CAN1_STATUS_TX_ERR_CNT8                                               */
  MDR_CAN1_STATUS_TX_ERR_CNT8_Off      = 0,     /*!< Off : Event Inactive                                                      */
  MDR_CAN1_STATUS_TX_ERR_CNT8_On       = 1,     /*!< On : Event Active                                                         */
} MDR_CAN1_STATUS_TX_ERR_CNT8_Enum;

/* ========================================================  BITTMNG  ======================================================== */
/* ============================================  MDR_CAN1 BITTMNG PSEG [16..18]  ============================================= */
typedef enum {                                  /*!< MDR_CAN1_BITTMNG_PSEG                                                     */
  MDR_CAN1_BITTMNG_PSEG_1TQ            = 0,     /*!< 1TQ : Delay                                                               */
  MDR_CAN1_BITTMNG_PSEG_2TQ            = 1,     /*!< 2TQ : Delay                                                               */
  MDR_CAN1_BITTMNG_PSEG_3TQ            = 2,     /*!< 3TQ : Delay                                                               */
  MDR_CAN1_BITTMNG_PSEG_4TQ            = 3,     /*!< 4TQ : Delay                                                               */
  MDR_CAN1_BITTMNG_PSEG_5TQ            = 4,     /*!< 5TQ : Delay                                                               */
  MDR_CAN1_BITTMNG_PSEG_6TQ            = 5,     /*!< 6TQ : Delay                                                               */
  MDR_CAN1_BITTMNG_PSEG_7TQ            = 6,     /*!< 7TQ : Delay                                                               */
  MDR_CAN1_BITTMNG_PSEG_8TQ            = 7,     /*!< 8TQ : Delay                                                               */
} MDR_CAN1_BITTMNG_PSEG_Enum;

/* ============================================  MDR_CAN1 BITTMNG SEG1 [19..21]  ============================================= */
typedef enum {                                  /*!< MDR_CAN1_BITTMNG_SEG1                                                     */
  MDR_CAN1_BITTMNG_SEG1_1TQ            = 0,     /*!< 1TQ : Delay                                                               */
  MDR_CAN1_BITTMNG_SEG1_2TQ            = 1,     /*!< 2TQ : Delay                                                               */
  MDR_CAN1_BITTMNG_SEG1_3TQ            = 2,     /*!< 3TQ : Delay                                                               */
  MDR_CAN1_BITTMNG_SEG1_4TQ            = 3,     /*!< 4TQ : Delay                                                               */
  MDR_CAN1_BITTMNG_SEG1_5TQ            = 4,     /*!< 5TQ : Delay                                                               */
  MDR_CAN1_BITTMNG_SEG1_6TQ            = 5,     /*!< 6TQ : Delay                                                               */
  MDR_CAN1_BITTMNG_SEG1_7TQ            = 6,     /*!< 7TQ : Delay                                                               */
  MDR_CAN1_BITTMNG_SEG1_8TQ            = 7,     /*!< 8TQ : Delay                                                               */
} MDR_CAN1_BITTMNG_SEG1_Enum;

/* ============================================  MDR_CAN1 BITTMNG SEG2 [22..24]  ============================================= */
typedef enum {                                  /*!< MDR_CAN1_BITTMNG_SEG2                                                     */
  MDR_CAN1_BITTMNG_SEG2_1TQ            = 0,     /*!< 1TQ : Delay                                                               */
  MDR_CAN1_BITTMNG_SEG2_2TQ            = 1,     /*!< 2TQ : Delay                                                               */
  MDR_CAN1_BITTMNG_SEG2_3TQ            = 2,     /*!< 3TQ : Delay                                                               */
  MDR_CAN1_BITTMNG_SEG2_4TQ            = 3,     /*!< 4TQ : Delay                                                               */
  MDR_CAN1_BITTMNG_SEG2_5TQ            = 4,     /*!< 5TQ : Delay                                                               */
  MDR_CAN1_BITTMNG_SEG2_6TQ            = 5,     /*!< 6TQ : Delay                                                               */
  MDR_CAN1_BITTMNG_SEG2_7TQ            = 6,     /*!< 7TQ : Delay                                                               */
  MDR_CAN1_BITTMNG_SEG2_8TQ            = 7,     /*!< 8TQ : Delay                                                               */
} MDR_CAN1_BITTMNG_SEG2_Enum;

/* =============================================  MDR_CAN1 BITTMNG SJW [25..26]  ============================================= */
typedef enum {                                  /*!< MDR_CAN1_BITTMNG_SJW                                                      */
  MDR_CAN1_BITTMNG_SJW_1TQ             = 0,     /*!< 1TQ : Delay                                                               */
  MDR_CAN1_BITTMNG_SJW_2TQ             = 1,     /*!< 2TQ : Delay                                                               */
  MDR_CAN1_BITTMNG_SJW_3TQ             = 2,     /*!< 3TQ : Delay                                                               */
  MDR_CAN1_BITTMNG_SJW_4TQ             = 3,     /*!< 4TQ : Delay                                                               */
} MDR_CAN1_BITTMNG_SJW_Enum;

/* =============================================  MDR_CAN1 BITTMNG SB [27..27]  ============================================== */
typedef enum {                                  /*!< MDR_CAN1_BITTMNG_SB                                                       */
  MDR_CAN1_BITTMNG_SB_Single           = 0,     /*!< Single : Single sampling                                                  */
  MDR_CAN1_BITTMNG_SB_Triple           = 1,     /*!< Triple : Triple sampling                                                  */
} MDR_CAN1_BITTMNG_SB_Enum;

/* ========================================================  INT_EN  ========================================================= */
/* ===========================================  MDR_CAN1 INT_EN GLB_IntEn [0..0]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_INT_EN_GLB_IntEn                                                 */
  MDR_CAN1_INT_EN_GLB_IntEn_Disabled   = 0,     /*!< Disabled : Disable IRQ                                                    */
  MDR_CAN1_INT_EN_GLB_IntEn_Enabled    = 1,     /*!< Enabled : Enable IRQ                                                      */
} MDR_CAN1_INT_EN_GLB_IntEn_Enum;

/* ============================================  MDR_CAN1 INT_EN RX_IntEn [1..1]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_INT_EN_RX_IntEn                                                  */
  MDR_CAN1_INT_EN_RX_IntEn_Disabled    = 0,     /*!< Disabled : Disable IRQ                                                    */
  MDR_CAN1_INT_EN_RX_IntEn_Enabled     = 1,     /*!< Enabled : Enable IRQ                                                      */
} MDR_CAN1_INT_EN_RX_IntEn_Enum;

/* ============================================  MDR_CAN1 INT_EN TX_IntEn [2..2]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_INT_EN_TX_IntEn                                                  */
  MDR_CAN1_INT_EN_TX_IntEn_Disabled    = 0,     /*!< Disabled : Disable IRQ                                                    */
  MDR_CAN1_INT_EN_TX_IntEn_Enabled     = 1,     /*!< Enabled : Enable IRQ                                                      */
} MDR_CAN1_INT_EN_TX_IntEn_Enum;

/* ===========================================  MDR_CAN1 INT_EN ERR_IntEn [3..3]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_INT_EN_ERR_IntEn                                                 */
  MDR_CAN1_INT_EN_ERR_IntEn_Disabled   = 0,     /*!< Disabled : Disable IRQ                                                    */
  MDR_CAN1_INT_EN_ERR_IntEn_Enabled    = 1,     /*!< Enabled : Enable IRQ                                                      */
} MDR_CAN1_INT_EN_ERR_IntEn_Enum;

/* ==========================================  MDR_CAN1 INT_EN ErrOV_IntEn [4..4]  =========================================== */
typedef enum {                                  /*!< MDR_CAN1_INT_EN_ErrOV_IntEn                                               */
  MDR_CAN1_INT_EN_ErrOV_IntEn_Disabled = 0,     /*!< Disabled : Disable IRQ                                                    */
  MDR_CAN1_INT_EN_ErrOV_IntEn_Enabled  = 1,     /*!< Enabled : Enable IRQ                                                      */
} MDR_CAN1_INT_EN_ErrOV_IntEn_Enum;

