StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
/* =========================================================  OVER  ========================================================== */
/* =========================================================  RX_ID  ========================================================= */
/* ========================================================  RX_DLC  ========================================================= */
/* ==============================================  MDR_CAN1 RX_DLC DLC [0..3]  =============================================== */
typedef enum {                                  /*!< MDR_CAN1_RX_DLC_DLC                                                       */
  MDR_CAN1_RX_DLC_DLC_NoData           = 0,     /*!< NoData : Normal Operation                                                 */
  MDR_CAN1_RX_DLC_DLC_Bytes_1          = 1,     /*!< Bytes_1 : Byte Count                                                      */
  MDR_CAN1_RX_DLC_DLC_Bytes_2          = 2,     /*!< Bytes_2 : Byte Count                                                      */
  MDR_CAN1_RX_DLC_DLC_Bytes_3          = 3,     /*!< Bytes_3 : Byte Count                                                      */
  MDR_CAN1_RX_DLC_DLC_Bytes_4          = 4,     /*!< Bytes_4 : Byte Count                                                      */
  MDR_CAN1_RX_DLC_DLC_Bytes_5          = 5,     /*!< Bytes_5 : Byte Count                                                      */
  MDR_CAN1_RX_DLC_DLC_Bytes_6          = 6,     /*!< Bytes_6 : Byte Count                                                      */
  MDR_CAN1_RX_DLC_DLC_Bytes_7          = 7,     /*!< Bytes_7 : Byte Count                                                      */
  MDR_CAN1_RX_DLC_DLC_Bytes_8          = 8,     /*!< Bytes_8 : Byte Count                                                      */
} MDR_CAN1_RX_DLC_DLC_Enum;

/* ==============================================  MDR_CAN1 RX_DLC RTR [8..8]  =============================================== */
typedef enum {                                  /*!< MDR_CAN1_RX_DLC_RTR                                                       */
  MDR_CAN1_RX_DLC_RTR_Off              = 0,     /*!< Off : Disabled                                                            */
  MDR_CAN1_RX_DLC_RTR_On               = 1,     /*!< On : Enabled                                                              */
} MDR_CAN1_RX_DLC_RTR_Enum;

/* ===============================================  MDR_CAN1 RX_DLC R1 [9..9]  =============================================== */
typedef enum {                                  /*!< MDR_CAN1_RX_DLC_R1                                                        */
  MDR_CAN1_RX_DLC_R1_Off               = 0,     /*!< Off : Disabled                                                            */
  MDR_CAN1_RX_DLC_R1_On                = 1,     /*!< On : Enabled                                                              */
} MDR_CAN1_RX_DLC_R1_Enum;

/* ==============================================  MDR_CAN1 RX_DLC R0 [10..10]  ============================================== */
typedef enum {                                  /*!< MDR_CAN1_RX_DLC_R0                                                        */
  MDR_CAN1_RX_DLC_R0_Off               = 0,     /*!< Off : Disabled                                                            */
  MDR_CAN1_RX_DLC_R0_On                = 1,     /*!< On : Enabled                                                              */
} MDR_CAN1_RX_DLC_R0_Enum;

/* =============================================  MDR_CAN1 RX_DLC SRR [11..11]  ============================================== */
typedef enum {                                  /*!< MDR_CAN1_RX_DLC_SRR                                                       */
  MDR_CAN1_RX_DLC_SRR_Off              = 0,     /*!< Off : Disabled                                                            */
  MDR_CAN1_RX_DLC_SRR_On               = 1,     /*!< On : Enabled                                                              */
} MDR_CAN1_RX_DLC_SRR_Enum;

/* =============================================  MDR_CAN1 RX_DLC IDE [12..12]  ============================================== */
typedef enum {                                  /*!< MDR_CAN1_RX_DLC_IDE                                                       */
  MDR_CAN1_RX_DLC_IDE_Standard         = 0,     /*!< Standard : Standard frame                                                 */
  MDR_CAN1_RX_DLC_IDE_Extended         = 1,     /*!< Extended : Extended frame                                                 */
} MDR_CAN1_RX_DLC_IDE_Enum;

/* =======================================================  RX_DATAL  ======================================================== */
/* =======================================================  RX_DATAH  ======================================================== */
/* =========================================================  TX_ID  ========================================================= */
/* ========================================================  TX_DLC  ========================================================= */
/* ==============================================  MDR_CAN1 TX_DLC DLC [0..3]  =============================================== */
typedef enum {                                  /*!< MDR_CAN1_TX_DLC_DLC                                                       */
  MDR_CAN1_TX_DLC_DLC_NoData           = 0,     /*!< NoData : Normal Operation                                                 */
  MDR_CAN1_TX_DLC_DLC_Bytes_1          = 1,     /*!< Bytes_1 : Byte Count                                                      */
  MDR_CAN1_TX_DLC_DLC_Bytes_2          = 2,     /*!< Bytes_2 : Byte Count                                                      */
  MDR_CAN1_TX_DLC_DLC_Bytes_3          = 3,     /*!< Bytes_3 : Byte Count                                                      */
  MDR_CAN1_TX_DLC_DLC_Bytes_4          = 4,     /*!< Bytes_4 : Byte Count                                                      */
  MDR_CAN1_TX_DLC_DLC_Bytes_5          = 5,     /*!< Bytes_5 : Byte Count                                                      */
  MDR_CAN1_TX_DLC_DLC_Bytes_6          = 6,     /*!< Bytes_6 : Byte Count                                                      */
  MDR_CAN1_TX_DLC_DLC_Bytes_7          = 7,     /*!< Bytes_7 : Byte Count                                                      */
  MDR_CAN1_TX_DLC_DLC_Bytes_8          = 8,     /*!< Bytes_8 : Byte Count                                                      */
} MDR_CAN1_TX_DLC_DLC_Enum;

/* ==============================================  MDR_CAN1 TX_DLC RTR [8..8]  =============================================== */
typedef enum {                                  /*!< MDR_CAN1_TX_DLC_RTR                                                       */
  MDR_CAN1_TX_DLC_RTR_Off              = 0,     /*!< Off : Disabled                                                            */
  MDR_CAN1_TX_DLC_RTR_On               = 1,     /*!< On : Enabled                                                              */
} MDR_CAN1_TX_DLC_RTR_Enum;

/* ===============================================  MDR_CAN1 TX_DLC R1 [9..9]  =============================================== */
typedef enum {                                  /*!< MDR_CAN1_TX_DLC_R1                                                        */
  MDR_CAN1_TX_DLC_R1_Off               = 0,     /*!< Off : Disabled                                                            */
  MDR_CAN1_TX_DLC_R1_On                = 1,     /*!< On : Enabled                                                              */
} MDR_CAN1_TX_DLC_R1_Enum;

/* ==============================================  MDR_CAN1 TX_DLC R0 [10..10]  ============================================== */
typedef enum {                                  /*!< MDR_CAN1_TX_DLC_R0                                                        */
  MDR_CAN1_TX_DLC_R0_Off               = 0,     /*!< Off : Disabled                                                            */
  MDR_CAN1_TX_DLC_R0_On                = 1,     /*!< On : Enabled                                                              */
} MDR_CAN1_TX_DLC_R0_Enum;

/* =============================================  MDR_CAN1 TX_DLC SRR [11..11]  ============================================== */
typedef enum {                                  /*!< MDR_CAN1_TX_DLC_SRR                                                       */
  MDR_CAN1_TX_DLC_SRR_Off              = 0,     /*!< Off : Disabled                                                            */
  MDR_CAN1_TX_DLC_SRR_On               = 1,     /*!< On : Enabled                                                              */
} MDR_CAN1_TX_DLC_SRR_Enum;

