StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
/* =============================================  MDR_CAN1 TX_DLC IDE [12..12]  ============================================== */
typedef enum {                                  /*!< MDR_CAN1_TX_DLC_IDE                                                       */
  MDR_CAN1_TX_DLC_IDE_Standard         = 0,     /*!< Standard : Standard frame                                                 */
  MDR_CAN1_TX_DLC_IDE_Extended         = 1,     /*!< Extended : Extended frame                                                 */
} MDR_CAN1_TX_DLC_IDE_Enum;

/* =======================================================  TX_DATAL  ======================================================== */
/* =======================================================  TX_DATAH  ======================================================== */
/* =======================================================  BUF_CON0  ======================================================== */
/* ==============================================  MDR_CAN1 BUF_CON0 EN [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON0_EN                                      */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON0_EN_Off = 0, /*!< Off : Disabled                                                            */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON0_EN_On = 1,  /*!< On : Enabled                                                              */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON0_EN_Enum;

/* ============================================  MDR_CAN1 BUF_CON0 RX_TX [1..1]  ============================================= */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON0_RX_TX                                   */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON0_RX_TX_TX = 0,/*!< TX : Output buffer                                                       */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON0_RX_TX_RX = 1,/*!< RX : Input buffer                                                        */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON0_RX_TX_Enum;

/* ===========================================  MDR_CAN1 BUF_CON0 OVER_EN [2..2]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON0_OVER_EN                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON0_OVER_EN_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON0_OVER_EN_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON0_OVER_EN_Enum;

/* ============================================  MDR_CAN1 BUF_CON0 RTR_EN [3..3]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON0_RTR_EN                                  */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON0_RTR_EN_Off = 0,/*!< Off : Disabled                                                         */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON0_RTR_EN_On = 1,/*!< On : Enabled                                                            */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON0_RTR_EN_Enum;

/* ==========================================  MDR_CAN1 BUF_CON0 PRIOR_OFF [4..4]  =========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON0_PRIOR_OFF                               */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON0_PRIOR_OFF_Off = 0,/*!< Off : Disabled                                                      */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON0_PRIOR_OFF_On = 1,/*!< On : Enabled                                                         */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON0_PRIOR_OFF_Enum;

/* ============================================  MDR_CAN1 BUF_CON0 TX_REQ [5..5]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON0_TX_REQ                                  */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON0_TX_REQ_Off = 0,/*!< Off : Disabled                                                         */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON0_TX_REQ_On = 1,/*!< On : Enabled                                                            */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON0_TX_REQ_Enum;

/* ===========================================  MDR_CAN1 BUF_CON0 RX_FULL [6..6]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON0_RX_FULL                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON0_RX_FULL_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON0_RX_FULL_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON0_RX_FULL_Enum;

/* ===========================================  MDR_CAN1 BUF_CON0 OVER_WR [7..7]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON0_OVER_WR                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON0_OVER_WR_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON0_OVER_WR_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON0_OVER_WR_Enum;

/* =======================================================  BUF_CON1  ======================================================== */
/* ==============================================  MDR_CAN1 BUF_CON1 EN [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON1_EN                                      */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON1_EN_Off = 0, /*!< Off : Disabled                                                            */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON1_EN_On = 1,  /*!< On : Enabled                                                              */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON1_EN_Enum;

/* ============================================  MDR_CAN1 BUF_CON1 RX_TX [1..1]  ============================================= */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON1_RX_TX                                   */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON1_RX_TX_TX = 0,/*!< TX : Output buffer                                                       */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON1_RX_TX_RX = 1,/*!< RX : Input buffer                                                        */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON1_RX_TX_Enum;

/* ===========================================  MDR_CAN1 BUF_CON1 OVER_EN [2..2]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON1_OVER_EN                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON1_OVER_EN_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON1_OVER_EN_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON1_OVER_EN_Enum;

/* ============================================  MDR_CAN1 BUF_CON1 RTR_EN [3..3]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON1_RTR_EN                                  */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON1_RTR_EN_Off = 0,/*!< Off : Disabled                                                         */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON1_RTR_EN_On = 1,/*!< On : Enabled                                                            */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON1_RTR_EN_Enum;

