StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
/* ===========================================  MDR_CAN1 BUF_CON3 RX_FULL [6..6]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON3_RX_FULL                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON3_RX_FULL_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON3_RX_FULL_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON3_RX_FULL_Enum;

/* ===========================================  MDR_CAN1 BUF_CON3 OVER_WR [7..7]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON3_OVER_WR                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON3_OVER_WR_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON3_OVER_WR_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON3_OVER_WR_Enum;

/* =======================================================  BUF_CON4  ======================================================== */
/* ==============================================  MDR_CAN1 BUF_CON4 EN [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON4_EN                                      */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON4_EN_Off = 0, /*!< Off : Disabled                                                            */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON4_EN_On = 1,  /*!< On : Enabled                                                              */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON4_EN_Enum;

/* ============================================  MDR_CAN1 BUF_CON4 RX_TX [1..1]  ============================================= */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON4_RX_TX                                   */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON4_RX_TX_TX = 0,/*!< TX : Output buffer                                                       */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON4_RX_TX_RX = 1,/*!< RX : Input buffer                                                        */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON4_RX_TX_Enum;

/* ===========================================  MDR_CAN1 BUF_CON4 OVER_EN [2..2]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON4_OVER_EN                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON4_OVER_EN_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON4_OVER_EN_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON4_OVER_EN_Enum;

/* ============================================  MDR_CAN1 BUF_CON4 RTR_EN [3..3]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON4_RTR_EN                                  */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON4_RTR_EN_Off = 0,/*!< Off : Disabled                                                         */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON4_RTR_EN_On = 1,/*!< On : Enabled                                                            */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON4_RTR_EN_Enum;

/* ==========================================  MDR_CAN1 BUF_CON4 PRIOR_OFF [4..4]  =========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON4_PRIOR_OFF                               */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON4_PRIOR_OFF_Off = 0,/*!< Off : Disabled                                                      */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON4_PRIOR_OFF_On = 1,/*!< On : Enabled                                                         */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON4_PRIOR_OFF_Enum;

/* ============================================  MDR_CAN1 BUF_CON4 TX_REQ [5..5]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON4_TX_REQ                                  */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON4_TX_REQ_Off = 0,/*!< Off : Disabled                                                         */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON4_TX_REQ_On = 1,/*!< On : Enabled                                                            */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON4_TX_REQ_Enum;

/* ===========================================  MDR_CAN1 BUF_CON4 RX_FULL [6..6]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON4_RX_FULL                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON4_RX_FULL_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON4_RX_FULL_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON4_RX_FULL_Enum;

/* ===========================================  MDR_CAN1 BUF_CON4 OVER_WR [7..7]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON4_OVER_WR                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON4_OVER_WR_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON4_OVER_WR_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON4_OVER_WR_Enum;

/* =======================================================  BUF_CON5  ======================================================== */
/* ==============================================  MDR_CAN1 BUF_CON5 EN [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON5_EN                                      */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON5_EN_Off = 0, /*!< Off : Disabled                                                            */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON5_EN_On = 1,  /*!< On : Enabled                                                              */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON5_EN_Enum;

/* ============================================  MDR_CAN1 BUF_CON5 RX_TX [1..1]  ============================================= */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON5_RX_TX                                   */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON5_RX_TX_TX = 0,/*!< TX : Output buffer                                                       */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON5_RX_TX_RX = 1,/*!< RX : Input buffer                                                        */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON5_RX_TX_Enum;

/* ===========================================  MDR_CAN1 BUF_CON5 OVER_EN [2..2]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON5_OVER_EN                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON5_OVER_EN_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON5_OVER_EN_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON5_OVER_EN_Enum;

/* ============================================  MDR_CAN1 BUF_CON5 RTR_EN [3..3]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON5_RTR_EN                                  */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON5_RTR_EN_Off = 0,/*!< Off : Disabled                                                         */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON5_RTR_EN_On = 1,/*!< On : Enabled                                                            */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON5_RTR_EN_Enum;

/* ==========================================  MDR_CAN1 BUF_CON5 PRIOR_OFF [4..4]  =========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON5_PRIOR_OFF                               */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON5_PRIOR_OFF_Off = 0,/*!< Off : Disabled                                                      */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON5_PRIOR_OFF_On = 1,/*!< On : Enabled                                                         */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON5_PRIOR_OFF_Enum;

/* ============================================  MDR_CAN1 BUF_CON5 TX_REQ [5..5]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON5_TX_REQ                                  */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON5_TX_REQ_Off = 0,/*!< Off : Disabled                                                         */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON5_TX_REQ_On = 1,/*!< On : Enabled                                                            */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON5_TX_REQ_Enum;

/* ===========================================  MDR_CAN1 BUF_CON5 RX_FULL [6..6]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON5_RX_FULL                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON5_RX_FULL_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON5_RX_FULL_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON5_RX_FULL_Enum;

/* ===========================================  MDR_CAN1 BUF_CON5 OVER_WR [7..7]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON5_OVER_WR                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON5_OVER_WR_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON5_OVER_WR_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON5_OVER_WR_Enum;

/* =======================================================  BUF_CON6  ======================================================== */
/* ==============================================  MDR_CAN1 BUF_CON6 EN [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON6_EN                                      */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON6_EN_Off = 0, /*!< Off : Disabled                                                            */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON6_EN_On = 1,  /*!< On : Enabled                                                              */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON6_EN_Enum;

/* ============================================  MDR_CAN1 BUF_CON6 RX_TX [1..1]  ============================================= */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON6_RX_TX                                   */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON6_RX_TX_TX = 0,/*!< TX : Output buffer                                                       */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON6_RX_TX_RX = 1,/*!< RX : Input buffer                                                        */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON6_RX_TX_Enum;

/* ===========================================  MDR_CAN1 BUF_CON6 OVER_EN [2..2]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON6_OVER_EN                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON6_OVER_EN_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON6_OVER_EN_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON6_OVER_EN_Enum;

