StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
/* ============================================  MDR_CAN1 BUF_CON6 RTR_EN [3..3]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON6_RTR_EN                                  */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON6_RTR_EN_Off = 0,/*!< Off : Disabled                                                         */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON6_RTR_EN_On = 1,/*!< On : Enabled                                                            */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON6_RTR_EN_Enum;

/* ==========================================  MDR_CAN1 BUF_CON6 PRIOR_OFF [4..4]  =========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON6_PRIOR_OFF                               */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON6_PRIOR_OFF_Off = 0,/*!< Off : Disabled                                                      */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON6_PRIOR_OFF_On = 1,/*!< On : Enabled                                                         */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON6_PRIOR_OFF_Enum;

/* ============================================  MDR_CAN1 BUF_CON6 TX_REQ [5..5]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON6_TX_REQ                                  */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON6_TX_REQ_Off = 0,/*!< Off : Disabled                                                         */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON6_TX_REQ_On = 1,/*!< On : Enabled                                                            */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON6_TX_REQ_Enum;

/* ===========================================  MDR_CAN1 BUF_CON6 RX_FULL [6..6]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON6_RX_FULL                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON6_RX_FULL_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON6_RX_FULL_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON6_RX_FULL_Enum;

/* ===========================================  MDR_CAN1 BUF_CON6 OVER_WR [7..7]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON6_OVER_WR                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON6_OVER_WR_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON6_OVER_WR_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON6_OVER_WR_Enum;

/* =======================================================  BUF_CON7  ======================================================== */
/* ==============================================  MDR_CAN1 BUF_CON7 EN [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON7_EN                                      */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON7_EN_Off = 0, /*!< Off : Disabled                                                            */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON7_EN_On = 1,  /*!< On : Enabled                                                              */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON7_EN_Enum;

/* ============================================  MDR_CAN1 BUF_CON7 RX_TX [1..1]  ============================================= */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON7_RX_TX                                   */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON7_RX_TX_TX = 0,/*!< TX : Output buffer                                                       */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON7_RX_TX_RX = 1,/*!< RX : Input buffer                                                        */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON7_RX_TX_Enum;

/* ===========================================  MDR_CAN1 BUF_CON7 OVER_EN [2..2]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON7_OVER_EN                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON7_OVER_EN_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON7_OVER_EN_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON7_OVER_EN_Enum;

/* ============================================  MDR_CAN1 BUF_CON7 RTR_EN [3..3]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON7_RTR_EN                                  */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON7_RTR_EN_Off = 0,/*!< Off : Disabled                                                         */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON7_RTR_EN_On = 1,/*!< On : Enabled                                                            */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON7_RTR_EN_Enum;

/* ==========================================  MDR_CAN1 BUF_CON7 PRIOR_OFF [4..4]  =========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON7_PRIOR_OFF                               */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON7_PRIOR_OFF_Off = 0,/*!< Off : Disabled                                                      */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON7_PRIOR_OFF_On = 1,/*!< On : Enabled                                                         */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON7_PRIOR_OFF_Enum;

/* ============================================  MDR_CAN1 BUF_CON7 TX_REQ [5..5]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON7_TX_REQ                                  */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON7_TX_REQ_Off = 0,/*!< Off : Disabled                                                         */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON7_TX_REQ_On = 1,/*!< On : Enabled                                                            */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON7_TX_REQ_Enum;

/* ===========================================  MDR_CAN1 BUF_CON7 RX_FULL [6..6]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON7_RX_FULL                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON7_RX_FULL_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON7_RX_FULL_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON7_RX_FULL_Enum;

/* ===========================================  MDR_CAN1 BUF_CON7 OVER_WR [7..7]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON7_OVER_WR                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON7_OVER_WR_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON7_OVER_WR_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON7_OVER_WR_Enum;

/* =======================================================  BUF_CON8  ======================================================== */
/* ==============================================  MDR_CAN1 BUF_CON8 EN [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON8_EN                                      */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON8_EN_Off = 0, /*!< Off : Disabled                                                            */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON8_EN_On = 1,  /*!< On : Enabled                                                              */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON8_EN_Enum;

/* ============================================  MDR_CAN1 BUF_CON8 RX_TX [1..1]  ============================================= */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON8_RX_TX                                   */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON8_RX_TX_TX = 0,/*!< TX : Output buffer                                                       */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON8_RX_TX_RX = 1,/*!< RX : Input buffer                                                        */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON8_RX_TX_Enum;

/* ===========================================  MDR_CAN1 BUF_CON8 OVER_EN [2..2]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON8_OVER_EN                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON8_OVER_EN_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON8_OVER_EN_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON8_OVER_EN_Enum;

/* ============================================  MDR_CAN1 BUF_CON8 RTR_EN [3..3]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON8_RTR_EN                                  */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON8_RTR_EN_Off = 0,/*!< Off : Disabled                                                         */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON8_RTR_EN_On = 1,/*!< On : Enabled                                                            */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON8_RTR_EN_Enum;

