StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
/* ===========================================  MDR_CAN1 BUF_CON13 RTR_EN [3..3]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON13_RTR_EN                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON13_RTR_EN_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON13_RTR_EN_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON13_RTR_EN_Enum;

/* ==========================================  MDR_CAN1 BUF_CON13 PRIOR_OFF [4..4]  ========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON13_PRIOR_OFF                              */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON13_PRIOR_OFF_Off = 0,/*!< Off : Disabled                                                     */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON13_PRIOR_OFF_On = 1,/*!< On : Enabled                                                        */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON13_PRIOR_OFF_Enum;

/* ===========================================  MDR_CAN1 BUF_CON13 TX_REQ [5..5]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON13_TX_REQ                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON13_TX_REQ_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON13_TX_REQ_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON13_TX_REQ_Enum;

/* ===========================================  MDR_CAN1 BUF_CON13 RX_FULL [6..6]  =========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON13_RX_FULL                                */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON13_RX_FULL_Off = 0,/*!< Off : Disabled                                                       */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON13_RX_FULL_On = 1,/*!< On : Enabled                                                          */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON13_RX_FULL_Enum;

/* ===========================================  MDR_CAN1 BUF_CON13 OVER_WR [7..7]  =========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON13_OVER_WR                                */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON13_OVER_WR_Off = 0,/*!< Off : Disabled                                                       */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON13_OVER_WR_On = 1,/*!< On : Enabled                                                          */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON13_OVER_WR_Enum;

/* =======================================================  BUF_CON14  ======================================================= */
/* =============================================  MDR_CAN1 BUF_CON14 EN [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON14_EN                                     */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON14_EN_Off = 0,/*!< Off : Disabled                                                            */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON14_EN_On = 1, /*!< On : Enabled                                                              */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON14_EN_Enum;

/* ============================================  MDR_CAN1 BUF_CON14 RX_TX [1..1]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON14_RX_TX                                  */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON14_RX_TX_TX = 0,/*!< TX : Output buffer                                                      */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON14_RX_TX_RX = 1,/*!< RX : Input buffer                                                       */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON14_RX_TX_Enum;

/* ===========================================  MDR_CAN1 BUF_CON14 OVER_EN [2..2]  =========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON14_OVER_EN                                */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON14_OVER_EN_Off = 0,/*!< Off : Disabled                                                       */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON14_OVER_EN_On = 1,/*!< On : Enabled                                                          */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON14_OVER_EN_Enum;

/* ===========================================  MDR_CAN1 BUF_CON14 RTR_EN [3..3]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON14_RTR_EN                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON14_RTR_EN_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON14_RTR_EN_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON14_RTR_EN_Enum;

/* ==========================================  MDR_CAN1 BUF_CON14 PRIOR_OFF [4..4]  ========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON14_PRIOR_OFF                              */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON14_PRIOR_OFF_Off = 0,/*!< Off : Disabled                                                     */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON14_PRIOR_OFF_On = 1,/*!< On : Enabled                                                        */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON14_PRIOR_OFF_Enum;

/* ===========================================  MDR_CAN1 BUF_CON14 TX_REQ [5..5]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON14_TX_REQ                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON14_TX_REQ_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON14_TX_REQ_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON14_TX_REQ_Enum;

/* ===========================================  MDR_CAN1 BUF_CON14 RX_FULL [6..6]  =========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON14_RX_FULL                                */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON14_RX_FULL_Off = 0,/*!< Off : Disabled                                                       */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON14_RX_FULL_On = 1,/*!< On : Enabled                                                          */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON14_RX_FULL_Enum;

/* ===========================================  MDR_CAN1 BUF_CON14 OVER_WR [7..7]  =========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON14_OVER_WR                                */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON14_OVER_WR_Off = 0,/*!< Off : Disabled                                                       */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON14_OVER_WR_On = 1,/*!< On : Enabled                                                          */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON14_OVER_WR_Enum;

/* =======================================================  BUF_CON15  ======================================================= */
/* =============================================  MDR_CAN1 BUF_CON15 EN [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON15_EN                                     */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON15_EN_Off = 0,/*!< Off : Disabled                                                            */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON15_EN_On = 1, /*!< On : Enabled                                                              */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON15_EN_Enum;

/* ============================================  MDR_CAN1 BUF_CON15 RX_TX [1..1]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON15_RX_TX                                  */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON15_RX_TX_TX = 0,/*!< TX : Output buffer                                                      */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON15_RX_TX_RX = 1,/*!< RX : Input buffer                                                       */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON15_RX_TX_Enum;

/* ===========================================  MDR_CAN1 BUF_CON15 OVER_EN [2..2]  =========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON15_OVER_EN                                */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON15_OVER_EN_Off = 0,/*!< Off : Disabled                                                       */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON15_OVER_EN_On = 1,/*!< On : Enabled                                                          */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON15_OVER_EN_Enum;

