StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
/* ===========================================  MDR_CAN1 BUF_CON15 RTR_EN [3..3]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON15_RTR_EN                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON15_RTR_EN_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON15_RTR_EN_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON15_RTR_EN_Enum;

/* ==========================================  MDR_CAN1 BUF_CON15 PRIOR_OFF [4..4]  ========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON15_PRIOR_OFF                              */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON15_PRIOR_OFF_Off = 0,/*!< Off : Disabled                                                     */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON15_PRIOR_OFF_On = 1,/*!< On : Enabled                                                        */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON15_PRIOR_OFF_Enum;

/* ===========================================  MDR_CAN1 BUF_CON15 TX_REQ [5..5]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON15_TX_REQ                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON15_TX_REQ_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON15_TX_REQ_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON15_TX_REQ_Enum;

/* ===========================================  MDR_CAN1 BUF_CON15 RX_FULL [6..6]  =========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON15_RX_FULL                                */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON15_RX_FULL_Off = 0,/*!< Off : Disabled                                                       */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON15_RX_FULL_On = 1,/*!< On : Enabled                                                          */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON15_RX_FULL_Enum;

/* ===========================================  MDR_CAN1 BUF_CON15 OVER_WR [7..7]  =========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON15_OVER_WR                                */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON15_OVER_WR_Off = 0,/*!< Off : Disabled                                                       */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON15_OVER_WR_On = 1,/*!< On : Enabled                                                          */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON15_OVER_WR_Enum;

/* =======================================================  BUF_CON16  ======================================================= */
/* =============================================  MDR_CAN1 BUF_CON16 EN [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON16_EN                                     */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON16_EN_Off = 0,/*!< Off : Disabled                                                            */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON16_EN_On = 1, /*!< On : Enabled                                                              */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON16_EN_Enum;

/* ============================================  MDR_CAN1 BUF_CON16 RX_TX [1..1]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON16_RX_TX                                  */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON16_RX_TX_TX = 0,/*!< TX : Output buffer                                                      */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON16_RX_TX_RX = 1,/*!< RX : Input buffer                                                       */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON16_RX_TX_Enum;

/* ===========================================  MDR_CAN1 BUF_CON16 OVER_EN [2..2]  =========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON16_OVER_EN                                */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON16_OVER_EN_Off = 0,/*!< Off : Disabled                                                       */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON16_OVER_EN_On = 1,/*!< On : Enabled                                                          */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON16_OVER_EN_Enum;

/* ===========================================  MDR_CAN1 BUF_CON16 RTR_EN [3..3]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON16_RTR_EN                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON16_RTR_EN_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON16_RTR_EN_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON16_RTR_EN_Enum;

/* ==========================================  MDR_CAN1 BUF_CON16 PRIOR_OFF [4..4]  ========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON16_PRIOR_OFF                              */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON16_PRIOR_OFF_Off = 0,/*!< Off : Disabled                                                     */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON16_PRIOR_OFF_On = 1,/*!< On : Enabled                                                        */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON16_PRIOR_OFF_Enum;

/* ===========================================  MDR_CAN1 BUF_CON16 TX_REQ [5..5]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON16_TX_REQ                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON16_TX_REQ_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON16_TX_REQ_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON16_TX_REQ_Enum;

/* ===========================================  MDR_CAN1 BUF_CON16 RX_FULL [6..6]  =========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON16_RX_FULL                                */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON16_RX_FULL_Off = 0,/*!< Off : Disabled                                                       */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON16_RX_FULL_On = 1,/*!< On : Enabled                                                          */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON16_RX_FULL_Enum;

/* ===========================================  MDR_CAN1 BUF_CON16 OVER_WR [7..7]  =========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON16_OVER_WR                                */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON16_OVER_WR_Off = 0,/*!< Off : Disabled                                                       */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON16_OVER_WR_On = 1,/*!< On : Enabled                                                          */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON16_OVER_WR_Enum;

/* =======================================================  BUF_CON17  ======================================================= */
/* =============================================  MDR_CAN1 BUF_CON17 EN [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON17_EN                                     */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON17_EN_Off = 0,/*!< Off : Disabled                                                            */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON17_EN_On = 1, /*!< On : Enabled                                                              */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON17_EN_Enum;

/* ============================================  MDR_CAN1 BUF_CON17 RX_TX [1..1]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON17_RX_TX                                  */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON17_RX_TX_TX = 0,/*!< TX : Output buffer                                                      */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON17_RX_TX_RX = 1,/*!< RX : Input buffer                                                       */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON17_RX_TX_Enum;

/* ===========================================  MDR_CAN1 BUF_CON17 OVER_EN [2..2]  =========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON17_OVER_EN                                */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON17_OVER_EN_Off = 0,/*!< Off : Disabled                                                       */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON17_OVER_EN_On = 1,/*!< On : Enabled                                                          */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON17_OVER_EN_Enum;

/* ===========================================  MDR_CAN1 BUF_CON17 RTR_EN [3..3]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON17_RTR_EN                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON17_RTR_EN_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON17_RTR_EN_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON17_RTR_EN_Enum;

