StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
/* ============================================  MDR_CAN1 BUF_CON21 RX_TX [1..1]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON21_RX_TX                                  */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON21_RX_TX_TX = 0,/*!< TX : Output buffer                                                      */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON21_RX_TX_RX = 1,/*!< RX : Input buffer                                                       */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON21_RX_TX_Enum;

/* ===========================================  MDR_CAN1 BUF_CON21 OVER_EN [2..2]  =========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON21_OVER_EN                                */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON21_OVER_EN_Off = 0,/*!< Off : Disabled                                                       */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON21_OVER_EN_On = 1,/*!< On : Enabled                                                          */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON21_OVER_EN_Enum;

/* ===========================================  MDR_CAN1 BUF_CON21 RTR_EN [3..3]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON21_RTR_EN                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON21_RTR_EN_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON21_RTR_EN_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON21_RTR_EN_Enum;

/* ==========================================  MDR_CAN1 BUF_CON21 PRIOR_OFF [4..4]  ========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON21_PRIOR_OFF                              */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON21_PRIOR_OFF_Off = 0,/*!< Off : Disabled                                                     */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON21_PRIOR_OFF_On = 1,/*!< On : Enabled                                                        */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON21_PRIOR_OFF_Enum;

/* ===========================================  MDR_CAN1 BUF_CON21 TX_REQ [5..5]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON21_TX_REQ                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON21_TX_REQ_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON21_TX_REQ_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON21_TX_REQ_Enum;

/* ===========================================  MDR_CAN1 BUF_CON21 RX_FULL [6..6]  =========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON21_RX_FULL                                */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON21_RX_FULL_Off = 0,/*!< Off : Disabled                                                       */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON21_RX_FULL_On = 1,/*!< On : Enabled                                                          */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON21_RX_FULL_Enum;

/* ===========================================  MDR_CAN1 BUF_CON21 OVER_WR [7..7]  =========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON21_OVER_WR                                */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON21_OVER_WR_Off = 0,/*!< Off : Disabled                                                       */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON21_OVER_WR_On = 1,/*!< On : Enabled                                                          */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON21_OVER_WR_Enum;

/* =======================================================  BUF_CON22  ======================================================= */
/* =============================================  MDR_CAN1 BUF_CON22 EN [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON22_EN                                     */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON22_EN_Off = 0,/*!< Off : Disabled                                                            */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON22_EN_On = 1, /*!< On : Enabled                                                              */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON22_EN_Enum;

/* ============================================  MDR_CAN1 BUF_CON22 RX_TX [1..1]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON22_RX_TX                                  */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON22_RX_TX_TX = 0,/*!< TX : Output buffer                                                      */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON22_RX_TX_RX = 1,/*!< RX : Input buffer                                                       */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON22_RX_TX_Enum;

/* ===========================================  MDR_CAN1 BUF_CON22 OVER_EN [2..2]  =========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON22_OVER_EN                                */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON22_OVER_EN_Off = 0,/*!< Off : Disabled                                                       */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON22_OVER_EN_On = 1,/*!< On : Enabled                                                          */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON22_OVER_EN_Enum;

/* ===========================================  MDR_CAN1 BUF_CON22 RTR_EN [3..3]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON22_RTR_EN                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON22_RTR_EN_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON22_RTR_EN_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON22_RTR_EN_Enum;

