StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
/* ==========================================  MDR_CAN1 BUF_CON25 PRIOR_OFF [4..4]  ========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON25_PRIOR_OFF                              */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON25_PRIOR_OFF_Off = 0,/*!< Off : Disabled                                                     */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON25_PRIOR_OFF_On = 1,/*!< On : Enabled                                                        */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON25_PRIOR_OFF_Enum;

/* ===========================================  MDR_CAN1 BUF_CON25 TX_REQ [5..5]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON25_TX_REQ                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON25_TX_REQ_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON25_TX_REQ_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON25_TX_REQ_Enum;

/* ===========================================  MDR_CAN1 BUF_CON25 RX_FULL [6..6]  =========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON25_RX_FULL                                */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON25_RX_FULL_Off = 0,/*!< Off : Disabled                                                       */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON25_RX_FULL_On = 1,/*!< On : Enabled                                                          */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON25_RX_FULL_Enum;

/* ===========================================  MDR_CAN1 BUF_CON25 OVER_WR [7..7]  =========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON25_OVER_WR                                */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON25_OVER_WR_Off = 0,/*!< Off : Disabled                                                       */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON25_OVER_WR_On = 1,/*!< On : Enabled                                                          */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON25_OVER_WR_Enum;

/* =======================================================  BUF_CON26  ======================================================= */
/* =============================================  MDR_CAN1 BUF_CON26 EN [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON26_EN                                     */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON26_EN_Off = 0,/*!< Off : Disabled                                                            */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON26_EN_On = 1, /*!< On : Enabled                                                              */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON26_EN_Enum;

/* ============================================  MDR_CAN1 BUF_CON26 RX_TX [1..1]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON26_RX_TX                                  */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON26_RX_TX_TX = 0,/*!< TX : Output buffer                                                      */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON26_RX_TX_RX = 1,/*!< RX : Input buffer                                                       */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON26_RX_TX_Enum;

/* ===========================================  MDR_CAN1 BUF_CON26 OVER_EN [2..2]  =========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON26_OVER_EN                                */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON26_OVER_EN_Off = 0,/*!< Off : Disabled                                                       */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON26_OVER_EN_On = 1,/*!< On : Enabled                                                          */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON26_OVER_EN_Enum;

/* ===========================================  MDR_CAN1 BUF_CON26 RTR_EN [3..3]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON26_RTR_EN                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON26_RTR_EN_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON26_RTR_EN_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON26_RTR_EN_Enum;

/* ==========================================  MDR_CAN1 BUF_CON26 PRIOR_OFF [4..4]  ========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON26_PRIOR_OFF                              */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON26_PRIOR_OFF_Off = 0,/*!< Off : Disabled                                                     */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON26_PRIOR_OFF_On = 1,/*!< On : Enabled                                                        */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON26_PRIOR_OFF_Enum;

/* ===========================================  MDR_CAN1 BUF_CON26 TX_REQ [5..5]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON26_TX_REQ                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON26_TX_REQ_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON26_TX_REQ_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON26_TX_REQ_Enum;

/* ===========================================  MDR_CAN1 BUF_CON26 RX_FULL [6..6]  =========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON26_RX_FULL                                */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON26_RX_FULL_Off = 0,/*!< Off : Disabled                                                       */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON26_RX_FULL_On = 1,/*!< On : Enabled                                                          */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON26_RX_FULL_Enum;

/* ===========================================  MDR_CAN1 BUF_CON26 OVER_WR [7..7]  =========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON26_OVER_WR                                */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON26_OVER_WR_Off = 0,/*!< Off : Disabled                                                       */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON26_OVER_WR_On = 1,/*!< On : Enabled                                                          */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON26_OVER_WR_Enum;

/* =======================================================  BUF_CON27  ======================================================= */
/* =============================================  MDR_CAN1 BUF_CON27 EN [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON27_EN                                     */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON27_EN_Off = 0,/*!< Off : Disabled                                                            */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON27_EN_On = 1, /*!< On : Enabled                                                              */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON27_EN_Enum;

/* ============================================  MDR_CAN1 BUF_CON27 RX_TX [1..1]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON27_RX_TX                                  */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON27_RX_TX_TX = 0,/*!< TX : Output buffer                                                      */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON27_RX_TX_RX = 1,/*!< RX : Input buffer                                                       */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON27_RX_TX_Enum;

/* ===========================================  MDR_CAN1 BUF_CON27 OVER_EN [2..2]  =========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON27_OVER_EN                                */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON27_OVER_EN_Off = 0,/*!< Off : Disabled                                                       */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON27_OVER_EN_On = 1,/*!< On : Enabled                                                          */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON27_OVER_EN_Enum;

