StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
/* ===========================================  MDR_CAN1 BUF_CON30 TX_REQ [5..5]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON30_TX_REQ                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON30_TX_REQ_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON30_TX_REQ_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON30_TX_REQ_Enum;

/* ===========================================  MDR_CAN1 BUF_CON30 RX_FULL [6..6]  =========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON30_RX_FULL                                */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON30_RX_FULL_Off = 0,/*!< Off : Disabled                                                       */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON30_RX_FULL_On = 1,/*!< On : Enabled                                                          */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON30_RX_FULL_Enum;

/* ===========================================  MDR_CAN1 BUF_CON30 OVER_WR [7..7]  =========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON30_OVER_WR                                */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON30_OVER_WR_Off = 0,/*!< Off : Disabled                                                       */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON30_OVER_WR_On = 1,/*!< On : Enabled                                                          */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON30_OVER_WR_Enum;

/* =======================================================  BUF_CON31  ======================================================= */
/* =============================================  MDR_CAN1 BUF_CON31 EN [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON31_EN                                     */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON31_EN_Off = 0,/*!< Off : Disabled                                                            */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON31_EN_On = 1, /*!< On : Enabled                                                              */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON31_EN_Enum;

/* ============================================  MDR_CAN1 BUF_CON31 RX_TX [1..1]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON31_RX_TX                                  */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON31_RX_TX_TX = 0,/*!< TX : Output buffer                                                      */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON31_RX_TX_RX = 1,/*!< RX : Input buffer                                                       */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON31_RX_TX_Enum;

/* ===========================================  MDR_CAN1 BUF_CON31 OVER_EN [2..2]  =========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON31_OVER_EN                                */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON31_OVER_EN_Off = 0,/*!< Off : Disabled                                                       */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON31_OVER_EN_On = 1,/*!< On : Enabled                                                          */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON31_OVER_EN_Enum;

/* ===========================================  MDR_CAN1 BUF_CON31 RTR_EN [3..3]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON31_RTR_EN                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON31_RTR_EN_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON31_RTR_EN_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON31_RTR_EN_Enum;

/* ==========================================  MDR_CAN1 BUF_CON31 PRIOR_OFF [4..4]  ========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON31_PRIOR_OFF                              */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON31_PRIOR_OFF_Off = 0,/*!< Off : Disabled                                                     */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON31_PRIOR_OFF_On = 1,/*!< On : Enabled                                                        */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON31_PRIOR_OFF_Enum;

/* ===========================================  MDR_CAN1 BUF_CON31 TX_REQ [5..5]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON31_TX_REQ                                 */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON31_TX_REQ_Off = 0,/*!< Off : Disabled                                                        */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON31_TX_REQ_On = 1,/*!< On : Enabled                                                           */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON31_TX_REQ_Enum;

/* ===========================================  MDR_CAN1 BUF_CON31 RX_FULL [6..6]  =========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON31_RX_FULL                                */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON31_RX_FULL_Off = 0,/*!< Off : Disabled                                                       */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON31_RX_FULL_On = 1,/*!< On : Enabled                                                          */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON31_RX_FULL_Enum;

/* ===========================================  MDR_CAN1 BUF_CON31 OVER_WR [7..7]  =========================================== */
typedef enum {                                  /*!< MDR_CAN1_BUF_CON_BUF_CON_BUF_CON31_OVER_WR                                */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON31_OVER_WR_Off = 0,/*!< Off : Disabled                                                       */
  MDR_CAN1_BUF_CON_BUF_CON_BUF_CON31_OVER_WR_On = 1,/*!< On : Enabled                                                          */
} MDR_CAN1_BUF_CON_BUF_CON_BUF_CON31_OVER_WR_Enum;

/* ========================================================  INT_RX  ========================================================= */
/* ===========================================  MDR_CAN1 INT_RX RX_IRQ_En [0..0]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_INT_RX_RX_IRQ_En                                                 */
  MDR_CAN1_INT_RX_RX_IRQ_En_Off        = 0,     /*!< Off : IRQ Disabled                                                        */
  MDR_CAN1_INT_RX_RX_IRQ_En_On         = 1,     /*!< On : IRQ Enabled                                                          */
} MDR_CAN1_INT_RX_RX_IRQ_En_Enum;

/* ==========================================================  RX  =========================================================== */
/* ==============================================  MDR_CAN1 RX RX_FULL [0..0]  =============================================== */
typedef enum {                                  /*!< MDR_CAN1_RX_RX_FULL                                                       */
  MDR_CAN1_RX_RX_FULL_Empty            = 0,     /*!< Empty : No Data                                                           */
  MDR_CAN1_RX_RX_FULL_Full             = 1,     /*!< Full : Has Data                                                           */
} MDR_CAN1_RX_RX_FULL_Enum;

/* ========================================================  INT_TX  ========================================================= */
/* ===========================================  MDR_CAN1 INT_TX TX_IRQ_En [0..0]  ============================================ */
typedef enum {                                  /*!< MDR_CAN1_INT_TX_TX_IRQ_En                                                 */
  MDR_CAN1_INT_TX_TX_IRQ_En_Off        = 0,     /*!< Off : IRQ Disabled                                                        */
  MDR_CAN1_INT_TX_TX_IRQ_En_On         = 1,     /*!< On : IRQ Enabled                                                          */
} MDR_CAN1_INT_TX_TX_IRQ_En_Enum;

