StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
/* ==========================================================  TX  =========================================================== */
/* ==============================================  MDR_CAN1 TX TX_nReq [0..0]  =============================================== */
typedef enum {                                  /*!< MDR_CAN1_TX_TX_nReq                                                       */
  MDR_CAN1_TX_TX_nReq_Active           = 0,     /*!< Active : Tx_Req is active                                                 */
  MDR_CAN1_TX_TX_nReq_Off              = 1,     /*!< Off : No req                                                              */
} MDR_CAN1_TX_TX_nReq_Enum;



/* =========================================================================================================================== */
/* ================                                         MDR_UART1                                         ================ */
/* =========================================================================================================================== */

/* ==========================================================  DR  =========================================================== */
/* ================================================  MDR_UART1 DR FE [8..8]  ================================================= */
typedef enum {                                  /*!< MDR_UART1_DR_FE                                                           */
  MDR_UART1_DR_FE_Ok                   = 0,     /*!< Ok : No Error                                                             */
  MDR_UART1_DR_FE_ERROR                = 1,     /*!< ERROR : Error is active                                                   */
} MDR_UART1_DR_FE_Enum;

/* ================================================  MDR_UART1 DR PE [9..9]  ================================================= */
typedef enum {                                  /*!< MDR_UART1_DR_PE                                                           */
  MDR_UART1_DR_PE_Ok                   = 0,     /*!< Ok : No Error                                                             */
  MDR_UART1_DR_PE_ERROR                = 1,     /*!< ERROR : Error is active                                                   */
} MDR_UART1_DR_PE_Enum;

/* ===============================================  MDR_UART1 DR BE [10..10]  ================================================ */
typedef enum {                                  /*!< MDR_UART1_DR_BE                                                           */
  MDR_UART1_DR_BE_Ok                   = 0,     /*!< Ok : No Error                                                             */
  MDR_UART1_DR_BE_ERROR                = 1,     /*!< ERROR : Error is active                                                   */
} MDR_UART1_DR_BE_Enum;

/* ===============================================  MDR_UART1 DR OE [11..11]  ================================================ */
typedef enum {                                  /*!< MDR_UART1_DR_OE                                                           */
  MDR_UART1_DR_OE_Ok                   = 0,     /*!< Ok : No Error                                                             */
  MDR_UART1_DR_OE_ERROR                = 1,     /*!< ERROR : Error is active                                                   */
} MDR_UART1_DR_OE_Enum;

/* ========================================================  RSR_ECR  ======================================================== */
/* ==============================================  MDR_UART1 RSR_ECR FE [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_RSR_ECR_FE                                                      */
  MDR_UART1_RSR_ECR_FE_Ok              = 0,     /*!< Ok : No Error                                                             */
  MDR_UART1_RSR_ECR_FE_ERROR           = 1,     /*!< ERROR : Error is active                                                   */
} MDR_UART1_RSR_ECR_FE_Enum;

/* ==============================================  MDR_UART1 RSR_ECR PE [1..1]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_RSR_ECR_PE                                                      */
  MDR_UART1_RSR_ECR_PE_Ok              = 0,     /*!< Ok : No Error                                                             */
  MDR_UART1_RSR_ECR_PE_ERROR           = 1,     /*!< ERROR : Error is active                                                   */
} MDR_UART1_RSR_ECR_PE_Enum;

/* ==============================================  MDR_UART1 RSR_ECR BE [2..2]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_RSR_ECR_BE                                                      */
  MDR_UART1_RSR_ECR_BE_Ok              = 0,     /*!< Ok : No Error                                                             */
  MDR_UART1_RSR_ECR_BE_ERROR           = 1,     /*!< ERROR : Error is active                                                   */
} MDR_UART1_RSR_ECR_BE_Enum;

/* ==============================================  MDR_UART1 RSR_ECR OE [3..3]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_RSR_ECR_OE                                                      */
  MDR_UART1_RSR_ECR_OE_Ok              = 0,     /*!< Ok : No Error                                                             */
  MDR_UART1_RSR_ECR_OE_ERROR           = 1,     /*!< ERROR : Error is active                                                   */
} MDR_UART1_RSR_ECR_OE_Enum;

/* ==========================================================  FR  =========================================================== */
/* ================================================  MDR_UART1 FR CTS [0..0]  ================================================ */
typedef enum {                                  /*!< MDR_UART1_FR_CTS                                                          */
  MDR_UART1_FR_CTS_Inactive            = 0,     /*!< Inactive : Modem line is High                                             */
  MDR_UART1_FR_CTS_Active              = 1,     /*!< Active : Modem line is Low                                                */
} MDR_UART1_FR_CTS_Enum;

/* ================================================  MDR_UART1 FR DSR [1..1]  ================================================ */
typedef enum {                                  /*!< MDR_UART1_FR_DSR                                                          */
  MDR_UART1_FR_DSR_Inactive            = 0,     /*!< Inactive : Modem line is High                                             */
  MDR_UART1_FR_DSR_Active              = 1,     /*!< Active : Modem line is Low                                                */
} MDR_UART1_FR_DSR_Enum;

