StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
/* =============================================  MDR_UART1 RIS DCDM_RIS [2..2]  ============================================= */
typedef enum {                                  /*!< MDR_UART1_RIS_DCDM_RIS                                                    */
  MDR_UART1_RIS_DCDM_RIS_Off           = 0,     /*!< Off : Event Inactive                                                      */
  MDR_UART1_RIS_DCDM_RIS_On            = 1,     /*!< On : Event Active                                                         */
} MDR_UART1_RIS_DCDM_RIS_Enum;

/* =============================================  MDR_UART1 RIS DSRM_RIS [3..3]  ============================================= */
typedef enum {                                  /*!< MDR_UART1_RIS_DSRM_RIS                                                    */
  MDR_UART1_RIS_DSRM_RIS_Off           = 0,     /*!< Off : Event Inactive                                                      */
  MDR_UART1_RIS_DSRM_RIS_On            = 1,     /*!< On : Event Active                                                         */
} MDR_UART1_RIS_DSRM_RIS_Enum;

/* ==============================================  MDR_UART1 RIS RX_RIS [4..4]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_RIS_RX_RIS                                                      */
  MDR_UART1_RIS_RX_RIS_Off             = 0,     /*!< Off : Event Inactive                                                      */
  MDR_UART1_RIS_RX_RIS_On              = 1,     /*!< On : Event Active                                                         */
} MDR_UART1_RIS_RX_RIS_Enum;

/* ==============================================  MDR_UART1 RIS TX_RIS [5..5]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_RIS_TX_RIS                                                      */
  MDR_UART1_RIS_TX_RIS_Off             = 0,     /*!< Off : Event Inactive                                                      */
  MDR_UART1_RIS_TX_RIS_On              = 1,     /*!< On : Event Active                                                         */
} MDR_UART1_RIS_TX_RIS_Enum;

/* ==============================================  MDR_UART1 RIS RT_RIS [6..6]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_RIS_RT_RIS                                                      */
  MDR_UART1_RIS_RT_RIS_Off             = 0,     /*!< Off : Event Inactive                                                      */
  MDR_UART1_RIS_RT_RIS_On              = 1,     /*!< On : Event Active                                                         */
} MDR_UART1_RIS_RT_RIS_Enum;

/* ==============================================  MDR_UART1 RIS FE_RIS [7..7]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_RIS_FE_RIS                                                      */
  MDR_UART1_RIS_FE_RIS_Off             = 0,     /*!< Off : Event Inactive                                                      */
  MDR_UART1_RIS_FE_RIS_On              = 1,     /*!< On : Event Active                                                         */
} MDR_UART1_RIS_FE_RIS_Enum;

/* ==============================================  MDR_UART1 RIS PE_RIS [8..8]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_RIS_PE_RIS                                                      */
  MDR_UART1_RIS_PE_RIS_Off             = 0,     /*!< Off : Event Inactive                                                      */
  MDR_UART1_RIS_PE_RIS_On              = 1,     /*!< On : Event Active                                                         */
} MDR_UART1_RIS_PE_RIS_Enum;

/* ==============================================  MDR_UART1 RIS BE_RIS [9..9]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_RIS_BE_RIS                                                      */
  MDR_UART1_RIS_BE_RIS_Off             = 0,     /*!< Off : Event Inactive                                                      */
  MDR_UART1_RIS_BE_RIS_On              = 1,     /*!< On : Event Active                                                         */
} MDR_UART1_RIS_BE_RIS_Enum;

/* =============================================  MDR_UART1 RIS OE_RIS [10..10]  ============================================= */
typedef enum {                                  /*!< MDR_UART1_RIS_OE_RIS                                                      */
  MDR_UART1_RIS_OE_RIS_Off             = 0,     /*!< Off : Event Inactive                                                      */
  MDR_UART1_RIS_OE_RIS_On              = 1,     /*!< On : Event Active                                                         */
} MDR_UART1_RIS_OE_RIS_Enum;

/* ==========================================================  MIS  ========================================================== */
/* =============================================  MDR_UART1 MIS RIM_MIS [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_UART1_MIS_RIM_MIS                                                     */
  MDR_UART1_MIS_RIM_MIS_Off            = 0,     /*!< Off : Event Inactive                                                      */
  MDR_UART1_MIS_RIM_MIS_On             = 1,     /*!< On : Event Active                                                         */
} MDR_UART1_MIS_RIM_MIS_Enum;

/* =============================================  MDR_UART1 MIS STCM_MIS [1..1]  ============================================= */
typedef enum {                                  /*!< MDR_UART1_MIS_STCM_MIS                                                    */
  MDR_UART1_MIS_STCM_MIS_Off           = 0,     /*!< Off : Event Inactive                                                      */
  MDR_UART1_MIS_STCM_MIS_On            = 1,     /*!< On : Event Active                                                         */
} MDR_UART1_MIS_STCM_MIS_Enum;

