StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
/* =======================================================  CH3_CNTRL  ======================================================= */
/* ==========================================  MDR_TIMER1 CH3_CNTRL CHFLTR [0..3]  =========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH3_CNTRL_CHFLTR                                               */
  MDR_TIMER1_CH3_CNTRL_CHFLTR_TIM_CLK  = 0,     /*!< TIM_CLK : Filter Value                                                    */
  MDR_TIMER1_CH3_CNTRL_CHFLTR_2_TIM_CLK = 1,    /*!< 2_TIM_CLK : Filter Value                                                  */
  MDR_TIMER1_CH3_CNTRL_CHFLTR_4_TIM_CLK = 2,    /*!< 4_TIM_CLK : Filter Value                                                  */
  MDR_TIMER1_CH3_CNTRL_CHFLTR_8_TIM_CLK = 3,    /*!< 8_TIM_CLK : Filter Value                                                  */
  MDR_TIMER1_CH3_CNTRL_CHFLTR_6_FDTS_div2 = 4,  /*!< 6_FDTS_div2 : Filter Value                                                */
  MDR_TIMER1_CH3_CNTRL_CHFLTR_8_FDTS_div2 = 5,  /*!< 8_FDTS_div2 : Filter Value                                                */
  MDR_TIMER1_CH3_CNTRL_CHFLTR_6_FDTS_div4 = 6,  /*!< 6_FDTS_div4 : Filter Value                                                */
  MDR_TIMER1_CH3_CNTRL_CHFLTR_8_FDTS_div4 = 7,  /*!< 8_FDTS_div4 : Filter Value                                                */
  MDR_TIMER1_CH3_CNTRL_CHFLTR_6_FDTS_div8 = 8,  /*!< 6_FDTS_div8 : Filter Value                                                */
  MDR_TIMER1_CH3_CNTRL_CHFLTR_8_FDTS_div8 = 9,  /*!< 8_FDTS_div8 : Filter Value                                                */
  MDR_TIMER1_CH3_CNTRL_CHFLTR_5_FDTS_div16 = 10,/*!< 5_FDTS_div16 : Filter Value                                               */
  MDR_TIMER1_CH3_CNTRL_CHFLTR_6_FDTS_div16 = 11,/*!< 6_FDTS_div16 : Filter Value                                               */
  MDR_TIMER1_CH3_CNTRL_CHFLTR_8_FDTS_div16 = 12,/*!< 8_FDTS_div16 : Filter Value                                               */
  MDR_TIMER1_CH3_CNTRL_CHFLTR_5_FDTS_div32 = 13,/*!< 5_FDTS_div32 : Filter Value                                               */
  MDR_TIMER1_CH3_CNTRL_CHFLTR_6_FDTS_div32 = 14,/*!< 6_FDTS_div32 : Filter Value                                               */
  MDR_TIMER1_CH3_CNTRL_CHFLTR_8_FDTS_div32 = 15,/*!< 8_FDTS_div32 : Filter Value                                               */
} MDR_TIMER1_CH3_CNTRL_CHFLTR_Enum;

/* ===========================================  MDR_TIMER1 CH3_CNTRL CHSEL [4..5]  =========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH3_CNTRL_CHSEL                                                */
  MDR_TIMER1_CH3_CNTRL_CHSEL_Rise_Pin  = 0,     /*!< Rise_Pin : Capture Event Select                                           */
  MDR_TIMER1_CH3_CNTRL_CHSEL_Fall_Pin  = 1,     /*!< Fall_Pin : Capture Event Select                                           */
  MDR_TIMER1_CH3_CNTRL_CHSEL_Rise_NextCH = 2,   /*!< Rise_NextCH : Capture Event Select                                        */
  MDR_TIMER1_CH3_CNTRL_CHSEL_Rise_NextNextCH = 3,/*!< Rise_NextNextCH : Capture Event Select                                   */
} MDR_TIMER1_CH3_CNTRL_CHSEL_Enum;

/* ===========================================  MDR_TIMER1 CH3_CNTRL CHPSC [6..7]  =========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH3_CNTRL_CHPSC                                                */
  MDR_TIMER1_CH3_CNTRL_CHPSC_EveryEvent = 0,    /*!< EveryEvent : Pass event for capture                                       */
  MDR_TIMER1_CH3_CNTRL_CHPSC_Events_div2 = 1,   /*!< Events_div2 : Pass event for capture                                      */
  MDR_TIMER1_CH3_CNTRL_CHPSC_Events_div4 = 2,   /*!< Events_div4 : Pass event for capture                                      */
  MDR_TIMER1_CH3_CNTRL_CHPSC_Events_div8 = 3,   /*!< Events_div8 : Pass event for capture                                      */
} MDR_TIMER1_CH3_CNTRL_CHPSC_Enum;

/* ===========================================  MDR_TIMER1 CH3_CNTRL OCCE [8..8]  ============================================ */
typedef enum {                                  /*!< MDR_TIMER1_CH3_CNTRL_OCCE                                                 */
  MDR_TIMER1_CH3_CNTRL_OCCE_Off        = 0,     /*!< Off : Disabled                                                            */
  MDR_TIMER1_CH3_CNTRL_OCCE_On         = 1,     /*!< On : Enabled                                                              */
} MDR_TIMER1_CH3_CNTRL_OCCE_Enum;

/* ===========================================  MDR_TIMER1 CH3_CNTRL OCCM [9..11]  =========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH3_CNTRL_OCCM                                                 */
  MDR_TIMER1_CH3_CNTRL_OCCM_Ref_0      = 0,     /*!< Ref_0 : Ref signal for output                                             */
  MDR_TIMER1_CH3_CNTRL_OCCM_Ref_1_eqCCRx = 1,   /*!< Ref_1_eqCCRx : Ref signal for output                                      */
  MDR_TIMER1_CH3_CNTRL_OCCM_Ref_0_eqCCRx = 2,   /*!< Ref_0_eqCCRx : Ref signal for output                                      */
  MDR_TIMER1_CH3_CNTRL_OCCM_Ref_sw_eqCCRx = 3,  /*!< Ref_sw_eqCCRx : Ref signal for output                                     */
  MDR_TIMER1_CH3_CNTRL_OCCM_Ref0       = 4,     /*!< Ref0 : Ref signal for output                                              */
  MDR_TIMER1_CH3_CNTRL_OCCM_Ref_1      = 5,     /*!< Ref_1 : Ref signal for output                                             */
  MDR_TIMER1_CH3_CNTRL_OCCM_Ref_nDir_inCCRs = 6,/*!< Ref_nDir_inCCRs : Ref signal for output                                   */
  MDR_TIMER1_CH3_CNTRL_OCCM_Ref_Dir_inCCRs = 7, /*!< Ref_Dir_inCCRs : Ref signal for output                                    */
} MDR_TIMER1_CH3_CNTRL_OCCM_Enum;

/* ==========================================  MDR_TIMER1 CH3_CNTRL BRKEN [12..12]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH3_CNTRL_BRKEN                                                */
  MDR_TIMER1_CH3_CNTRL_BRKEN_Off       = 0,     /*!< Off : Disabled                                                            */
  MDR_TIMER1_CH3_CNTRL_BRKEN_On        = 1,     /*!< On : Enabled                                                              */
} MDR_TIMER1_CH3_CNTRL_BRKEN_Enum;

/* ==========================================  MDR_TIMER1 CH3_CNTRL ETREN [13..13]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH3_CNTRL_ETREN                                                */
  MDR_TIMER1_CH3_CNTRL_ETREN_Off       = 0,     /*!< Off : Disabled                                                            */
  MDR_TIMER1_CH3_CNTRL_ETREN_On        = 1,     /*!< On : Enabled                                                              */
} MDR_TIMER1_CH3_CNTRL_ETREN_Enum;

/* =========================================  MDR_TIMER1 CH3_CNTRL WR_CMPL [14..14]  ========================================= */
typedef enum {                                  /*!< MDR_TIMER1_CH3_CNTRL_WR_CMPL                                              */
  MDR_TIMER1_CH3_CNTRL_WR_CMPL_Ready   = 0,     /*!< Ready : Ready to write                                                    */
  MDR_TIMER1_CH3_CNTRL_WR_CMPL_BUSY    = 1,     /*!< BUSY : Writing not completed                                              */
} MDR_TIMER1_CH3_CNTRL_WR_CMPL_Enum;

/* ========================================  MDR_TIMER1 CH3_CNTRL CAP_nPWM [15..15]  ========================================= */
typedef enum {                                  /*!< MDR_TIMER1_CH3_CNTRL_CAP_nPWM                                             */
  MDR_TIMER1_CH3_CNTRL_CAP_nPWM_PWM    = 0,     /*!< PWM : PWM output                                                          */
  MDR_TIMER1_CH3_CNTRL_CAP_nPWM_CAPTURE = 1,    /*!< CAPTURE : Capture input signal                                            */
} MDR_TIMER1_CH3_CNTRL_CAP_nPWM_Enum;

/* =======================================================  CH4_CNTRL  ======================================================= */
/* ==========================================  MDR_TIMER1 CH4_CNTRL CHFLTR [0..3]  =========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH4_CNTRL_CHFLTR                                               */
  MDR_TIMER1_CH4_CNTRL_CHFLTR_TIM_CLK  = 0,     /*!< TIM_CLK : Filter Value                                                    */
  MDR_TIMER1_CH4_CNTRL_CHFLTR_2_TIM_CLK = 1,    /*!< 2_TIM_CLK : Filter Value                                                  */
  MDR_TIMER1_CH4_CNTRL_CHFLTR_4_TIM_CLK = 2,    /*!< 4_TIM_CLK : Filter Value                                                  */
  MDR_TIMER1_CH4_CNTRL_CHFLTR_8_TIM_CLK = 3,    /*!< 8_TIM_CLK : Filter Value                                                  */
  MDR_TIMER1_CH4_CNTRL_CHFLTR_6_FDTS_div2 = 4,  /*!< 6_FDTS_div2 : Filter Value                                                */
  MDR_TIMER1_CH4_CNTRL_CHFLTR_8_FDTS_div2 = 5,  /*!< 8_FDTS_div2 : Filter Value                                                */
  MDR_TIMER1_CH4_CNTRL_CHFLTR_6_FDTS_div4 = 6,  /*!< 6_FDTS_div4 : Filter Value                                                */
  MDR_TIMER1_CH4_CNTRL_CHFLTR_8_FDTS_div4 = 7,  /*!< 8_FDTS_div4 : Filter Value                                                */
  MDR_TIMER1_CH4_CNTRL_CHFLTR_6_FDTS_div8 = 8,  /*!< 6_FDTS_div8 : Filter Value                                                */
  MDR_TIMER1_CH4_CNTRL_CHFLTR_8_FDTS_div8 = 9,  /*!< 8_FDTS_div8 : Filter Value                                                */
  MDR_TIMER1_CH4_CNTRL_CHFLTR_5_FDTS_div16 = 10,/*!< 5_FDTS_div16 : Filter Value                                               */
  MDR_TIMER1_CH4_CNTRL_CHFLTR_6_FDTS_div16 = 11,/*!< 6_FDTS_div16 : Filter Value                                               */
  MDR_TIMER1_CH4_CNTRL_CHFLTR_8_FDTS_div16 = 12,/*!< 8_FDTS_div16 : Filter Value                                               */
  MDR_TIMER1_CH4_CNTRL_CHFLTR_5_FDTS_div32 = 13,/*!< 5_FDTS_div32 : Filter Value                                               */
  MDR_TIMER1_CH4_CNTRL_CHFLTR_6_FDTS_div32 = 14,/*!< 6_FDTS_div32 : Filter Value                                               */
  MDR_TIMER1_CH4_CNTRL_CHFLTR_8_FDTS_div32 = 15,/*!< 8_FDTS_div32 : Filter Value                                               */
} MDR_TIMER1_CH4_CNTRL_CHFLTR_Enum;

/* ===========================================  MDR_TIMER1 CH4_CNTRL CHSEL [4..5]  =========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH4_CNTRL_CHSEL                                                */
  MDR_TIMER1_CH4_CNTRL_CHSEL_Rise_Pin  = 0,     /*!< Rise_Pin : Capture Event Select                                           */
  MDR_TIMER1_CH4_CNTRL_CHSEL_Fall_Pin  = 1,     /*!< Fall_Pin : Capture Event Select                                           */
  MDR_TIMER1_CH4_CNTRL_CHSEL_Rise_NextCH = 2,   /*!< Rise_NextCH : Capture Event Select                                        */
  MDR_TIMER1_CH4_CNTRL_CHSEL_Rise_NextNextCH = 3,/*!< Rise_NextNextCH : Capture Event Select                                   */
} MDR_TIMER1_CH4_CNTRL_CHSEL_Enum;

/* ===========================================  MDR_TIMER1 CH4_CNTRL CHPSC [6..7]  =========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH4_CNTRL_CHPSC                                                */
  MDR_TIMER1_CH4_CNTRL_CHPSC_EveryEvent = 0,    /*!< EveryEvent : Pass event for capture                                       */
  MDR_TIMER1_CH4_CNTRL_CHPSC_Events_div2 = 1,   /*!< Events_div2 : Pass event for capture                                      */
  MDR_TIMER1_CH4_CNTRL_CHPSC_Events_div4 = 2,   /*!< Events_div4 : Pass event for capture                                      */
  MDR_TIMER1_CH4_CNTRL_CHPSC_Events_div8 = 3,   /*!< Events_div8 : Pass event for capture                                      */
} MDR_TIMER1_CH4_CNTRL_CHPSC_Enum;

/* ===========================================  MDR_TIMER1 CH4_CNTRL OCCE [8..8]  ============================================ */
typedef enum {                                  /*!< MDR_TIMER1_CH4_CNTRL_OCCE                                                 */
  MDR_TIMER1_CH4_CNTRL_OCCE_Off        = 0,     /*!< Off : Disabled                                                            */
  MDR_TIMER1_CH4_CNTRL_OCCE_On         = 1,     /*!< On : Enabled                                                              */
} MDR_TIMER1_CH4_CNTRL_OCCE_Enum;

/* ===========================================  MDR_TIMER1 CH4_CNTRL OCCM [9..11]  =========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH4_CNTRL_OCCM                                                 */
  MDR_TIMER1_CH4_CNTRL_OCCM_Ref_0      = 0,     /*!< Ref_0 : Ref signal for output                                             */
  MDR_TIMER1_CH4_CNTRL_OCCM_Ref_1_eqCCRx = 1,   /*!< Ref_1_eqCCRx : Ref signal for output                                      */
  MDR_TIMER1_CH4_CNTRL_OCCM_Ref_0_eqCCRx = 2,   /*!< Ref_0_eqCCRx : Ref signal for output                                      */
  MDR_TIMER1_CH4_CNTRL_OCCM_Ref_sw_eqCCRx = 3,  /*!< Ref_sw_eqCCRx : Ref signal for output                                     */
  MDR_TIMER1_CH4_CNTRL_OCCM_Ref0       = 4,     /*!< Ref0 : Ref signal for output                                              */
  MDR_TIMER1_CH4_CNTRL_OCCM_Ref_1      = 5,     /*!< Ref_1 : Ref signal for output                                             */
  MDR_TIMER1_CH4_CNTRL_OCCM_Ref_nDir_inCCRs = 6,/*!< Ref_nDir_inCCRs : Ref signal for output                                   */
  MDR_TIMER1_CH4_CNTRL_OCCM_Ref_Dir_inCCRs = 7, /*!< Ref_Dir_inCCRs : Ref signal for output                                    */
} MDR_TIMER1_CH4_CNTRL_OCCM_Enum;

/* ==========================================  MDR_TIMER1 CH4_CNTRL BRKEN [12..12]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH4_CNTRL_BRKEN                                                */
  MDR_TIMER1_CH4_CNTRL_BRKEN_Off       = 0,     /*!< Off : Disabled                                                            */
  MDR_TIMER1_CH4_CNTRL_BRKEN_On        = 1,     /*!< On : Enabled                                                              */
} MDR_TIMER1_CH4_CNTRL_BRKEN_Enum;

