StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
/* ===========================================  MDR_TIMER1 CH2_CNTRL1 SelO [2..3]  =========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH2_CNTRL1_SelO                                                */
  MDR_TIMER1_CH2_CNTRL1_SelO_Low       = 0,     /*!< Low : Outputs const GND                                                   */
  MDR_TIMER1_CH2_CNTRL1_SelO_High      = 1,     /*!< High : Outputs const Ucc                                                  */
  MDR_TIMER1_CH2_CNTRL1_SelO_Ref       = 2,     /*!< Ref : Ref PWM signal                                                      */
  MDR_TIMER1_CH2_CNTRL1_SelO_DTG       = 3,     /*!< DTG : DTG PWM signal                                                      */
} MDR_TIMER1_CH2_CNTRL1_SelO_Enum;

/* ===========================================  MDR_TIMER1 CH2_CNTRL1 Inv [4..4]  ============================================ */
typedef enum {                                  /*!< MDR_TIMER1_CH2_CNTRL1_Inv                                                 */
  MDR_TIMER1_CH2_CNTRL1_Inv_Off        = 0,     /*!< Off : Not Inverted                                                        */
  MDR_TIMER1_CH2_CNTRL1_Inv_On         = 1,     /*!< On : Inverted                                                             */
} MDR_TIMER1_CH2_CNTRL1_Inv_Enum;

/* ==========================================  MDR_TIMER1 CH2_CNTRL1 NSelOE [8..9]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH2_CNTRL1_NSelOE                                              */
  MDR_TIMER1_CH2_CNTRL1_NSelOE_IN      = 0,     /*!< IN : Pin IN                                                               */
  MDR_TIMER1_CH2_CNTRL1_NSelOE_OUT     = 1,     /*!< OUT : Pin OUT                                                             */
  MDR_TIMER1_CH2_CNTRL1_NSelOE_IO_byRef = 2,    /*!< IO_byRef : Pin IN or OUT by Ref signal                                    */
  MDR_TIMER1_CH2_CNTRL1_NSelOE_IO_byDTG = 3,    /*!< IO_byDTG : Pin IN or OUT by DTG signal                                    */
} MDR_TIMER1_CH2_CNTRL1_NSelOE_Enum;

/* =========================================  MDR_TIMER1 CH2_CNTRL1 NSelO [10..11]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH2_CNTRL1_NSelO                                               */
  MDR_TIMER1_CH2_CNTRL1_NSelO_Low      = 0,     /*!< Low : Outputs const GND                                                   */
  MDR_TIMER1_CH2_CNTRL1_NSelO_High     = 1,     /*!< High : Outputs const Ucc                                                  */
  MDR_TIMER1_CH2_CNTRL1_NSelO_Ref      = 2,     /*!< Ref : Ref PWM signal                                                      */
  MDR_TIMER1_CH2_CNTRL1_NSelO_DTG      = 3,     /*!< DTG : DTG PWM signal                                                      */
} MDR_TIMER1_CH2_CNTRL1_NSelO_Enum;

/* ==========================================  MDR_TIMER1 CH2_CNTRL1 NInv [12..12]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH2_CNTRL1_NInv                                                */
  MDR_TIMER1_CH2_CNTRL1_NInv_Off       = 0,     /*!< Off : Not Inverted                                                        */
  MDR_TIMER1_CH2_CNTRL1_NInv_On        = 1,     /*!< On : Inverted                                                             */
} MDR_TIMER1_CH2_CNTRL1_NInv_Enum;

/* ======================================================  CH3_CNTRL1  ======================================================= */
/* ==========================================  MDR_TIMER1 CH3_CNTRL1 SelOE [0..1]  =========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH3_CNTRL1_SelOE                                               */
  MDR_TIMER1_CH3_CNTRL1_SelOE_IN       = 0,     /*!< IN : Pin IN                                                               */
  MDR_TIMER1_CH3_CNTRL1_SelOE_OUT      = 1,     /*!< OUT : Pin OUT                                                             */
  MDR_TIMER1_CH3_CNTRL1_SelOE_IO_byRef = 2,     /*!< IO_byRef : Pin IN or OUT by Ref signal                                    */
  MDR_TIMER1_CH3_CNTRL1_SelOE_IO_byDTG = 3,     /*!< IO_byDTG : Pin IN or OUT by DTG signal                                    */
} MDR_TIMER1_CH3_CNTRL1_SelOE_Enum;

/* ===========================================  MDR_TIMER1 CH3_CNTRL1 SelO [2..3]  =========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH3_CNTRL1_SelO                                                */
  MDR_TIMER1_CH3_CNTRL1_SelO_Low       = 0,     /*!< Low : Outputs const GND                                                   */
  MDR_TIMER1_CH3_CNTRL1_SelO_High      = 1,     /*!< High : Outputs const Ucc                                                  */
  MDR_TIMER1_CH3_CNTRL1_SelO_Ref       = 2,     /*!< Ref : Ref PWM signal                                                      */
  MDR_TIMER1_CH3_CNTRL1_SelO_DTG       = 3,     /*!< DTG : DTG PWM signal                                                      */
} MDR_TIMER1_CH3_CNTRL1_SelO_Enum;

/* ===========================================  MDR_TIMER1 CH3_CNTRL1 Inv [4..4]  ============================================ */
typedef enum {                                  /*!< MDR_TIMER1_CH3_CNTRL1_Inv                                                 */
  MDR_TIMER1_CH3_CNTRL1_Inv_Off        = 0,     /*!< Off : Not Inverted                                                        */
  MDR_TIMER1_CH3_CNTRL1_Inv_On         = 1,     /*!< On : Inverted                                                             */
} MDR_TIMER1_CH3_CNTRL1_Inv_Enum;

/* ==========================================  MDR_TIMER1 CH3_CNTRL1 NSelOE [8..9]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH3_CNTRL1_NSelOE                                              */
  MDR_TIMER1_CH3_CNTRL1_NSelOE_IN      = 0,     /*!< IN : Pin IN                                                               */
  MDR_TIMER1_CH3_CNTRL1_NSelOE_OUT     = 1,     /*!< OUT : Pin OUT                                                             */
  MDR_TIMER1_CH3_CNTRL1_NSelOE_IO_byRef = 2,    /*!< IO_byRef : Pin IN or OUT by Ref signal                                    */
  MDR_TIMER1_CH3_CNTRL1_NSelOE_IO_byDTG = 3,    /*!< IO_byDTG : Pin IN or OUT by DTG signal                                    */
} MDR_TIMER1_CH3_CNTRL1_NSelOE_Enum;

/* =========================================  MDR_TIMER1 CH3_CNTRL1 NSelO [10..11]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH3_CNTRL1_NSelO                                               */
  MDR_TIMER1_CH3_CNTRL1_NSelO_Low      = 0,     /*!< Low : Outputs const GND                                                   */
  MDR_TIMER1_CH3_CNTRL1_NSelO_High     = 1,     /*!< High : Outputs const Ucc                                                  */
  MDR_TIMER1_CH3_CNTRL1_NSelO_Ref      = 2,     /*!< Ref : Ref PWM signal                                                      */
  MDR_TIMER1_CH3_CNTRL1_NSelO_DTG      = 3,     /*!< DTG : DTG PWM signal                                                      */
} MDR_TIMER1_CH3_CNTRL1_NSelO_Enum;

/* ==========================================  MDR_TIMER1 CH3_CNTRL1 NInv [12..12]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH3_CNTRL1_NInv                                                */
  MDR_TIMER1_CH3_CNTRL1_NInv_Off       = 0,     /*!< Off : Not Inverted                                                        */
  MDR_TIMER1_CH3_CNTRL1_NInv_On        = 1,     /*!< On : Inverted                                                             */
} MDR_TIMER1_CH3_CNTRL1_NInv_Enum;

/* ======================================================  CH4_CNTRL1  ======================================================= */
/* ==========================================  MDR_TIMER1 CH4_CNTRL1 SelOE [0..1]  =========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH4_CNTRL1_SelOE                                               */
  MDR_TIMER1_CH4_CNTRL1_SelOE_IN       = 0,     /*!< IN : Pin IN                                                               */
  MDR_TIMER1_CH4_CNTRL1_SelOE_OUT      = 1,     /*!< OUT : Pin OUT                                                             */
  MDR_TIMER1_CH4_CNTRL1_SelOE_IO_byRef = 2,     /*!< IO_byRef : Pin IN or OUT by Ref signal                                    */
  MDR_TIMER1_CH4_CNTRL1_SelOE_IO_byDTG = 3,     /*!< IO_byDTG : Pin IN or OUT by DTG signal                                    */
} MDR_TIMER1_CH4_CNTRL1_SelOE_Enum;

/* ===========================================  MDR_TIMER1 CH4_CNTRL1 SelO [2..3]  =========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH4_CNTRL1_SelO                                                */
  MDR_TIMER1_CH4_CNTRL1_SelO_Low       = 0,     /*!< Low : Outputs const GND                                                   */
  MDR_TIMER1_CH4_CNTRL1_SelO_High      = 1,     /*!< High : Outputs const Ucc                                                  */
  MDR_TIMER1_CH4_CNTRL1_SelO_Ref       = 2,     /*!< Ref : Ref PWM signal                                                      */
  MDR_TIMER1_CH4_CNTRL1_SelO_DTG       = 3,     /*!< DTG : DTG PWM signal                                                      */
} MDR_TIMER1_CH4_CNTRL1_SelO_Enum;

/* ===========================================  MDR_TIMER1 CH4_CNTRL1 Inv [4..4]  ============================================ */
typedef enum {                                  /*!< MDR_TIMER1_CH4_CNTRL1_Inv                                                 */
  MDR_TIMER1_CH4_CNTRL1_Inv_Off        = 0,     /*!< Off : Not Inverted                                                        */
  MDR_TIMER1_CH4_CNTRL1_Inv_On         = 1,     /*!< On : Inverted                                                             */
} MDR_TIMER1_CH4_CNTRL1_Inv_Enum;

/* ==========================================  MDR_TIMER1 CH4_CNTRL1 NSelOE [8..9]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH4_CNTRL1_NSelOE                                              */
  MDR_TIMER1_CH4_CNTRL1_NSelOE_IN      = 0,     /*!< IN : Pin IN                                                               */
  MDR_TIMER1_CH4_CNTRL1_NSelOE_OUT     = 1,     /*!< OUT : Pin OUT                                                             */
  MDR_TIMER1_CH4_CNTRL1_NSelOE_IO_byRef = 2,    /*!< IO_byRef : Pin IN or OUT by Ref signal                                    */
  MDR_TIMER1_CH4_CNTRL1_NSelOE_IO_byDTG = 3,    /*!< IO_byDTG : Pin IN or OUT by DTG signal                                    */
} MDR_TIMER1_CH4_CNTRL1_NSelOE_Enum;

/* =========================================  MDR_TIMER1 CH4_CNTRL1 NSelO [10..11]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH4_CNTRL1_NSelO                                               */
  MDR_TIMER1_CH4_CNTRL1_NSelO_Low      = 0,     /*!< Low : Outputs const GND                                                   */
  MDR_TIMER1_CH4_CNTRL1_NSelO_High     = 1,     /*!< High : Outputs const Ucc                                                  */
  MDR_TIMER1_CH4_CNTRL1_NSelO_Ref      = 2,     /*!< Ref : Ref PWM signal                                                      */
  MDR_TIMER1_CH4_CNTRL1_NSelO_DTG      = 3,     /*!< DTG : DTG PWM signal                                                      */
} MDR_TIMER1_CH4_CNTRL1_NSelO_Enum;

/* ==========================================  MDR_TIMER1 CH4_CNTRL1 NInv [12..12]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH4_CNTRL1_NInv                                                */
  MDR_TIMER1_CH4_CNTRL1_NInv_Off       = 0,     /*!< Off : Not Inverted                                                        */
  MDR_TIMER1_CH4_CNTRL1_NInv_On        = 1,     /*!< On : Inverted                                                             */
} MDR_TIMER1_CH4_CNTRL1_NInv_Enum;

