StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
/* =========================================  MDR_TIMER1 DMA_RE ETR_RE_DMAE [2..2]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE_ETR_RE_DMAE                                             */
  MDR_TIMER1_DMA_RE_ETR_RE_DMAE_Off    = 0,     /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE_ETR_RE_DMAE_On     = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE_ETR_RE_DMAE_Enum;

/* =========================================  MDR_TIMER1 DMA_RE ETR_FE_DMAE [3..3]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE_ETR_FE_DMAE                                             */
  MDR_TIMER1_DMA_RE_ETR_FE_DMAE_Off    = 0,     /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE_ETR_FE_DMAE_On     = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE_ETR_FE_DMAE_Enum;

/* ===========================================  MDR_TIMER1 DMA_RE BRK_DMAE [4..4]  =========================================== */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE_BRK_DMAE                                                */
  MDR_TIMER1_DMA_RE_BRK_DMAE_Off       = 0,     /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE_BRK_DMAE_On        = 1,     /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE_BRK_DMAE_Enum;

/* =======================================  MDR_TIMER1 DMA_RE CCR_CAP_CH1_DMAE [5..5]  ======================================= */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE_CCR_CAP_CH1_DMAE                                        */
  MDR_TIMER1_DMA_RE_CCR_CAP_CH1_DMAE_Off = 0,   /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE_CCR_CAP_CH1_DMAE_On = 1,    /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE_CCR_CAP_CH1_DMAE_Enum;

/* =======================================  MDR_TIMER1 DMA_RE CCR_CAP_CH2_DMAE [6..6]  ======================================= */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE_CCR_CAP_CH2_DMAE                                        */
  MDR_TIMER1_DMA_RE_CCR_CAP_CH2_DMAE_Off = 0,   /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE_CCR_CAP_CH2_DMAE_On = 1,    /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE_CCR_CAP_CH2_DMAE_Enum;

/* =======================================  MDR_TIMER1 DMA_RE CCR_CAP_CH3_DMAE [7..7]  ======================================= */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE_CCR_CAP_CH3_DMAE                                        */
  MDR_TIMER1_DMA_RE_CCR_CAP_CH3_DMAE_Off = 0,   /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE_CCR_CAP_CH3_DMAE_On = 1,    /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE_CCR_CAP_CH3_DMAE_Enum;

/* =======================================  MDR_TIMER1 DMA_RE CCR_CAP_CH4_DMAE [8..8]  ======================================= */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE_CCR_CAP_CH4_DMAE                                        */
  MDR_TIMER1_DMA_RE_CCR_CAP_CH4_DMAE_Off = 0,   /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE_CCR_CAP_CH4_DMAE_On = 1,    /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE_CCR_CAP_CH4_DMAE_Enum;

/* =======================================  MDR_TIMER1 DMA_RE CCR_REF_CH1_DMAE [9..9]  ======================================= */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE_CCR_REF_CH1_DMAE                                        */
  MDR_TIMER1_DMA_RE_CCR_REF_CH1_DMAE_Off = 0,   /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE_CCR_REF_CH1_DMAE_On = 1,    /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE_CCR_REF_CH1_DMAE_Enum;

/* ======================================  MDR_TIMER1 DMA_RE CCR_REF_CH2_DMAE [10..10]  ====================================== */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE_CCR_REF_CH2_DMAE                                        */
  MDR_TIMER1_DMA_RE_CCR_REF_CH2_DMAE_Off = 0,   /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE_CCR_REF_CH2_DMAE_On = 1,    /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE_CCR_REF_CH2_DMAE_Enum;

/* ======================================  MDR_TIMER1 DMA_RE CCR_REF_CH3_DMAE [11..11]  ====================================== */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE_CCR_REF_CH3_DMAE                                        */
  MDR_TIMER1_DMA_RE_CCR_REF_CH3_DMAE_Off = 0,   /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE_CCR_REF_CH3_DMAE_On = 1,    /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE_CCR_REF_CH3_DMAE_Enum;

/* ======================================  MDR_TIMER1 DMA_RE CCR_REF_CH4_DMAE [12..12]  ====================================== */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE_CCR_REF_CH4_DMAE                                        */
  MDR_TIMER1_DMA_RE_CCR_REF_CH4_DMAE_Off = 0,   /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE_CCR_REF_CH4_DMAE_On = 1,    /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE_CCR_REF_CH4_DMAE_Enum;

/* =====================================  MDR_TIMER1 DMA_RE CCR1_CAP_CH1_DMAE [13..13]  ====================================== */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE_CCR1_CAP_CH1_DMAE                                       */
  MDR_TIMER1_DMA_RE_CCR1_CAP_CH1_DMAE_Off = 0,  /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE_CCR1_CAP_CH1_DMAE_On = 1,   /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE_CCR1_CAP_CH1_DMAE_Enum;

/* =====================================  MDR_TIMER1 DMA_RE CCR1_CAP_CH2_DMAE [14..14]  ====================================== */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE_CCR1_CAP_CH2_DMAE                                       */
  MDR_TIMER1_DMA_RE_CCR1_CAP_CH2_DMAE_Off = 0,  /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE_CCR1_CAP_CH2_DMAE_On = 1,   /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE_CCR1_CAP_CH2_DMAE_Enum;

/* =====================================  MDR_TIMER1 DMA_RE CCR1_CAP_CH3_DMAE [15..15]  ====================================== */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE_CCR1_CAP_CH3_DMAE                                       */
  MDR_TIMER1_DMA_RE_CCR1_CAP_CH3_DMAE_Off = 0,  /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE_CCR1_CAP_CH3_DMAE_On = 1,   /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE_CCR1_CAP_CH3_DMAE_Enum;

/* =====================================  MDR_TIMER1 DMA_RE CCR1_CAP_CH4_DMAE [16..16]  ====================================== */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE_CCR1_CAP_CH4_DMAE                                       */
  MDR_TIMER1_DMA_RE_CCR1_CAP_CH4_DMAE_Off = 0,  /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE_CCR1_CAP_CH4_DMAE_On = 1,   /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE_CCR1_CAP_CH4_DMAE_Enum;

/* ======================================================  CH1_CNTRL2  ======================================================= */
/* ==========================================  MDR_TIMER1 CH1_CNTRL2 CHSel1 [0..1]  ========================================== */
typedef enum {                                  /*!< MDR_TIMER1_CH1_CNTRL2_CHSel1                                              */
  MDR_TIMER1_CH1_CNTRL2_CHSel1_Rise_Pin = 0,    /*!< Rise_Pin : Capture Event Select                                           */
  MDR_TIMER1_CH1_CNTRL2_CHSel1_Fall_Pin = 1,    /*!< Fall_Pin : Capture Event Select                                           */
  MDR_TIMER1_CH1_CNTRL2_CHSel1_Fall_NextCH = 2, /*!< Fall_NextCH : Capture Event Select                                        */
  MDR_TIMER1_CH1_CNTRL2_CHSel1_Fall_NextNextCH = 3,/*!< Fall_NextNextCH : Capture Event Select                                 */
} MDR_TIMER1_CH1_CNTRL2_CHSel1_Enum;

