StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
/* ======================================  MDR_TIMER1 DMA_RE4 CCR_CAP_CH1_DMAE [5..5]  ======================================= */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE4_CCR_CAP_CH1_DMAE                                       */
  MDR_TIMER1_DMA_RE4_CCR_CAP_CH1_DMAE_Off = 0,  /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE4_CCR_CAP_CH1_DMAE_On = 1,   /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE4_CCR_CAP_CH1_DMAE_Enum;

/* ======================================  MDR_TIMER1 DMA_RE4 CCR_CAP_CH2_DMAE [6..6]  ======================================= */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE4_CCR_CAP_CH2_DMAE                                       */
  MDR_TIMER1_DMA_RE4_CCR_CAP_CH2_DMAE_Off = 0,  /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE4_CCR_CAP_CH2_DMAE_On = 1,   /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE4_CCR_CAP_CH2_DMAE_Enum;

/* ======================================  MDR_TIMER1 DMA_RE4 CCR_CAP_CH3_DMAE [7..7]  ======================================= */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE4_CCR_CAP_CH3_DMAE                                       */
  MDR_TIMER1_DMA_RE4_CCR_CAP_CH3_DMAE_Off = 0,  /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE4_CCR_CAP_CH3_DMAE_On = 1,   /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE4_CCR_CAP_CH3_DMAE_Enum;

/* ======================================  MDR_TIMER1 DMA_RE4 CCR_CAP_CH4_DMAE [8..8]  ======================================= */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE4_CCR_CAP_CH4_DMAE                                       */
  MDR_TIMER1_DMA_RE4_CCR_CAP_CH4_DMAE_Off = 0,  /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE4_CCR_CAP_CH4_DMAE_On = 1,   /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE4_CCR_CAP_CH4_DMAE_Enum;

/* ======================================  MDR_TIMER1 DMA_RE4 CCR_REF_CH1_DMAE [9..9]  ======================================= */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE4_CCR_REF_CH1_DMAE                                       */
  MDR_TIMER1_DMA_RE4_CCR_REF_CH1_DMAE_Off = 0,  /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE4_CCR_REF_CH1_DMAE_On = 1,   /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE4_CCR_REF_CH1_DMAE_Enum;

/* =====================================  MDR_TIMER1 DMA_RE4 CCR_REF_CH2_DMAE [10..10]  ====================================== */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE4_CCR_REF_CH2_DMAE                                       */
  MDR_TIMER1_DMA_RE4_CCR_REF_CH2_DMAE_Off = 0,  /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE4_CCR_REF_CH2_DMAE_On = 1,   /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE4_CCR_REF_CH2_DMAE_Enum;

/* =====================================  MDR_TIMER1 DMA_RE4 CCR_REF_CH3_DMAE [11..11]  ====================================== */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE4_CCR_REF_CH3_DMAE                                       */
  MDR_TIMER1_DMA_RE4_CCR_REF_CH3_DMAE_Off = 0,  /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE4_CCR_REF_CH3_DMAE_On = 1,   /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE4_CCR_REF_CH3_DMAE_Enum;

/* =====================================  MDR_TIMER1 DMA_RE4 CCR_REF_CH4_DMAE [12..12]  ====================================== */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE4_CCR_REF_CH4_DMAE                                       */
  MDR_TIMER1_DMA_RE4_CCR_REF_CH4_DMAE_Off = 0,  /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE4_CCR_REF_CH4_DMAE_On = 1,   /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE4_CCR_REF_CH4_DMAE_Enum;

/* =====================================  MDR_TIMER1 DMA_RE4 CCR1_CAP_CH1_DMAE [13..13]  ===================================== */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE4_CCR1_CAP_CH1_DMAE                                      */
  MDR_TIMER1_DMA_RE4_CCR1_CAP_CH1_DMAE_Off = 0, /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE4_CCR1_CAP_CH1_DMAE_On = 1,  /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE4_CCR1_CAP_CH1_DMAE_Enum;

/* =====================================  MDR_TIMER1 DMA_RE4 CCR1_CAP_CH2_DMAE [14..14]  ===================================== */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE4_CCR1_CAP_CH2_DMAE                                      */
  MDR_TIMER1_DMA_RE4_CCR1_CAP_CH2_DMAE_Off = 0, /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE4_CCR1_CAP_CH2_DMAE_On = 1,  /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE4_CCR1_CAP_CH2_DMAE_Enum;

/* =====================================  MDR_TIMER1 DMA_RE4 CCR1_CAP_CH3_DMAE [15..15]  ===================================== */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE4_CCR1_CAP_CH3_DMAE                                      */
  MDR_TIMER1_DMA_RE4_CCR1_CAP_CH3_DMAE_Off = 0, /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE4_CCR1_CAP_CH3_DMAE_On = 1,  /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE4_CCR1_CAP_CH3_DMAE_Enum;

/* =====================================  MDR_TIMER1 DMA_RE4 CCR1_CAP_CH4_DMAE [16..16]  ===================================== */
typedef enum {                                  /*!< MDR_TIMER1_DMA_RE4_CCR1_CAP_CH4_DMAE                                      */
  MDR_TIMER1_DMA_RE4_CCR1_CAP_CH4_DMAE_Off = 0, /*!< Off : Inactive                                                            */
  MDR_TIMER1_DMA_RE4_CCR1_CAP_CH4_DMAE_On = 1,  /*!< On : Active                                                               */
} MDR_TIMER1_DMA_RE4_CCR1_CAP_CH4_DMAE_Enum;



/* =========================================================================================================================== */
/* ================                                         MDR_SSP1                                          ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR0  ========================================================== */
/* ================================================  MDR_SSP1 CR0 DSS [0..3]  ================================================ */
typedef enum {                                  /*!< MDR_SSP1_CR0_DSS                                                          */
  MDR_SSP1_CR0_DSS_bits_4              = 3,     /*!< bits_4 : Word of 4 bits                                                   */
  MDR_SSP1_CR0_DSS_bits_5              = 4,     /*!< bits_5 : Word of 5 bits                                                   */
  MDR_SSP1_CR0_DSS_bits_6              = 5,     /*!< bits_6 : Word of 6 bits                                                   */
  MDR_SSP1_CR0_DSS_bits_7              = 6,     /*!< bits_7 : Word of 7 bits                                                   */
  MDR_SSP1_CR0_DSS_bits_8              = 7,     /*!< bits_8 : Word of 8 bits                                                   */
  MDR_SSP1_CR0_DSS_bits_9              = 8,     /*!< bits_9 : Word of 9 bits                                                   */
  MDR_SSP1_CR0_DSS_bits_10             = 9,     /*!< bits_10 : Word of 10 bits                                                 */
  MDR_SSP1_CR0_DSS_bits_11             = 10,    /*!< bits_11 : Word of 11 bits                                                 */
  MDR_SSP1_CR0_DSS_bits_12             = 11,    /*!< bits_12 : Word of 12 bits                                                 */
  MDR_SSP1_CR0_DSS_bits_13             = 12,    /*!< bits_13 : Word of 13 bits                                                 */
  MDR_SSP1_CR0_DSS_bits_14             = 13,    /*!< bits_14 : Word of 14 bits                                                 */
  MDR_SSP1_CR0_DSS_bits_15             = 14,    /*!< bits_15 : Word of 15 bits                                                 */
  MDR_SSP1_CR0_DSS_bits_16             = 15,    /*!< bits_16 : Word of 16 bits                                                 */
} MDR_SSP1_CR0_DSS_Enum;

