StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
/* =============================================  MDR_SSP1 DMACR TXDMAE [1..1]  ============================================== */
typedef enum {                                  /*!< MDR_SSP1_DMACR_TXDMAE                                                     */
  MDR_SSP1_DMACR_TXDMAE_Disable        = 0,     /*!< Disable : Disable DMA                                                     */
  MDR_SSP1_DMACR_TXDMAE_Enable         = 1,     /*!< Enable : Enable DMA                                                       */
} MDR_SSP1_DMACR_TXDMAE_Enum;



/* =========================================================================================================================== */
/* ================                                         MDR_PORTA                                         ================ */
/* =========================================================================================================================== */

/* =========================================================  RXTX  ========================================================== */
/* ==============================================  MDR_PORTA RXTX Pin_ [0..0]  =============================================== */
typedef enum {                                  /*!< MDR_PORTA_RXTX_Pin_                                                       */
  MDR_GPIO__PIN_DATA__Low              = 0,     /*!< Low : LOW Level Voltage                                                   */
  MDR_GPIO__PIN_DATA__High             = 1,     /*!< High : HIGH Level Voltage                                                 */
} MDR_GPIO__PIN_DATA__Enum;

/* ==========================================================  OE  =========================================================== */
/* ===============================================  MDR_PORTA OE Pin_ [0..0]  ================================================ */
typedef enum {                                  /*!< MDR_PORTA_OE_Pin_                                                         */
  MDR_GPIO__PIN_DIR__IN                = 0,     /*!< IN : Input pin                                                            */
  MDR_GPIO__PIN_DIR__OUT               = 1,     /*!< OUT : Output pin                                                          */
} MDR_GPIO__PIN_DIR__Enum;

/* =========================================================  FUNC  ========================================================== */
/* ==============================================  MDR_PORTA FUNC Pin_ [0..1]  =============================================== */
typedef enum {                                  /*!< MDR_PORTA_FUNC_Pin_                                                       */
  MDR_GPIO__PIN_FUNC__Port             = 0,     /*!< Port : RXTX defined pin                                                   */
  MDR_GPIO__PIN_FUNC__Main             = 1,     /*!< Main : Main Periph defined pin                                            */
  MDR_GPIO__PIN_FUNC__Alter            = 2,     /*!< Alter : Alter Periph defined pin                                          */
  MDR_GPIO__PIN_FUNC__Override         = 3,     /*!< Override : Override Periph defined pin                                    */
} MDR_GPIO__PIN_FUNC__Enum;

/* ========================================================  ANALOG  ========================================================= */
/* =============================================  MDR_PORTA ANALOG Pin_ [0..0]  ============================================== */
typedef enum {                                  /*!< MDR_PORTA_ANALOG_Pin_                                                     */
  MDR_GPIO__PIN_DIGIT__Analog          = 0,     /*!< Analog : Pin works with Analog signal                                     */
  MDR_GPIO__PIN_DIGIT__Digital         = 1,     /*!< Digital : Pin works with Digital signal                                   */
} MDR_GPIO__PIN_DIGIT__Enum;

/* =========================================================  PULL  ========================================================== */
/* ===========================================  MDR_PORTA PULL Down_Pin_0 [0..0]  ============================================ */
typedef enum {                                  /*!< MDR_PORTA_PULL_Down_Pin_0                                                 */
  MDR_GPIO__PIN_DOWN__Off              = 0,     /*!< Off : No pull selected                                                    */
  MDR_GPIO__PIN_DOWN__DOWN             = 1,     /*!< DOWN : Pin pulled down to GND                                             */
} MDR_GPIO__PIN_DOWN__Enum;

/* ===========================================  MDR_PORTA PULL Down_Pin_1 [1..1]  ============================================ */
typedef enum {                                  /*!< MDR_PORTA_PULL_Down_Pin_1                                                 */
  MDR_PORTA_PULL_Down_Pin_1_Off        = 0,     /*!< Off : No pull selected                                                    */
  MDR_PORTA_PULL_Down_Pin_1_DOWN       = 1,     /*!< DOWN : Pin pulled down to GND                                             */
} MDR_PORTA_PULL_Down_Pin_1_Enum;

/* ===========================================  MDR_PORTA PULL Down_Pin_2 [2..2]  ============================================ */
typedef enum {                                  /*!< MDR_PORTA_PULL_Down_Pin_2                                                 */
  MDR_PORTA_PULL_Down_Pin_2_Off        = 0,     /*!< Off : No pull selected                                                    */
  MDR_PORTA_PULL_Down_Pin_2_DOWN       = 1,     /*!< DOWN : Pin pulled down to GND                                             */
} MDR_PORTA_PULL_Down_Pin_2_Enum;

/* ===========================================  MDR_PORTA PULL Down_Pin_3 [3..3]  ============================================ */
typedef enum {                                  /*!< MDR_PORTA_PULL_Down_Pin_3                                                 */
  MDR_PORTA_PULL_Down_Pin_3_Off        = 0,     /*!< Off : No pull selected                                                    */
  MDR_PORTA_PULL_Down_Pin_3_DOWN       = 1,     /*!< DOWN : Pin pulled down to GND                                             */
} MDR_PORTA_PULL_Down_Pin_3_Enum;

