StartMilandr/MDR_Pack_v6/SVD_Files/_out/out/MDR1986VE1.h
/* ===========================================  MDR_PORTA PD Driver_Pin_2 [2..2]  ============================================ */
typedef enum {                                  /*!< MDR_PORTA_PD_Driver_Pin_2                                                 */
  MDR_PORTA_PD_Driver_Pin_2_Driver     = 0,     /*!< Driver : Pull-Push driver                                                 */
  MDR_PORTA_PD_Driver_Pin_2_OpenDrain  = 1,     /*!< OpenDrain : Work with line pulled up to Ucc                               */
} MDR_PORTA_PD_Driver_Pin_2_Enum;

/* ===========================================  MDR_PORTA PD Driver_Pin_3 [3..3]  ============================================ */
typedef enum {                                  /*!< MDR_PORTA_PD_Driver_Pin_3                                                 */
  MDR_PORTA_PD_Driver_Pin_3_Driver     = 0,     /*!< Driver : Pull-Push driver                                                 */
  MDR_PORTA_PD_Driver_Pin_3_OpenDrain  = 1,     /*!< OpenDrain : Work with line pulled up to Ucc                               */
} MDR_PORTA_PD_Driver_Pin_3_Enum;

/* ===========================================  MDR_PORTA PD Driver_Pin_4 [4..4]  ============================================ */
typedef enum {                                  /*!< MDR_PORTA_PD_Driver_Pin_4                                                 */
  MDR_PORTA_PD_Driver_Pin_4_Driver     = 0,     /*!< Driver : Pull-Push driver                                                 */
  MDR_PORTA_PD_Driver_Pin_4_OpenDrain  = 1,     /*!< OpenDrain : Work with line pulled up to Ucc                               */
} MDR_PORTA_PD_Driver_Pin_4_Enum;

/* ===========================================  MDR_PORTA PD Driver_Pin_5 [5..5]  ============================================ */
typedef enum {                                  /*!< MDR_PORTA_PD_Driver_Pin_5                                                 */
  MDR_PORTA_PD_Driver_Pin_5_Driver     = 0,     /*!< Driver : Pull-Push driver                                                 */
  MDR_PORTA_PD_Driver_Pin_5_OpenDrain  = 1,     /*!< OpenDrain : Work with line pulled up to Ucc                               */
} MDR_PORTA_PD_Driver_Pin_5_Enum;

/* ===========================================  MDR_PORTA PD Driver_Pin_6 [6..6]  ============================================ */
typedef enum {                                  /*!< MDR_PORTA_PD_Driver_Pin_6                                                 */
  MDR_PORTA_PD_Driver_Pin_6_Driver     = 0,     /*!< Driver : Pull-Push driver                                                 */
  MDR_PORTA_PD_Driver_Pin_6_OpenDrain  = 1,     /*!< OpenDrain : Work with line pulled up to Ucc                               */
} MDR_PORTA_PD_Driver_Pin_6_Enum;

/* ===========================================  MDR_PORTA PD Driver_Pin_7 [7..7]  ============================================ */
typedef enum {                                  /*!< MDR_PORTA_PD_Driver_Pin_7                                                 */
  MDR_PORTA_PD_Driver_Pin_7_Driver     = 0,     /*!< Driver : Pull-Push driver                                                 */
  MDR_PORTA_PD_Driver_Pin_7_OpenDrain  = 1,     /*!< OpenDrain : Work with line pulled up to Ucc                               */
} MDR_PORTA_PD_Driver_Pin_7_Enum;

/* ===========================================  MDR_PORTA PD Driver_Pin_8 [8..8]  ============================================ */
typedef enum {                                  /*!< MDR_PORTA_PD_Driver_Pin_8                                                 */
  MDR_PORTA_PD_Driver_Pin_8_Driver     = 0,     /*!< Driver : Pull-Push driver                                                 */
  MDR_PORTA_PD_Driver_Pin_8_OpenDrain  = 1,     /*!< OpenDrain : Work with line pulled up to Ucc                               */
} MDR_PORTA_PD_Driver_Pin_8_Enum;

/* ===========================================  MDR_PORTA PD Driver_Pin_9 [9..9]  ============================================ */
typedef enum {                                  /*!< MDR_PORTA_PD_Driver_Pin_9                                                 */
  MDR_PORTA_PD_Driver_Pin_9_Driver     = 0,     /*!< Driver : Pull-Push driver                                                 */
  MDR_PORTA_PD_Driver_Pin_9_OpenDrain  = 1,     /*!< OpenDrain : Work with line pulled up to Ucc                               */
} MDR_PORTA_PD_Driver_Pin_9_Enum;

/* ==========================================  MDR_PORTA PD Driver_Pin_10 [10..10]  ========================================== */
typedef enum {                                  /*!< MDR_PORTA_PD_Driver_Pin_10                                                */
  MDR_PORTA_PD_Driver_Pin_10_Driver    = 0,     /*!< Driver : Pull-Push driver                                                 */
  MDR_PORTA_PD_Driver_Pin_10_OpenDrain = 1,     /*!< OpenDrain : Work with line pulled up to Ucc                               */
} MDR_PORTA_PD_Driver_Pin_10_Enum;

/* ==========================================  MDR_PORTA PD Driver_Pin_11 [11..11]  ========================================== */
typedef enum {                                  /*!< MDR_PORTA_PD_Driver_Pin_11                                                */
  MDR_PORTA_PD_Driver_Pin_11_Driver    = 0,     /*!< Driver : Pull-Push driver                                                 */
  MDR_PORTA_PD_Driver_Pin_11_OpenDrain = 1,     /*!< OpenDrain : Work with line pulled up to Ucc                               */
} MDR_PORTA_PD_Driver_Pin_11_Enum;

/* ==========================================  MDR_PORTA PD Driver_Pin_12 [12..12]  ========================================== */
typedef enum {                                  /*!< MDR_PORTA_PD_Driver_Pin_12                                                */
  MDR_PORTA_PD_Driver_Pin_12_Driver    = 0,     /*!< Driver : Pull-Push driver                                                 */
  MDR_PORTA_PD_Driver_Pin_12_OpenDrain = 1,     /*!< OpenDrain : Work with line pulled up to Ucc                               */
} MDR_PORTA_PD_Driver_Pin_12_Enum;

